m4_include(`farversion.m4')m4_dnl
.Language=Russian,Russian (Русский)
.Options CtrlColorChar=\
.Options CtrlStartPosChar=^<wrap>


@CodepagesSettings=CodepagesMenu
@ConfirmationsSettings=ConfirmDlg
@DescriptionsSettings=FileDiz
@Editor.WordDiv=System.WordDiv
@History.CommandHistory.Count=History.Config
@History.CommandHistory.Lifetime=History.Config
@History.DialogHistory.Count=History.Config
@History.DialogHistory.Lifetime=History.Config
@History.FolderHistory.Count=History.Config
@History.FolderHistory.Lifetime=History.Config
@History.ViewEditHistory.Count=History.Config
@History.ViewEditHistory.Lifetime=History.Config
@Interface.CompletionSettings=AutoCompleteSettings
@Interface.CursorSize1=Interface.CursorSize
@Interface.CursorSize2=Interface.CursorSize
@Interface.CursorSize3=Interface.CursorSize
@Interface.CursorSize4=Interface.CursorSize
@Interface.EditorTitleFormat=TitleFormat
@Interface.ViewerTitleFormat=TitleFormat
@InterfaceSettings=InterfSettings
@Panel.InfoSettings=InfoPanel
@Panel.Layout.DoubleGlobalColumnSeparator=PanelSettings
@Panel.Left=PanelCmdSort
@Panel.Right=PanelCmdSort
@Panel.Tree.AutoChangeFolder=TreeSettings
@Panel.Tree.MinTreeCount=TreeSettings
@ScreenSettings=InterfSettings
@System.MsHWheelDelta=System.MsWheelDelta
@System.MsHWheelDeltaEdit=System.MsWheelDelta
@System.MsHWheelDeltaView=System.MsWheelDelta
@System.MsWheelDeltaEdit=System.MsWheelDelta
@System.MsWheelDeltaHelp=System.MsWheelDelta
@System.MsWheelDeltaView=System.MsWheelDelta
@Viewer.F8CPs=Editor.F8CPs
@XLat.Rules1=XLat.Rules
@XLat.Rules2=XLat.Rules
@XLat.Rules3=XLat.Rules
@XLat.Table1=XLat.Tables
@XLat.Table2=XLat.Tables


@Contents
$^#Программа управления файлами и архивами#
$^#M4_MACRO_GET(FULLVERSION)#
$^#Copyright © 1996-2000 Eugene Roshal#
$^#Copyright © 2000-M4_MACRO_GET(COPYRIGHTYEAR) Far Group#
 ~Индекс файла помощи~@Index@
 ~Как пользоваться помощью~@Help@

 ~Что такое Far~@About@
 ~Лицензия~@License@

 ~Параметры командной строки~@CmdLine@
 ~Клавиатурные команды~@KeyRef@
 ~Поддержка плагинов~@Plugins@
 ~Обзор возможностей плагинов~@PluginsReviews@

 ~Панели~@Panels@:
  ~Панель файлов~@FilePanel@
  ~Дерево папок~@TreePanel@
  ~Панель информации~@InfoPanel@
  ~Панель быстрого просмотра~@QViewPanel@
  ~Перетаскивание файлов~@DragAndDrop@
  ~Настройка режимов просмотра панели файлов~@PanelViewModes@
  ~Пометка файлов~@SelectFiles@

 ~Меню~@Menus@:
  ~Меню левой и правой панелей~@LeftRightMenu@
  ~Меню файлов~@FilesMenu@
  ~Меню команд~@CmdMenu@
  ~Меню параметров~@OptMenu@

 ~Поиск файла~@FindFile@
 ~История команд~@History@
 ~Поиск папки~@FindFolder@
 ~Сравнение папок~@CompFolders@
 ~Меню пользователя~@UserMenu@
 ~Меню выбора диска~@DriveDlg@

 ~Ассоциации файлов~@FileAssoc@
 ~Команды операционной системы~@OSCommands@
 ~Ссылки на папки~@FolderShortcuts@
 ~Группы сортировки~@SortGroups@
 ~Меню фильтров~@FiltersMenu@
 ~Переключение между экранами~@ScrSwitch@
 ~Список задач~@TaskList@
 ~Список устройств~@HotPlugList@

 ~Системные параметры~@SystemSettings@
 ~Настройки панели~@PanelSettings@
 ~Настройки дерева папок~@TreeSettings@
 ~Настройки интерфейса~@InterfSettings@
 ~Настройки диалогов~@DialogSettings@
 ~Настройки меню~@VMenuSettings@
 ~Настройки командной строки~@CmdlineSettings@

 ~Раскраска файлов и группы сортировки~@Highlight@
 ~Описания файлов~@FileDiz@
 ~Настройки программы просмотра~@ViewerSettings@
 ~Настройки редактора~@EditorSettings@

 ~Копирование, перенос, переименование и создание ссылок~@CopyFiles@

 ~Встроенная программа просмотра~@Viewer@
 ~Встроенный редактор~@Editor@

 ~Маски файлов~@FileMasks@
 ~Клавиатурные макрокоманды~@KeyMacro@

 ~Настройка элементов пользовательского интерфейса~@CustomizingUI@


@Help
$ #Far: как пользоваться помощью#
 В оглавлении справочной системы имеются ссылки (они функционируют примерно
так же, как и гиперссылки, знакомые каждому пользователю Интернет), которые
указывают на разделы с более подробной информацией. Дополнительно на главной
странице находится "~Индекс файла помощи~@Index@", он показывает оглавления
всех страничек (топиков) имеющихся в файле помощи и, в ряде случаев, позволяет
быстрее найти необходимую информацию.

 Для перемещения между ссылками вы можете использовать #Tab# и #Shift+Tab#.
Нажатие #Enter# вызовет страницу, соответствующую выбранной ссылке. Этот же
результат можно получить нажав кнопку "мыши" на требуемой ссылке.

 Если текст помещается в окне помощи не полностью, то появляется полоса
прокрутки. В этом случае текст можно перемещать вверх и вниз с помощью #клавиш#
#управления курсором#.

 Нажатие #Alt+F1# или #BS# приводит к переходу на предыдущую страницу.
#Shift+F1# вызывает содержание помощи.

 Нажмите #Shift+F2#, чтобы получить помощь по ~плагинам~@Plugins@.

 Нажмите #F7#, чтобы найти подстроку в текущем файле помощи. Результаты
поиска будут выведены в виде ссылок на темы.

 По умолчанию "#Помощь#" показывается в свёрнутом окне, развернуть его можно
при помощи клавиши #F5# "#Размер#", повторное нажатие #F5# вернёт размер окна в
первоначальное состояние.


@About
$ #Far: что это такое#
 #Far# - это работающая в текстовом режиме программа управления файлами для
Windows, которая обеспечивает обработку файлов с #длинными именами# и имеет
обширный набор дополнительных функций.

 #Far# является #freeware# и #open source# программой, распространяемой
под модифицированной BSD ~лицензией~@License@.

 #Far# позволяет работать с #архивами#. При этом файлы в архивах
обрабатываются аналогично файлам в папках. #Far# сам преобразует ваши команды в
соответствующие вызовы внешних архиваторов.

 #Far# также обеспечивает значительное количество сервисных функций.


@License
$ #Far: Лицензия#
 Copyright © 1996 Eugene Roshal
 Copyright © 2000 Far Group
 All rights reserved.

 Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
 1. ^<wrap>Redistributions of source code must retain the above copyright
notice, this list of conditions and the following disclaimer.
 2. Redistributions in binary form must reproduce the above copyright
notice, this list of conditions and the following disclaimer in the
documentation and/or other materials provided with the distribution.
 3. The name of the authors may not be used to endorse or promote products
derived from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.


@CmdLine
$ #Far: параметры командной строки#
 В командной строке могут быть использованы следующие параметры:

 #-e[<строка>[:<позиция>]] <filename>#
  Редактирование указанного файла. После -e можно дополнительно указать строку
и позицию в строке, устанавливаемые после запуска редактора.
 Например: far -e70:2 readme.

 #-p[<path>]#
 Искать плагины в папке, указанной в <path>.
 Можно указать несколько путей поиска, разделённых символом ‹;›. При указании
пути поиска можно использовать переменные среды.

 Например: #far -p%USERPROFILE%\\Far\\Plugins#

 #-co#
 Заставляет Far загружать плагины только из кэша. Загрузка при этом происходит
быстрее, но новые или изменённые плагины не обнаруживаются. Имеет смысл применять
#только# при стабильном списке плагинов. После добавления, замены или удаления плагинов
надо загрузить Far без этого параметра. Если кэша нет, то плагины загружаться не будут.

 Замечания относительно ключей -p и -co:
 - ^<wrap>если указан пустой -p, то Far запустится без плагинов;
 - ^<wrap>если указан -p<path>, то загрузятся только плагины из <path>;
 - ^<wrap>если указан только ключ -co и кэш плагинов не пуст, то
загружаются плагины из кэша;
 - ^<wrap>ключ -co игнорируется, если также указан -p;
 - ^<wrap>если не указаны ключи -p и -co, то загрузятся плагины из папки
'Plugins', находящейся одной папке с Far.exe и из папки 'Plugins', находящейся
в профиле пользователя (по умолчанию #%APPDATA%\\Far Manager\\Profile#).

 #-m#
 При старте Far не будет загружать макрокоманды.

 #-ma#
 При старте Far не будет выполнять макрокоманды с опцией "Выполнять после запуска Far".

 #-s <profilepath> [<localprofilepath>]#
 Конфигурационные файлы искать в каталоге <profilepath> [<localprofilepath>]
(переопределяет значение UserProfileDir [UserLocalProfileDir] из ini-файла).

 #-u <username>#
 Позволяет использовать раздельные настройки для различных пользователей (влияет только на плагины от Far Manager 1.x)
 Например: far -u guest

 Far Manager установит ~переменную среды~@FAREnv@ "FARUSER" в значение, равное <username>.

 #-v <filename>#
 Просмотр указанного файла. Если в качестве <filename> использовано `#-#', данные
будут читаться из stdin (стандартного входного потока).

 Например, "dir|far -v -" выведет результат работы команды dir.

 Если при использовании ‹-› входной поток пуст (например, вы не указали команду dir
в указанном примере), то Far будет ждать завершения входного потока пока вы не нажмёте Ctrl+Break.

 #-w[-]#
 Подстраиваться под размер консольного окна вместо консольного буфера или наоборот.

 #-t templateprofile#
 Задаёт файл в котором располагаются умолчательные настройки, которые применяются,
если какой-либо из конфигурационных файлов не существует. Параметр templateprofile
переопределяет значение TemplateProfile из ini-файла.

 #-title[:<title>]#
 Если строка <title> присутствует, использовать её как заголовок окна;
иначе наследовать заголовок окна консоли. Макрос #%Default# в заданной
строке заголовка будет заменяться на стандартный, зависящий от контекста
заголовок окна Far.

 #-clearcache [profilepath [localprofilepath]]#
 Очистить кэш плагинов и завершить работу.
 Необязательный параметр profilepath задаёт полный путь к конфигурационным файлам.
Параметр profilepath переопределяет значение UserProfileDir из ini-файла.
Параметр localprofilepath переопределяет значение UserLocalProfileDir из ini-файла.

 #-export <out.farconfig> [profilepath [localprofilepath]]#
 Экспортировать все настройки в файл out.farconfig и завершить работу.
 Необязательный параметр profilepath задаёт полный путь к конфигурационным файлам.
Параметр profilepath переопределяет значение UserProfileDir из ini-файла.
Параметр localprofilepath переопределяет значение UserLocalProfileDir из ini-файла.

 #-import <in.farconfig> [profilepath [localprofilepath]]#
 Импортировать все настройки из файла in.farconfig и завершить работу.
 Необязательный параметр profilepath задаёт полный путь к конфигурационным файлам.
Параметр profilepath переопределяет значение UserProfileDir из ini-файла.
Параметр localprofilepath переопределяет значение UserLocalProfileDir из ini-файла.

 #-ro[-]#
 Работа без сохранения изменений в базах настроек. Этот режим позволяет работать
с настройками доступными только для чтения, в том числе на защищённых от записи носителях.
Опция переопределяет значение ReadOnlyConfig из ini-файла.

 #-set:<parameter>=<value>#
 Изменить значение конфигурационного параметра. См. ~far:config~@FarConfig@.

 #-x#
 Отключить обработку исключительных ситуаций. Параметр предназначен для разработчиков
и не рекомендуется в обычных ситуациях.

 В командной строке можно указать не более двух путей (к каталогам, файлам, архивам)
или двух команд с префиксом плагина. Первый путь для активной панели, второй - для пассивной:
 - ^<wrap>для каталогов и архивов Far покажет их содержимое;
 - ^<wrap>для файлов - произойдёт переход в каталог с файлом и позиционирование на указанный файл, если он существует;
 - ^<wrap>при указании префиксов плагинов (допускается смешанное использование с обычными путями) сначала выполняется
команда для пассивной панели (пассивная панель при этом временно активируется).
Односимвольные префиксы A-Z, или совпадающие с именем активного диска игнорируются.
 Пример: far arc:c:\\Far20.7z "lua:msgbox('Far Manager','Successfully started')"


@KeyRef
$ #Клавиатурные команды#
 ~Команды управления панелями~@PanelCmd@

 ~Командная строка~@CmdLineCmd@

 ~Управление файлами и сервисные команды~@FuncCmd@

 ~Мышь: поддержка колеса~@MsWheel@

 ~Команды управления меню~@MenuCmd@

 ~Копирование текста с экрана~@Grabber@

 ~Общие команды~@MiscCmd@

 ~Специальные команды~@SpecCmd@


@MenuCmd
$ #Команды управления меню#
 #Общие команды для меню и выпадающих списков#

 #Ctrl+Alt+F,RAlt#
 Фильтровать элементы меню или списка.

 #Ctrl+Alt+L#
 Зафиксировать фильтр.

 #Alt+Left#, #Alt+Right#
 Сдвинуть все элементы горизонтально на одну позицию.

 #Alt+Shift+Left#, #Alt+Shift+Right#
 Сдвинуть выбранный элемент горизонтально на одну позицию.

 #Ctrl+Alt+Left#, #Ctrl+Alt+Right#
 Сдвинуть все элементы горизонтально на 20 позиций.

 #Ctrl+Shift+Left#, #Ctrl+Shift+Right#
 Сдвинуть выбранный элемент горизонтально на 20 позиций.

 #Alt+Home#
 Выравнять все элементы налево.

 #Alt+End#
 Выравнять все элементы направо.

 #Alt+Shift+Home#
 Выравнять выбранный элемент налево.

 #Alt+Shift+End#
 Выравнять выбранный элемент направо.

 См. также список ~макроклавиш~@KeyMacroMenuList@, доступных в меню.


@PanelCmd
$ #Команды управления панелями#
 #Общие команды#

 Изменить активную панель                                       #Tab#
 Поменять панели местами                                     #Ctrl+U#
 Перечитать содержимое панели                                #Ctrl+R#
 Убрать/показать информационную панель                       #Ctrl+L#
 Убрать/показать ~панель быстрого просмотра~@QViewPanel@                   #Ctrl+Q#
 Убрать/показать ~дерево папок~@TreePanel@                                #Ctrl+T#
 Убрать/показать обе панели                                  #Ctrl+O#
 Временно убрать обе панели                          #Ctrl+Alt+Shift#
  (работает до тех пор, пока удерживаем эти клавиши)
 Убрать/показать неактивную панель                           #Ctrl+P#
 Убрать/показать левую панель                               #Ctrl+F1#
 Убрать/показать правую панель                              #Ctrl+F2#
 Изменить высоту панелей                          #Ctrl+Up,Ctrl+Down#
 Изменить высоту текущей панели       #Ctrl+Shift+Up,Ctrl+Shift+Down#
 Изменить ширину панелей                       #Ctrl+Left,Ctrl+Right#
 (при пустой командной строке)
 Восстановить ширину панелей по умолчанию              #Ctrl+Numpad5#
 Восстановить высоту панелей по умолчанию          #Ctrl+Alt+Numpad5#
 Спрятать/Показать линейку функциональных клавиш             #Ctrl+B#
 Переключение режима показа общего размера файлов и    #Ctrl+Shift+S#
 свободного места в байтах (если можно) или с суффиксами К/М/Г/Т

 #Команды файловой панели#

 ~Пометить/снять пометку файла~@SelectFiles@            #Ins, Shift+Клавиши курсора#
                                         #Щелчок правой кнопкой мыши#
 Пометить группу                                             #Gray +#
 Снять пометку с группы                                      #Gray -#
 Инвертировать пометку                                       #Gray *#
 Пометить файлы с с таким же расширением,             #Ctrl+<Gray +>#
 как у текущего файла
 Снять пометку с файлов с таким же расширением,       #Ctrl+<Gray ->#
 как у текущего файла
 Инвертировать пометку, включая папки                 #Ctrl+<Gray *>#
 Пометить файлы с именем, как у текущего файла         #Alt+<Gray +>#
 Снять пометку с файлов с таким же именем,             #Alt+<Gray ->#
 как у текущего файла
 Инвертировать пометку файлов, снять пометку с папок   #Alt+<Gray *>#
 Пометить все файлы                                  #Shift+<Gray +>#
 Снять пометку со всех файлов                        #Shift+<Gray ->#
 Восстановить предыдущую пометку                             #Ctrl+M#

 Прокрутка длинных имён и описаний               #Alt+Left,Alt+Right#
                                                   #Alt+Home,Alt+End#

 Установить краткий режим просмотра                     #ЛевыйCtrl+1#
 Установить средний режим просмотра                     #ЛевыйCtrl+2#
 Установить полный режим просмотра                      #ЛевыйCtrl+3#
 Установить широкий режим просмотра                     #ЛевыйCtrl+4#
 Установить детальный режим просмотра                   #ЛевыйCtrl+5#
 Установить режим просмотра описаний                    #ЛевыйCtrl+6#
 Установить режим просмотра длинных описаний            #ЛевыйCtrl+7#
 Установить режим просмотра владельцев файлов           #ЛевыйCtrl+8#
 Установить режим просмотра ссылок файлов               #ЛевыйCtrl+9#
 Установить альтернативный полный режим просмотра       #ЛевыйCtrl+0#

 Убрать/показать файлы с атрибутом "Скрытый" и "Системный"   #Ctrl+H#
 Переключить отображение длинных/коротких имён файлов        #Ctrl+N#

 Спрятать/Показать левую панель                             #Ctrl+F1#
 Спрятать/Показать правую панель                            #Ctrl+F2#

 Сортировать файлы активной панели по имени                 #Ctrl+F3#
 Сортировать файлы активной панели по расширению            #Ctrl+F4#
 Сортировать файлы активной панели по времени записи        #Ctrl+F5#
 Сортировать файлы активной панели по размеру               #Ctrl+F6#
 Не сортировать файлы активной панели                       #Ctrl+F7#
 Сортировать файлы активной панели по времени создания      #Ctrl+F8#
 Сортировать файлы активной панели по времени доступа       #Ctrl+F9#
 Сортировать файлы активной панели по описаниям            #Ctrl+F10#
 Сортировать файлы активной панели по владельцу            #Ctrl+F11#
 Вывести меню ~режимов сортировки~@PanelCmdSort@                           #Ctrl+F12#
 Использовать сортировку по группам                       #Shift+F11#
 Показывать помеченные файлы первыми                      #Shift+F12#

 Создать ~ссылку на папку~@FolderShortcuts@                             #Ctrl+Shift+0…9#
 Перейти по ссылке на папку                          #ПравыйCtrl+0…9#

 Если активная панель является ~панелью быстрого просмотра~@QViewPanel@,
~деревом каталогов~@TreePanel@ или ~информационной панелью~@InfoPanel@, то каталог
меняется не на активной, а на пассивной панели.

 #Ctrl+Ins#
 Поместить помеченные имена в Буфер Обмена (при пустой командной строке).

 #Ctrl+Shift+Ins#
 Поместить помеченные имена в Буфер Обмена.

 #Alt+Shift+Ins#
 Поместить помеченные полные имена в Буфер Обмена.

 #Ctrl+Alt+Ins#
 Поместить реальные имена помеченных файлов в Буфер Обмена.

 #Ctrl+Shift+C#
 Поместить помеченные файлы в Буфер Обмена.

 #Ctrl+Shift+X#
 Вырезать помеченные файлы в Буфер Обмена.

 При копировании имён файлов с панели в буфер обмена скопированные файлы могут быть вставлены в других приложениях (Проводник и т.п.).

 См. также список ~макроклавиш~@KeyMacroShellList@, доступных в панелях.

 Примечания:

 1. ^<wrap>Если включена опция "Разрешить обратную сортировку" в диалоге
~Настроек панели~@PanelSettings@, то повторное нажатие одной и той же клавиши
сортировки файлов приводит к смене направления сортировки с возрастающей на убывающую и наоборот;

 2. ^<wrap>Комбинации Alt+Left and Alt+Right, используемые для прокрутки
длинных имён и описаний, не работают с клавишами Left и Right, расположенными
на цифровой клавиатуре, потому что эти клавиши используются для ввода символов
через их десятичные коды.

 3. ^<wrap>Комбинация клавиш #Ctrl+Alt+Ins# работает по следующим правилам:
    - ^<wrap>для сетевых дисков: сетевое (UNC) имя файлового объекта;
    - ^<wrap>для локальных дисков: полное имя с учётом ~символических~@HardSymLink@ ссылок.

 4. ^<wrap>Комбинации клавиш #Ctrl+Ins#, #Alt+Shift+Ins# и #Ctrl+Alt+Ins# обрабатывают
имя "#..#" как имя текущей папки.


@PanelCmdSort
$ #Режимы сортировки#
 Меню режимов сортировки вызывается комбинацией #Ctrl+F12# и применяется для
активной в данный момент панели. Доступны следующие режимы сортировки панели:

 Сортировать файлы по имени                                 #Ctrl+F3#
 Сортировать файлы по расширению                            #Ctrl+F4#
 Сортировать файлы по времени записи                        #Ctrl+F5#
 Сортировать файлы по размеру                               #Ctrl+F6#
 Не сортировать файлы                                       #Ctrl+F7#
 Сортировать файлы по времени создания                      #Ctrl+F8#
 Сортировать файлы по времени доступа                       #Ctrl+F9#
 Сортировать файлы по описаниям                            #Ctrl+F10#
 Сортировать файлы по владельцу                            #Ctrl+F11#

 Клавиша #+# устанавливает прямую сортировку.
 Клавиша #-# устанавливает обратную сортировку.
 Клавиша #*# меняет сортировку на обратную.

 Использовать сортировку по группам                       #Shift+F11#
 Показывать помеченные файлы первыми                      #Shift+F12#

 You can ~fine-tune~@PanelSortCriteria@ sort modes by pressing #F4#.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@PanelSortCriteria
$ #Sort criteria#
 When files are considered equivalent using the selected sort mode, additional sort criteria are taken into account.
 For example, if files are sorted by size and both "a.txt" and "b.txt" have the same size, "a.txt" will come first, as if they were sorted by name.
 In this menu you can adjust the set of criteria associated with the selected sort mode.

 #Ins#
 Add a criterion to the set.

 #Del#
 Remove the selected criterion.

 #F4#
 Replace the selected criterion.

 #+#
 Use ascending order.

 #-#
 Use descending order.

 #*#
 Change the order.

 #=#
 Inherit the order from the corresponding sort mode.

 #Ctrl+Up#
 Move the criterion up.

 #Ctrl+Down#
 Move the criterion down.

 #Ctrl+R#
 Reset the set of criteria to default.


@FastFind
$ #Быстрый поиск в панелях#
 Для позиционирования на файл можно воспользоваться операцией #быстрого#
#поиска# по первым буквам имени. Для этого, удерживая клавишу #Alt# (или
#Alt+Shift#), набирайте имя требуемого файла, пока на него не переместится
курсор.

 С помощью #Ctrl+Enter# можно циклически перемещаться по элементам панели в
соответствии с введённой в строке файловой маской. #Ctrl+Shift+Enter# позволяет
перемещаться по элементам в обратном направлении.

 Кроме обычных символов в имени файла также можно использовать символы ‹#*#›
и ‹#?#›.

 Вставка содержимого буфера обмена (клавишами #Ctrl+V# или #Shift+Ins#) в
окно быстрого поиска производится до тех пор, пока есть совпадение.

 В процессе набора имени можно применять функцию транслитерации при
ошибочной раскладке клавиатуры. В этом случае Far перекодирует набранный текст
и пытается найти первое совпадение нового имени. Подробнее о назначении клавиш
для транслитерации см. ~XLat.Flags~@XLat.Flags@.

 См. также список ~макроклавиш~@KeyMacroSearchList@, доступных в быстром поиске файла.


@CmdLineCmd
$ #Командная строка#
 #Общие команды#

 Символ влево                                           #Left,Ctrl+S#
 Символ вправо                                         #Right,Ctrl+D#
 Слово влево                                              #Ctrl+Left#
 Слово вправо                                            #Ctrl+Right#
 В начало строки                                          #Ctrl+Home#
 В конец строки                                            #Ctrl+End#
 Удалить символ                                                 #Del#
 Удалить символ слева                                            #BS#
 Удалить до конца строки                                     #Ctrl+K#
 Удалить слово слева                                        #Ctrl+BS#
 Удалить слово справа                                      #Ctrl+Del#
 Копировать в Буфер Обмена                                 #Ctrl+Ins#
 Вставить из Буфера Обмена                                #Shift+Ins#
 Предыдущая команда                                          #Ctrl+E#
 Следующая команда                                           #Ctrl+X#
 Очистить командную строку                                   #Ctrl+Y#

 #Команды вставки#

 Вставить имя файла из активной панели            #Ctrl+J,Ctrl+Enter#

 В режиме ~быстрого поиска~@FastFind@ #Ctrl+Enter# не вставляет имя
файла, а производит циклический обход по элементам файловой панели.

 Вставить имя файла из пассивной панели            #Ctrl+Shift+Enter#
 Вставить полное имя файла из активной панели                #Ctrl+F#
 Вставить полное имя файла из пассивной панели               #Ctrl+;#
 Вставить сетевое (UNC) имя файла из активной панели     #Ctrl+Alt+F#
 Вставить сетевое (UNC) имя файла из пассивной панели    #Ctrl+Alt+;#

 Вставить путь из левой панели                               #Ctrl+[#
 Вставить путь из правой панели                              #Ctrl+]#
 Вставить сетевой (UNC) путь из левой панели             #Ctrl+Alt+[#
 Вставить сетевой (UNC) путь из правой панели            #Ctrl+Alt+]#

 Вставить путь из активной панели                      #Ctrl+Shift+[#
 Вставить путь из пассивной панели                     #Ctrl+Shift+]#
 Вставить сетевой (UNC) путь из активной панели         #Alt+Shift+[#
 Вставить сетевой (UNC) путь из пассивной панели        #Alt+Shift+]#

 Примечания:

 1. ^<wrap>Если командная строка пуста, #Ctrl+Ins# будет копировать имена
выбранных в панели файлов в Буфер Обмена так же, как и #Ctrl+Shift+Ins#
(см. ~Команды управления панелями~@PanelCmd@);

 2. ^<wrap>#Ctrl+End#, нажатая в конце командной строки, заменяет её текущее
содержимое командой из ~истории команд~@History@, начинающейся с уже введённых
букв, если такая команда существует. Чтобы перейти к следующей такой команде,
вы можете нажать #Ctrl+End# повторно.

 3. ^<wrap>Большинство из описанных выше команд действительно для всех строк
редактирования, включая строки в диалогах и встроенный редактор.

 4. ^<wrap>#Alt+Shift+Left#, #Alt+Shift+Right#, #Alt+Shift+Home# и #Alt+Shift+End#
выделяют блок в командной строке независимо от состояния панелей.

 5. ^<wrap>Комбинации клавиш, позволяющие получить сетевое (UNC) имя файлового
объекта, работают по следующим правилам:
 - ^<wrap>для сетевых дисков: сетевое (UNC) имя файлового объекта;
 - ^<wrap>для локальных дисков: полное имя с учётом ~символических~@HardSymLink@ ссылок.


@FuncCmd
$ #Команды управления панелями - сервисные команды#
 Контекстная помощь                                              #F1#

 Вызвать ~пользовательское меню~@UserMenu@                                   #F2#

 Просмотр                                #Ctrl+Shift+F3, Numpad5, F3#
 Если #Numpad5# или #F3# нажаты на файле, они вызывают
~встроенную~@Viewer@, внешнюю или ~ассоциированную~@FileAssoc@ программу
просмотра, в зависимости от типа файла и ~настроек программы просмотра~@ViewerSettings@.
#Ctrl+Shift+F3# всегда вызывает встроенную программу просмотра, вне
зависимости от файловых ассоциаций.
 При нажатии любой из этих клавиш на папке вычисляются и показываются
размеры выбранных папок.

 Редактирование, Распаковка                       #Ctrl+Shift+F4, F4#
 #F4# вызывает ~встроенный~@Editor@, внешний или ~ассоциированный~@FileAssoc@
редактор, в зависимости от типа файла и ~настроек редактора~@EditorSettings@.
#Ctrl+Shift+F4# всегда вызывает встроенный редактор, вне зависимости от файловых ассоциаций.
 #F4# и #Ctrl+Shift+F4# для папок вызывают диалог смены файловых ~атрибутов~@FileAttrDlg@.

 ~Копирование~@CopyFiles@                                                     #F5#
 Копирует файлы и папки. Если вы хотите создать папку назначения перед
копированием, добавьте к её имени обратную черту (\\).

 ~Переименование или перенос~@CopyFiles@                                      #F6#
 Переименование или перенос файлов и папок. Если вы хотите создать папку
назначения перед переносом, добавьте к её имени обратную черту (\\).

 ~Создание новой папки~@MakeFolder@                                            #F7#

 ~Удаление файлов и папок~@DeleteFile@                    #Shift+Del, Shift+F8, F8#

 ~Уничтожение файлов и папок~@DeleteFile@                                 #Alt+Del#

 Показать горизонтальное ~меню~@Menus@                                    #F9#

 Завершить работу с Far                                         #F10#

 Показать команды ~плагинов~@Plugins@                          #F11#

 Изменить текущий диск в левой панели                        #Alt+F1#

 Изменить текущий диск в правой панели                       #Alt+F2#

 Встроенная/внешняя программа просмотра                      #Alt+F3#
 Вызывает в зависимости от типа файла
~ассоциированную программу просмотра~@FileAssoc@ или внешнюю программу
просмотра, указанную в ~настройках программы просмотра~@ViewerSettings@,
если по умолчанию используется внутренняя, или внутреннюю,
если по умолчанию используется внешняя.

 Встроенный/внешний редактор                                 #Alt+F4#
 Вызывает в зависимости от типа файла ~ассоциированный редактор~@FileAssoc@
или внешний редактор, указанный в ~настройках~@EditorSettings@, если по
умолчанию используется внутренний, и внутренний, если по умолчанию используется
внешний.

 Печать файлов                                               #Alt+F5#
 Если установлен плагин "Print Manager", то печать выделенных файлов
осуществляется через него, иначе - средствами Far.

 Создание ~ссылок~@HardSymLink@ файлов и папок                              #Alt+F6#
 Используя жёсткие ссылки файлов, вы можете иметь несколько различных имён
файлов, ссылающихся на одни и те же данные.

 Произвести ~поиск файла~@FindFile@                                      #Alt+F7#

 Показать ~историю команд~@History@                                     #Alt+F8#

 Изменение размеров окна Far Manager                         #Alt+F9#
 В оконном режиме переключение происходит с нормального до максимально
допустимого размера консольного окна и обратно. В полноэкранном режиме #Alt+F9#
переключает экран с 25 линий на 50 и обратно. Подробнее см. параметр ~Interface.AltF9~@Interface.AltF9@.

 Настройка параметров ~плагинов~@Plugins@                         #Alt+Shift+F9#

 Произвести ~поиск папки~@FindFolder@                                     #Alt+F10#

 Показать ~историю просмотра и редактирования~@HistoryViews@                #Alt+F11#

 Показать ~историю папок~@HistoryFolders@                                     #Alt+F12#

 Добавить файлы к архиву                                   #Shift+F1#
 Извлечь файлы из архива                                   #Shift+F2#
 Выполнить команды управления архивом                      #Shift+F3#

 Редактировать ~новый файл~@FileOpenCreate@                                  #Shift+F4#
 При создании нового файла используется кодовая страница, выбранная в
последнем открытом редакторе. Если редактор открывается впервые в текущей
сессии Far, используется кодовая страница по умолчанию.

 Копирование файла под курсором                            #Shift+F5#
 Переименование или перенос файла под курсором             #Shift+F6#
 Для папки: если заданный относительный или абсолютный путь соответствует
существующей папке, то происходит перемещение в эту папку.
 Например, при перемещении #c:\folder1\# в #d:\folder2\#:
 - ^<wrap>если #d:\folder2\# существует, то содержимое #c:\folder1\# переместится в
#d:\folder2\folder1\#;
 - ^<wrap>в противном случае содержимое #c:\folder1\# переместится во
вновь созданную папку #d:\folder2\#.

 ~Удаление файла~@DeleteFile@ под курсором                               #Shift+F8#

 Сохранить конфигурацию                                    #Shift+F9#

 Выбрать последний выполненный пункт меню                 #Shift+F10#

 Запуск, смена папки, вход в архив                            #Enter#
 Запуск в отдельном окне                                #Shift+Enter#
 Запуск от имени администратора                      #Ctrl+Alt+Enter#

 #Shift+Enter# для папки вызывает Проводник с показом содержимого выбранной
папки. Для того, чтобы в Проводнике показать корневую папку, нужно нажать
#Shift+Enter# на требуемом диске в ~Меню выбора диска~@DriveDlg@.
#Shift+Enter# на папке с именем "#..#" открывает в Проводнике текущую папку.

 Сменить папку на корневую                                   #Ctrl+\\#

 Смена папки, вход в архив                        #Ctrl+[Shift+]PgDn#
 (включая в SFX архив)
 Если курсор указывает на папку, то производится смена текущей папки на
указываемую. Если курсор указывает на файл, то, в зависимости от типа файла,
выполняется ~ассоциированная команда~@FileAssoc@, или происходит вход в архив.
#Ctrl+Shift+PgDn# всегда инициирует вход в архив, вне зависимости от
файловых ассоциаций.

 Перейти в папку уровнем выше                             #Ctrl+PgUp#
 Поведение в корневой папке зависит от опции "~Использовать Ctrl+PgUp для выбора диска~@InterfSettings@".

 Создать ссылку на текущую папку                     #Ctrl+Shift+0…9#

 Использовать ссылку на папку                        #ПравыйCtrl+0…9#

 Установить ~файловые атрибуты~@FileAttrDlg@                                #Ctrl+A#

 ~Применить команду~@ApplyCmd@ к помеченным файлам                       #Ctrl+G#

 Добавить ~описания~@FileDiz@ к помеченным файлам                       #Ctrl+Z#


@DeleteFile
$ #Удаление и уничтожение файлов и папок#
 Для удаления или уничтожения файлов и папок применяются следующие сочетания клавиш:

 #F8#
 Если на панели выбраны какие-либо файлы или каталоги, то удаляется выбранная группа, иначе
удаляется текущий объект под курсором.

 #Shift+F8#
 Удаление файла или папки только под курсором (независимо от выбранных объектов на панели);

 #Shift+Del#
 Удаление выбранных объектов минуя Корзину.

 #Alt+Del#
 Уничтожение файлов и папок.

 Примечания:

 1. ^<wrap>В зависимости от настроек в меню ~Системные параметры~@SystemSettings@
комбинации клавиш #F8# и #Shift+F8# перемещают или нет удаляемые файлы в
Корзину (Recycle Bin). Комбинация клавиш #Shift+Del# всегда удаляет файлы, минуя Корзину.

 2. ^<wrap>В процессе уничтожения, файл перезаписывается нулями (можно задать
другой символ-заполнитель, см. ~System.WipeSymbol~@System.WipeSymbol@), усекается до нулевой длины,
переименовывается во временное имя и удаляется.


@ErrCannotExecute
$ #Ошибка: Ошибка выполнения#
 Запускаемая команда не является внутренней или внешней
командой, исполняемой программой или пакетным файлом.


@Grabber
$ #Копирование текста с экрана#
 Копирование текста с экрана                                #Alt+Ins#

 Эта команда позволяет выбрать и поместить в Буфер Обмена любую область экрана.

 Для переключения между потоковым и блочным режимом выделения используйте #Space#.
 Для перемещения курсора используйте #клавиши управления курсором# или
нажмите #левую кнопку мыши#.
 Для выбора текста используйте #клавиши управления курсором# при нажатой #Shift#
или нажатую #левую кнопку мыши#.
 #Alt+Shift+клавиши управления курсором# уменьшают/увеличивают выделеннyю область.
 #Alt+клавиши управления курсором# перемещают выделеннyю область.
 #Enter#, #Ctrl+Ins#, #правая кнопка мыши# или двойное нажатие #левой кнопки мыши#
копируют выбранный текст в Буфер Обмена, #Ctrl+<Gray +># добавляет его к текущему содержанию Буфера Обмена.
 #Esc# отменяет пометку и завершает операцию.
 Комбинация #Ctrl+A# выделяет всю экранную область.
 Комбинация #Ctrl+U# снимает выделение.
 #Ctrl+Shift+Left# и #Ctrl+Shift+Right# - перемещение с выделением на 10 позиций по горизонтали,
 #Ctrl+Shift+Up# и #Ctrl+Shift+Down# - перемещение с выделением на 5 позиций по вертикали.


@MiscCmd
$ #Общие команды#
 #Клавиатурные Макрокоманды#

 Записать ~клавиатурную макрокоманду~@KeyMacro@                        #Ctrl+<.>#

 #Меню и выпадающие списки#

 Включить/выключить режим фильтрации               #RAlt, Ctrl+Alt+F#
 Заблокировать/разблокировать фильтр                     #Ctrl+Alt+L#

 Режим фильтрации динамически изменяет список меню по мере ввода символов.
Сочетание #Ctrl+Alt+L# позволяет не сбрасывая фильтра использовать горячие клавиши.

 #Диалоги#

 История в строках редактирования диалогов       #Ctrl+Up, Ctrl+Down#

 В истории строк редактирования диалогов вы можете использовать #Enter# для
копирования текущего элемента в строку редактирования или #Ins# для отметки
элемента. Отмеченные элементы не вытесняются из истории новыми элементами, так
что вы можете отметить часто используемые строки, чтобы всё время держать их в истории.

 Очистка истории в строках редактирования диалогов              #Del#

 Удаление текущего неотмеченного пункта истории
 в строках редактирования диалогов                        #Shift+Del#

 Установить фокус в диалогах на первый элемент                 #Home#

 Установить фокус в диалогах на элемент по умолчанию      #PgDn, End#

 Клавиши #Home# и #End# перемещают фокус, если он не находится на элементе,
который сам обрабатывает эти клавиши, как, например, строка редактирования.

 Следующие комбинации клавиш могут быть использованы во всех строках
редактирования кроме командной строки, включая диалоги и
~встроенный редактор~@Editor@.

 Вставить в диалог имя файла под курсором               #Shift+Enter#

 Вставить в диалог имя файла пассивной панели      #Ctrl+Shift+Enter#

 #Ctrl+Enter# в диалогах вызывает действие по умолчанию (нажатие на кнопку
по умолчанию или подобное по смыслу действие).

 В диалогах, когда текущим элементом управления является контрольный
переключатель (кнопка с независимой фиксацией или Check Box):

 - включить (#[x]#)                                          #Gray +#
 - выключить (#[ ]#)                                         #Gray -#
 - изменить состояние на неопределённое (#[?]#)              #Gray *#
   (если переключатель имеет трёхпозиционное состояние)

 Переместить диалог можно мышью или комбинацией #Ctrl+F5#.

 #Мышь#

 Щелчок #левой клавишей мыши# за пределами диалога аналогичен нажатию клавиши #Esc#.

 Щелчок #правой клавишей мыши# за пределами диалога аналогичен нажатию клавиши #Enter#.

 Щелчок #средней клавишей мыши# с соответствующими модификаторами (#Ctrl#,
#Alt#, #Shift#) в ~панелях~@PanelCmd@ аналогичен нажатию клавиши #Enter#. Для
непустой ~командной строки~@CmdLineCmd@ будет исполнено её содержимое.

 Far Manager также умеет обрабатывать ~колесо мыши~@MsWheel@.


@SpecCmd
$ #Специальные команды#
 ~Информация о версиях~@FarAbout@
 ~Редактор конфигурации~@FarConfig@


@MsWheel
$ #Мышь: поддержка колеса#
 #Панели#
 Прокрутка списка при неизменной позиции курсора на экране.
Нажатие #средней кнопки# аналогично нажатию #Enter#.

 #Редактор#
 Прокрутка текста с постоянным позиционированием курсора
(аналогично #Ctrl+Up#/#Ctrl+Down#).

 #Встроенная программа просмотра#
 Прокрутка всего текста.

 #Система помощи#
 Прокрутка всего текста.

 #Меню#
 Прокрутка колеса аналогична действию клавиш #Up#/#Down#. Нажатие средней кнопки аналогично
нажатию #Enter#. Можно выбирать пункты, не двигая курсор.

 #Диалоги#
 В диалогах при прокрутке колеса для строки редактирования с историей и комбинированного
списка раскрывается список. Внутри списка прокрутка работает так же, как для меню.

 Вы можете задать количество строк для прокрутки в панелях, редакторе и во
встроенной программе просмотра (см. ~System.MsWheelDelta~@System.MsWheelDelta@).


@Plugins
$ #Поддержка плагинов#
 Плагины могут быть использованы для создания новых команд Far и поддержки
виртуальных файловых систем. Например, работа с архивами, FTP-клиент, временная
панель и просмотр сети реализованы с помощью эмулирующих файловые системы плагинов.

 Все плагины хранятся в отдельных папках, размещённых в папке 'Plugins', находящейся
в одной папке с Far.exe и в папке 'Plugins', находящейся в профиле пользователя
(по умолчанию #%APPDATA%\\Far Manager\\Profile#).
При обнаружении нового плагина Far сохраняет информацию о нём и впоследствии
загружает его только при необходимости, в результате чего неиспользуемые плагины не требуют
дополнительной памяти. Тем не менее, если вы уверены, что какие-либо плагины вам
не нужны, вы можете удалить их, чтобы сохранить место на диске.

 Плагины могут быть вызваны либо из ~Меню выбора диска~@DriveDlg@, либо из
меню ~Команды плагинов~@PluginCommands@, активизируемого с помощью #F11#, или
соответствующего пункта ~Меню команд~@CmdMenu@. #F4# в меню "Команды плагинов"
позволяет назначить горячие клавиши для пунктов этого меню, что
упрощает их последующий вызов с помощью ~клавиатурных макрокоманд~@KeyMacro@.
Это меню доступно из файловых панелей, диалогов и из встроенной программы
просмотра и редактора. При вызове из диалогов, программы просмотра или редактора
будут показаны не все плагины, а только те, которые специально созданы для работы
в этом режиме.

 Вы можете настроить параметры плагинов, используя команду
~Параметры плагинов~@PluginsConfig@ из ~Меню параметров~@OptMenu@ либо
комбинацию клавиш #Alt+Shift+F9#.

 Операции обработки файлов (копирование, перенос, удаление,
редактирование, ~Поиска файла~@FindFile@ и т. п.) могут работать с плагинами,
эмулирующими файловые системы, если эти плагины обеспечивают соответствующую
функциональность.

 Плагины имеют собственные файлы сообщений и помощи. Вы можете получить
список доступной помощи по плагинам, нажав:

 #Shift+F2# - в основной помощи Far

 #Shift+F1# - в списке плагинов (контекстно-зависимая помощь).

 Если плагин не имеет файла помощи, то помощь вызываться не будет.

 Если активная панель отображает файловую систему, эмулируемую плагином,
то команда "CD" в командной строке может быть использована для смены
текущей папки этой файловой системы. В отличие от "CD" команда "CHDIR" всегда
воспринимает указанный параметр как имя реальной папки, вне зависимости от типа
файловой панели.

 Use #Alt+Shift+F9# to ~configure plugins~@PluginsConfig@.


@PluginCommands
$ #Команды плагинов#
 Данное меню - один из способов использования функциональности, которую
предоставляют плагины (о других способах см. ~"Поддержка плагинов"~@Plugins@).
Содержимое этого меню и действия, выполняемые при выборе пункта меню,
определяются плагинами.

 Меню может быть вызвано следующими способами:

 - ^<wrap>нажатие #F11# в файловых панелях или выбор пункта #Команды плагинов#
~меню команд~@CmdMenu@, при этом показываются команды, предназначенные для вызова из файловых панелей;
 - ^<wrap>нажатие #F11# в окне просмотра, редактора или диалоге, при этом показываются
только команды, предназначенные для текущей области вызова.

 Каждому пункту меню по #F4# может быть назначена горячая клавиша, отображаемая
слева от него. Данная возможность широко используется при создании
~клавиатурных макрокоманд~@KeyMacro@ вызова функций плагинов. Символ #A#
в крайней левой колонке меню означает, что соответствующий плагин разработан
для Far 1.x и не поддерживает всех возможностей текущей версии Far (в частности, символов
Unicode в именах файлов и в редакторе).

 Горячие клавиши меню #Команды плагинов#:

 #Shift+F1#
 Помощь по использованию выделенного пункта меню.
Текст помощи предоставляется плагином, которому принадлежит выделенный пункт меню.

 #F4#
 Назначить горячую клавишу выделенному пункту меню.
Если ввести пробел, Far установит горячую клавишу автоматически.

 #F3#
 Показать техническую информацию по плагину.

 #Shift+F9#
 Параметры выбранного плагина.

 #Alt+Shift+F9#
 Открыть меню ~"Конфигурация плагинов"~@PluginsConfig@.

 См. также:

 ~Поддержка плагинов~@Plugins@.
 Клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@PluginsConfig
$ #Параметры плагинов#
 Вы можете настроить параметры ~плагинов~@Plugins@,
используя команду #"Параметры плагинов"# из ~"Меню параметров"~@OptMenu@
или нажав комбинацию клавиш #Alt+Shift+F9# в ~Меню выбора диска~@DriveDlg@
и меню команд плагинов.

 Вы можете получить информацию о конкретном плагине, нажав #Shift+F1#
(контекстно-зависимая помощь по настройке плагина). Если плагин не имеет файла
помощи, то помощь вызываться не будет.

 При вызове контекстной помощи Far попытается показать тему с именем
#Config#. Если такой темы в файле помощи плагина нет, будет показана основная
тема помощи по данному плагину.

 Каждому пункту меню по #F4# может быть назначена горячая клавиша, отображаемая
слева от него; данная возможность широко используется при создании
~клавиатурных макрокоманд~@KeyMacro@ вызова функций плагинов. Символ #A#
в крайней левой колонке меню означает, что соответствующий плагин разработан
для Far 1.x и не поддерживает всех возможностей текущей версии Far (в частности, символов
Unicode в именах файлов и в редакторе).

 Клавиша #F3# позволяет посмотреть техническую информацию по плагину.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@PluginsReviews
$ #Обзор возможностей плагинов#
 Оболочка Far Manager настолько тесно слилась со своими плагинами, что
говорить о ней и не говорить о плагинах просто бессмысленно. Плагины неимоверно
расширяют возможности Far Manager, дополняя их и модифицируя.

 Не вдаваясь в подробности и персоналии, можно отметить только некоторые из этих возможностей:

 * подсветка синтаксиса в исходных текстах программ
 * работа с FTP-серверами (с поддержкой доступа через различные типы прокси, автоматической докачкой и прочее)
 * поиск и замена символов одновременно во множестве файлов с применением регулярных выражений
 * средства переименования групп файлов с возможностью использования сложных составных масок из символов подстановки и шаблонов
 * NNTP/SMTP/POP3/IMAP4 клиенты и отправка сообщений на пейджер
 * Работа с нестандартными разрешениями текстового экрана
 * перекодировка текстов с учётом национальных кодовых страниц
 * манипуляции с содержимым корзины
 * управление приоритетами процессов на локальном или на сетевом ПК
 * автозавершение слов в редакторе и работа с шаблонами
 * редактирование системного реестра Windows
 * создание и изменение ярлыков Windows
 * всевозможные манипуляции с файлами и текстом, делающие комфортной работу с FIDO
 * кодирование и декодирование файлов в формате UUE
 * управление программой Winamp и модификация комментариев MP3-файлов
 * обработка Quake PAK файлов
 * управление принтерами, как подключёнными к ПК, так и сетевыми
 * Работа с различными серверами через ODBC + работа с серверами ORACLE через OCI.
 * управление службой RAS
 * запуск внешних программ (компиляторов, конверторов и проч.) при редактировании текстов в редакторе Far
 * отображение содержимого файлов справки Windows (.hlp и .chm)
 * калькуляторы с разными возможностями
 * различные игры :-)
 * функции проверки орфографии при обработке текста в редакторе Far
 * подготовка каталога сменных накопителей и многое другое…

 В качестве источников информации, которые можно использовать для поиска
конкретных плагинов, можно порекомендовать:

 - Официальный сайт Far Manager
   ~https://www.farmanager.com/~@https://www.farmanager.com@
 - форум
   ~https://forum.farmanager.com~@https://forum.farmanager.com@
 - Регистрация и обработка проблем
   ~https://bugs.farmanager.com~@https://bugs.farmanager.com@
 - сайт PlugRinG
   ~https://plugring.farmanager.com~@https://plugring.farmanager.com@
 - листы рассылки
   ~https://groups.google.com/group/fardev/~@https://groups.google.com/group/fardev@
 - конференции USENET
   ~news:fido7.far.support~@news:fido7.far.support@
   ~news:fido7.far.development~@news:fido7.far.development@
 - конференции FidoNet
   far.support
   far.development


@Panels
$ #Панели#
 Обычно Far показывает две панели (левое и правое окна) с различной
информацией. Если вы хотите изменить тип отображаемой в панели информации,
используйте ~меню панелей~@LeftRightMenu@ или соответствующие
~клавиатурные команды~@KeyRef@.

 Для получения дополнительной информации о панелях прочитайте перечисленные ниже темы:

 ~Панель файлов~@FilePanel@
 ~Дерево папок~@TreePanel@
 ~Панель информации~@InfoPanel@
 ~Панель быстрого просмотра~@QViewPanel@

 ~Перетаскивание файлов~@DragAndDrop@
 ~Пометка файлов~@SelectFiles@
 ~Настройка режимов просмотра панели файлов~@PanelViewModes@


@FilePanel
$ #Панель файлов#
 Панель файлов отображает содержимое текущей папки. Вы можете выбирать файлы
и папки, выполнять различные файловые и архивные операции. Команды управления
панелями описаны в теме ~Список команд~@KeyRef@.

 По умолчанию в панели файлов используются следующие режимы просмотра:

 #Краткий#        Имена файлов выводятся в три колонки.

 #Средний#        Имена файлов выводятся в две колонки.

 #Полный#         Выводятся имя, размер, дата и время файла.

 #Широкий#        Выводятся имя и размер файла.

 #Детальный#      ^<wrap>Выводятся имена, размеры, выделенные размеры,
время последней записи, создания, доступа и атрибуты файла. Полноэкранный режим.

 #Описания#       Имена и ~описания файлов~@FileDiz@

 #Длинные#        ^<wrap>Имена, размеры и описания файлов. Полноэкранный режим.
 #описания#

 #Владельцы#      Имена, размеры и владельцы файлов.
 #файлов#

 #Ссылки файлов#   Имена, размеры и количество жёстких ссылок файлов.

 #Альтернативный# ^<wrap>Имя, размер (форматированный с помощью запятых) и дата файла.
 #полный#

 Вы можете сами настроить ~режимы просмотра панели файлов~@PanelViewModes@.

 Владельцы и количество жёстких ссылок файлов применимы только к разделам NTFS.
Некоторые файловые системы могут не поддерживать время создания и время доступа к файлу.

 Если вы хотите изменить режим просмотра панели, выберите желаемый из
~меню панелей~@LeftRightMenu@. После смены режима просмотра или текущего
диска тип любой панели автоматически меняется на панель файлов.

 Для позиционирования на файл можно воспользоваться операцией
~быстрого поиска~@FastFind@ по первым буквам имени.

 См. также список ~макроклавиш~@KeyMacroShellList@, доступных в панелях.


@TreePanel
$ #Дерево папок#
 Панель дерева папок отображает структуру папок текущего диска в виде
дерева. Это позволяет быстро сменить текущую папку, а также выполнять операции
над папками.

 Far запоминает информацию о структуре папок в файле #tree3.far#,
расположенном в корневой папке каждого диска. Если запись на диск невозможна,
то эта информация сохранятся в скрытой папке Tree.Cache, находящейся в той же
папке, что и Far.exe.
 По умолчанию файл tree3.tar отсутствует, для его создания нужно хотя бы один
раз воспользоваться командой #Поиск папки# или режимом панели #Дерево папок#.
Если такой файл есть, то при изменении каталогов (удаление, создание,
переименование, копирование) Far отслеживает и обновляет его
внутреннюю структуру. Если изменения были сделаны не в Far Manager обновить
содержимое файла tree3.far можно сочетанием клавиша #Ctrl+R#.

 Для позиционирования на папку можно использовать операцию #быстрого#
#поиска#. Для этого, удерживая клавишу #Alt#, набирайте имя требуемой папки,
пока на неё не переместится курсор. С помощью #Ctrl+Enter#/#Ctrl+Shift+Enter#
можно переместиться на следующее/предыдущее имя, соответствующее введённой строке.

 #Gray +# и #Gray -# используются для быстрого перемещения вверх или вниз
по папкам одного уровня.

 См. также список ~макроклавиш~@KeyMacroTreeList@, доступных в панели дерева папок.


@InfoPanel
$ #Панель информации#
 Панель информации содержит следующие секции:

 1. ^<wrap>#сетевые# имена компьютера и пользователя (представления изменяются в ~настройках~@InfoPanelSettings@).

 2. Информация о текущем диске
    ^<wrap>Имя и тип диска, тип его файловой системы, сетевое имя, общий и свободный размеры, метку тома и серийный номер.

    ^<wrap>Для приводов компакт-дисков Far умеет определять тип привода. Различаются
следующие типы: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW и DVD-RAM. Функция
определения типа привода требует или административных прав, или разрешения доступа
к локальным приводам компакт-дисков с помощью политик безопасности (для этого надо запустить из командной
строки утилиту #secpol.msc# и установить настройку '#Локальные политики/Параметры#
#безопасности/Устройства: Разрешить доступ к дисководам компакт-дисков только#
#локальным пользователям#' в значение '#Разрешить#').

    ^<wrap>Для виртуальных устройств (SUBST-дисков) указываются параметры основного диска.

    ^<wrap>#Ctrl+Shift+S# меняет режим отображения размеров: плавающий с суффиксами или байты.
Это влияет также на отображение информации о состоянии памяти, показ размеров в ~панели быстрого просмотра~@QViewPanel@
и в статусной строке ~файловой панели~@FilePanel@.
Текущий режим - far:config #Panel.ShowBytes# (default=false).

 3. ^<wrap>Информация о состоянии памяти
    ^<wrap>Уровень загрузки памяти (100% означает, что использована вся память),
размер установленной памяти (в Vista и выше), общий и свободный размеры физической памяти
(доступной для Windows), виртуальной памяти и файла подкачки.

 4. ^<wrap>Cодержимое файла #описания папки#.
    ^<wrap>Вы можете просмотреть содержимое этого файла в полноэкранном режиме, нажав
#F3# или #левую кнопку мыши#. Для редактирования или создания этого файла нажмите
#F4# или #правую кнопку мыши#. Вы также можете использовать многие команды
~встроенной программы просмотра~@Viewer@ (поиск, выбор кодовой страницы и т.д.) для
просмотра файла описания.
    ^<wrap>Список возможных имён файлов описания папок может быть задан с помощью
команды "Файлы описания папок" в ~Меню параметров~@OptMenu@.

 5. Плагиновая панель
    ^<wrap>Содержит информацию о противоположной плагиновой панели, если плагин предоставил такую информацию.

 6. Состояние системы питания.
    - ^<wrap>подключения к сети (отсутствует, подключено, не определено);
    - ^<wrap>значение заряда батареи (в процентах);
    - ^<wrap>статус заряда ("Высокий" - более 66%, "Низкий" - менее 33%, "Критичный" - критически низкий уровень, "Зарядка", "Батареи нет", "Не определено");
    - ^<wrap>время до разряда;
    - ^<wrap>полное время работы от батареи (система оценивает это время исходя из времени до разряда и значения заряда батареи;
без наличия умных подсистем батареи это значение не актуально и обычно указано как "Не определено").
    ^<wrap>Состояние подключения к сети обновляется автоматически.
    ^<wrap>В Windows Vista и выше работает автообновление "значения заряда батареи".
    ^<wrap>Секция, содержащая информацию о системе питания включается в ~настройках~@InfoPanelSettings@.

 Секции (кроме имени компьютера и пользователя) можно скрывать или показывать (см. ~Режимы отображения информационной панели~@InfoPanelShowMode@).

 См. также список ~макроклавиш~@KeyMacroInfoList@, доступных в панели информации.


@InfoPanelShowMode
$ #Режимы отображения информационной панели#
 Меню режимов отображения ~информационной панели~@InfoPanel@ вызывается комбинацией #Ctrl+F12#
и применяется для активной в данный момент информационной панели. Доступны следующие режимы отображения:

 - информация о диске
 - информация о памяти
 - содержимое файла-описателя
 - информации плагиновой панели
 - информации о состоянии системы питания

 Клавиша #+# включает показ информации.
 Клавиша #-# скрывает секцию.
 Клавиша #*# меняет режим отображения секции на обратную.

 Информация о состоянии системы питания включается в ~настройках~@InfoPanelSettings@ информационной панели.


@InfoPanelSettings
$ #Настройка информационной панели#
 #Показывать состояние питания#
 Если опция включена, то в ~информационной панели~@InfoPanel@ будет выводиться
секция, описывающая состояние системы питания.

 #Показывать параметры компакт-дисков#
 Если опция включена, то Far будет пытаться определить тип CD-привода.
Различаются следующие приводы: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW и DVD-RAM.

 #Формат вывода имени компьютера#
 Задаёт формат вывода имени компьютера. Может быть одним из:

 - #NetBIOS#
   ^<wrap>NetBIOS имя локального компьютера.

 - #DNS hostname#
   ^<wrap>DNS имя локального компьютера.

 - #DNS domain#
   ^<wrap>DNS имя домена, которому принадлежит компьютер.

 - #DNS fully-qualified#
   ^<wrap>Полное доменное имя, которое однозначно идентифицирует этот компьютер. Имя представляет собой комбинацию DNS имени хоста и DNS имени домена (формат HostName.DomainName).

 - #Physical NetBIOS#
   ^<wrap>NetBIOS имя локального компьютера. Если компьютер является узлом кластера, то выводится NetBIOS имя кластера виртуального сервера.

 - #Physical DNS hostname#
   ^<wrap>DNS имя локального компьютера. Если компьютер является узлом кластера, то выводится DNS имя кластера виртуального сервера.

 - #Physical DNS domain#
   ^<wrap>DNS имя домена, которому принадлежит компьютер. Если компьютер является узлом кластера, то выводится DNS имя домена кластера виртуального сервера.

 - #Physical DNS fully-qualified#
   ^<wrap>Полное доменное имя, которое однозначно идентифицирует этот компьютер. Имя представляет собой комбинацию DNS имени хоста и DNS имени домена (формат HostName.DomainName). Если компьютер является узлом кластера, то выводится полное DNS имя кластера виртуального сервера.

 Формат вывода зависит от наличия доменной структуры, групповых политик и настроек DNS.

 #Формат вывода имени пользователя#
 Задаёт формат вывода имени пользователя. Может быть одним из:

 - #Имя для входа#
   Логин пользователя, например, JohnDoe

 - #Полностью определённое имя домена#
   ^<wrap>The fully qualified distinguished name (for example, CN=Jeff Smith,OU=Users,DC=Engineering,DC=Microsoft,DC=Com).

 - #Sam Compatible#
   ^<wrap>A legacy account name (for example, Engineering\JSmith). The domain-only version includes trailing backslashes (\\).

 - #Display Name#
   ^<wrap>A "friendly" display name (for example, Jeff Smith). The display name is not necessarily the defining relative distinguished name (RDN).

 - #Уникальный идентификатор#
   ^<wrap>An UUID string (for example, {4fa050f0-f561-11cf-bdd9-00aa003a77b6}).

 - #Канонический вид#
   ^<wrap>The complete canonical name (for example, engineering.microsoft.com/software/someone). The domain-only version includes a trailing forward slash (/).

 - #Основное имя пользователя#
   ^<wrap>The user principal name (for example, someone@@example.com).

 - #Service Principal#
   ^<wrap>The generalized service principal name (for example, www/www.microsoft.com@@microsoft.com).

 - #DNS Domain#
   ^<wrap>The DNS domain name followed by a backward-slash and the SAM user name.

   #Имя#

   #Фамилия#

 Формат вывода зависит от наличия доменной структуры.


@QViewPanel
$ #Панель быстрого просмотра#
 Панель быстрого просмотра используется для получения информации о выбранном
элементе ~панели файлов~@FilePanel@ или ~дерева папок~@TreePanel@.

 Если выбранный элемент - файл, то отображается его содержимое. Для файла,
отображаемого в панели доступны многие команды встроенной программы
~просмотра~@Viewer@. Для известных Windows типов файлов также выводится
название типа.

 Для папок в панели быстрого просмотра сообщается общий размер, общий
выделенный размер, количество файлов и вложенных папок, размер кластера
текущего диска, реальный размер файлов, включая неиспользуемые фрагменты кластеров.

 Для ~символических ссылок~@HardSymLink@ отображается путь к исходным объектам.

 Для папок общие размеры могут не соответствовать реальным значениям:
 - ^<wrap>Если среди вложенных папок имеются символические ссылки и включена опция
"Сканировать символические ссылки" (диалог настройки ~системных параметров~@SystemSettings@).
 - ^<wrap>Если внутри папки есть несколько жёстких ссылок на один и тот же файл.

 #Ctrl+Shift+S# меняет режим отображения размеров: плавающий с суффиксами или байты.
Это влияет также на отображение размеров в ~информационной панели~@InfoPanel@ и статусной строке ~файловой панели~@FilePanel@.
Текущий режим - far:config #Panel.ShowBytes# (default=false).

 См. также список ~макроклавиш~@KeyMacroQViewList@, доступных в панели быстрого просмотра.


@DragAndDrop
$ #Копирование: перетаскивание файлов#
 Операции #копирования# и #переноса# файлов могут быть выполнены с помощью
#перетаскивания#. Нажмите #левую кнопку мыши# на исходном файле или папке,
перетащите его на другую панель и отпустите кнопку мыши.

 Если вы хотите обработать группу файлов или папок, пометьте их перед
перетаскиванием, нажмите #левую кнопку мыши# на исходной панели и перетащите
файлы на другую панель.

 Вы можете переключаться между копированием и переносом, нажимая #правую#
#кнопку мыши# во время перетаскивания. Для переноса файлов вы также можете
удерживать клавишу #Shift# в момент нажатия #левой кнопки мыши#.


@Menus
$ #Меню#
 Для активизации меню вы можете использовать #F9# или нажать #левую кнопку#
#мыши# на верхней строке экрана.

 При активизации по клавише #F9# автоматически выбирается меню,
соответствующее активной панели. При активном меню клавиша #Tab# позволяет
переключаться между меню левой и правой панелей. Если выбрано меню "Файлы",
"Команды" или "Параметры", клавиша #Tab# переключает на меню пассивной панели.

 Комбинация #Shift+F10# позволяет выбрать последний использованный пункт меню.

 Описания конкретных меню можно прочесть в следующих темах:

 ~Меню левой и правой панелей~@LeftRightMenu@
 ~Меню файлов~@FilesMenu@
 ~Меню команд~@CmdMenu@
 ~Меню параметров~@OptMenu@

 См. также список ~макроклавиш~@KeyMacroMainMenuList@, доступных в главном меню.


@LeftRightMenu
$ #Меню левой и правой панелей#
 Меню #Левая# и #Правая# позволяют изменить параметры левой и правой панели
соответственно. Эти меню включают следующие пункты:

 #Краткий#              Показывать файлы в три колонки.

 #Средний#              Показывать файлы в две колонки.

 #Полный#               Показывать имя, размер, дату и время файла.

 #Широкий#              Показывать имя и размер файла.

 #Детальный#            ^<wrap>Показывать имя, размер, выделенный размер,
время записи, создания и доступа и атрибуты файла. Полноэкранный режим.

 #Описания#             Имя и ~описание~@FileDiz@ файла.

 #Длинные описания#     ^<wrap>Имя, размер и описание файла. Полноэкранный режим.

 #Владельцы файлов#     Имя, размер и владелец файла.

 #Ссылки файлов#        ^<wrap> Имя, размер и количество жёстких ссылок файлов.

 #Альтернативный#       ^<wrap>Имя, форматированный размер дата файла.
 #полный#

 #Панель информации#    Сменить панель на ~панель информации~@InfoPanel@.

 #Дерево папок#         Сменить панель на ~дерево папок~@TreePanel@.

 #Быстрый просмотр#     Сменить панель на ~панель быстрого просмотра~@QViewPanel@.

 #Режимы сортировки#    Показать доступные режимы сортировки.

 #Показывать длинные#   Показывать длинные/короткие имена.
 #имена#

 #Панель Вкл/Выкл#      Показать/спрятать панель.

 #Перечитать#           Перечитать содержимое панели.

 #Сменить диск#         Сменить текущий диск.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@FilesMenu
$ #Меню файлов#
 #Просмотр#             ~Просмотр файлов~@Viewer@, подсчёт размеров папок.

 #Редактирование#       ~Редактирование~@Editor@ файлов.

 #Копирование#          ~Копирование~@CopyFiles@ файлов и папок.

 #Перенос#              ~Переименование или перенос~@CopyFiles@ файлов и папок.

 #Ссылка#               ~Создание ссылок~@HardSymLink@ на файлы и папки.

 #Создание папки#       ~Создание~@MakeFolder@ новой папки.

 #Удаление#             Удаление файлов и папок.

 #Уничтожение#          ^<wrap>Уничтожает файлы и папки. Перед удалением
файл перезаписывается нулями, усекается до нулевой длины и переименовывается во
временное имя.

 #Архивировать#         Добавить выбранные файлы к архиву.

 #Распаковать#          Распаковать выбранные файлы из архива.

 #Архивные команды#     Perform archive managing commands.

 #Атрибуты файлов#      ~Изменить атрибуты~@FileAttrDlg@ и время файла.

 #Применить команду#    ~Применить команду~@ApplyCmd@ к выбранным файлам.

 #Описание файлов#      Добавить ~описания~@FileDiz@ к выбранным файлам.

 #Пометить группу#      ~Пометить~@SelectFiles@ заданную маской группу файлов.

 #Снять пометку#        Снять ~пометку~@SelectFiles@ с соответствующей заданной маске группы файлов.

 #Инверсия пометки#     Инвертировать текущую ~пометку~@SelectFiles@ файлов.

 #Восстановить пометку# ^<wrap>Восстановить предыдущую ~пометку~@SelectFiles@ после
обработки файлов или операции пометки группы.

 Некоторые команды из этого меню также описаны в теме
~Управление файлами и сервисные команды~@FuncCmd@.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@CmdMenu
$ #Меню команд#
 #Поиск файла#          Поиск файлов, удовлетворяющих заданной маске.
                      Эта команда описана подробнее
                      в теме ~Поиск файла~@FindFile@.

 #История команд#       Показать предыдущие команды. Эта команда
                      описана подробнее в теме ~История команд~@History@.

 #Видеорежим#           Выбрать количество строк на экране.

 #Поиск папки#          Поиск папки в дереве папок.
                      Дополнительная информация об этой команде
                      содержится в теме ~Поиск папки~@FindFolder@.

 #История просмотра#    Показать ~историю просмотра и редактирования~@HistoryViews@
                      файлов.

 #История папок#        Показать ~историю смены папок~@HistoryFolders@.

                      Элементы истории просмотра и истории смены
                      папок после выбора передвигаются в конец
                      списка. Вы можете использовать #Shift+Enter#,
                      чтобы выбрать элемент без смены его позиции.

 #Поменять панели#      Поменять левую и правую панели местами.

 #Панели Вкл/Выкл#      Показать/спрятать обе панели.

 #Сравнение папок#      Сравнить содержимое папок.
                      Дополнительная информация об этой команде
                      содержится в теме ~Сравнение папок~@CompFolders@.

 #Меню пользователя#    Позволяет редактировать главное или местное
                      ~меню пользователя~@UserMenu@. Для вставки пункта
                      используется #Ins#, для удаления - #Del#,
                      для редактирования - #F4#.

 #Ассоциации файлов#    Показывает список ~ассоциаций файлов~@FileAssoc@.
                      Для вставки новой ассоциации может
                      использоваться #Ins#, для удаления - #Del#,
                      для редактирования - #F4#.

 #Ссылки на папки#      Показывает текущие ~ссылки на папки~@FolderShortcuts@.

 #Группы сортировки#    Позволяет редактировать задаваемые
                      пользователем ~группы сортировки~@SortGroups@.

 #Фильтр панели#        Позволяет управлять содержимым панели файлов.
 #файлов#               Дополнительная информация об этой команде
                      содержится в теме ~меню фильтров~@FiltersMenu@.

 #Команды#              Показывает список доступных
 #плагинов#            ~плагинов~@Plugins@.

 #Список экранов#       Показывает ~список открытых экранов~@ScrSwitch@.

 #Список задач#         Показывает ~список активных задач~@TaskList@.

 #Список устройств#     Показывает ~список подключённых устройств~@HotPlugList@.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@OptMenu
$ #Меню параметров#
 #Системные параметры#  Вызывает диалог ~системных параметров~@SystemSettings@.

 #Настройки панели#     Вызывает диалог ~настроек панели~@PanelSettings@.

 #Настройки дерева#     Вызывает диалог ~настроек дерева папок~@TreeSettings@.
 #папок#                Доступно только если параметр ~Panel.Tree.TurnOffCompletely~@Panel.Tree.TurnOffCompletely@
                      в ~far:config~@FarConfig@ установлен в значение «false».

 #Настройки интерфейса# Вызывает диалог ~настроек интерфейса~@InterfSettings@.

 #Языки#                Выбор основного языка и языка помощи.
                      Используйте команду "Сохранить параметры",
                      чтобы сохранить выбранные языки.
                      Вы можете ~настроить элементы пользовательского интерфейса~@CustomizingUI@
                      по необходимости и вкусу.

 #Параметры плагинов#   Вызывает диалог ~настроек плагинов~@PluginsConfig@.

 #Параметры менеджера#  Вызывает диалог ~менеджера плагинов~@PluginsManagerSettings@.
 #плагинов#

 #Настройки диалогов#   Вызывает диалог ~настроек диалогов~@DialogSettings@.

 #Настройки меню#       Вызывает диалог ~настроек меню~@VMenuSettings@.

 #Настройки командной#  Вызывает диалог ~настроек командной строки~@CmdlineSettings@.
 #строки#

 #Настройки#            Вызывает диалог ~настроек автозавершения~@AutoCompleteSettings@.
 #автозавершения#

 #Настройки#            Вызывает диалог
 #информационной#       ~настроек информационной панели~@InfoPanelSettings@.
 #панели#

 #Группы масок файлов#  Управление ~группами масок файлов~@MaskGroupsSettings@.

 #Подтверждения#        Вызывает диалог включения или выключения
                      ~подтверждений~@ConfirmDlg@ для некоторых операций.

 #Режимы панели#        ~Настройка режимов просмотра~@PanelViewModes@ панели файлов.
 #файлов#

 #Описания файлов#      Режимы обновления и имена ~описаний файлов~@FileDiz@.

 #Файлы описания#       Управление ~описаниями папок~@FolderDiz@.
 #папок#

 #Настройки программы#  ~Настройки программы просмотра~@ViewerSettings@ (внешней и встроенной).
 #просмотра#

 #Настройки редактора#  ~Настройки редактора~@EditorSettings@ (внешнего и встроенного).

 #Кодовые страницы#     Управление ~кодовыми страницами~@CodePagesMenu@.

 #Цвета#                Shows the ~Color groups~@ColorGroups@ menu.

 #Раскраска файлов#     Редактирование
 #и группы сортировки#  ~раскраски файлов и групп сортировки~@Highlight@.

 #Сохранить параметры#  Сохранение текущей конфигурации, цветов
                      и внешнего вида экрана.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@ConfirmDlg
$ #Подтверждения#
 В диалоге #Подтверждения# вы можете разрешить или запретить
подтверждения для следующих операций:

 - ^<wrap>перезаписывание файлов во время копирования;
 - перезаписывание файлов во время переноса;
 - перезаписывание и удаление файлов с атрибутом "только для чтения";
 - ~перетаскивание~@DragAndDrop@ файлов;
 - удаление файлов/папок;
 - удаление непустых папок;
 - прерывание операций (нажали клавишу #Esc#);
 - ~отсоединение сетевого диска~@DisconnectDrive@ из меню дисков;
 - удаление SUBST-диска из меню дисков;
 - отсоединение виртуального диска;
 - отключение запоминающих устройств для USB из меню дисков;
 - ~повторное открытие~@EditorReload@ файла в редакторе;
 - очистка списка историй редактирования/просмотра, переходов и выполненных команд;
 - выход из Far.


@PluginsManagerSettings
$ #Менеджер плагинов#
 #Поддержка OEM-плагинов#
 Позволяет использовать OEM-плагины (для Far Manager 1.x)

 #Сканировать символические ссылки#
 Позволяет искать плагины в ~символических ссылках~@HardSymLink@ наравне с обычными подкаталогами.

 #Обработка файла#

 #Пункт вызова стандартной ассоциации#

 #Даже если найден всего один плагин#

 #Результаты поиска (SetFindList)#

 #Обработка префикса#


@MaskGroupsSettings
$ #Группы масок файлов#
 Произвольное количество ~масок файлов~@FileMasks@ можно объединить в группу и присвоить ей имя.

 В дальнейшем имя группы, заключённое в угловые скобки (#<#имя#>#), может использоваться везде, где используются сами маски.

 Группы могут содержать другие группы.

 Например, группа #<arc># содержит маски "*.rar,*.zip,*.[zj],*.[bg7]z,*.[bg]zip,*.tar".
Для ~раскраски~@Highlight@ всех архивов, кроме "*.rar", необходимо указать последовательность #<arc>|*.rar#.

 Клавиши управление списком.

 #Ctrl+R#      - ^<wrap>восстановить исходное значение для предопределённых групп ("arc", "temp" и "exec").

 #Ins#         - добавить новую группу

 #Del#         - удалить существующую группу

 #Enter#/#F4#    - изменить параметры группы

 #F7#          - найти группы, содержащие маску

 См. также: ~Меню параметров~@OptMenu@ и клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@ChoosePluginMenu
$ #Меню выбора плагина#
 Позволяет выбрать плагин-обработчик, если хост-файл (например, архив)
могут обработать несколько плагинов.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@MakeFolder
$ #Создание папки#
 Эта функция служит для создания папок. Вы можете использовать переменные
окружения в строке ввода, которые перед созданием папки преобразуются в
содержащееся в ней значение. Также существует возможность создавать несколько
вложенных папок за один раз: для этого отделите имена папок друг от друга
символом "\\". Например:

 #%USERDOMAIN%\\%USERNAME%\\Папка3#

 Опция "#Тип ссылки#" позволяет создавать одну из ~ссылок~@HardSymLink@ на папки
("#связь каталогов#" или "#символическая ссылка#"). В этом случае необходимо в поле "#Цель#"
указать папку, на которую будет ссылаться вновь созданная папка.

 Если включена опция "#Обрабатывать несколько имён папок#", то можно
создавать несколько папок за один раз. В этом случае имена папок должны быть
разделены символом-разделителем "#;#" или "#,#". Если эта опция включена и имя
папки содержит в себе символ "#;#" (или "#,#"), то оно должно быть взято в
кавычки. Например, если будет введено #C:\\Foo1;"E:\\foo,2;";D:\\foo3#, то
будут созданы папки с именами: "#C:\\Foo1#", "#E:\\foo,2;#" и "#D:\\foo3#".


@FindFile
$ #Поиск файла#
 Эта команда предназначена для поиска одного или нескольких файлов и папок в
дереве папок, в соответствии с одной или несколькими разделёнными запятыми или
точкой с запятой ~масками~@FileMasks@. Также она может быть использована с
файловыми системами, эмулируемыми ~плагинами~@Plugins@.

 Дополнительно может быть указан текст, который должен содержаться в
искомых файлах. В этом случае параметр #Учитывать регистр# может быть
использован для проведения регистрозависимого поиска.

 Параметр #Только целые слова# позволит искать только текст, который отделён
от остального текста пробелом, знаком табуляции, возврата каретки, перевода
строки или стандартными разделителями: #!%^&*()+|{}:"<>?`-=\\[];',./#.

 #Нестрогий поиск# не учитывает различий в диакритических знаках, считает
лигатуры эквивалентными соответствующим им многосимвольным
последовательностям и затейливые цифры обычным цифрам, а также
игнорирует некоторые другие незначительные различия.

 Установка параметра #16-ричный код# позволяет искать файлы, содержащие шестнадцатеричную
последовательность введённых байт. В этом случае параметры #Учитывать регистр#,
#Только целые слова#, #Нестрогий поиск#, #Используя кодовую страницу#
и #Искать папки# блокируются и их значения на процесс поиска не влияют.

 Параметр #не содержащих# позволяет искать файлы, #не# содержащие указанный текст или код.

 Выпадающий список #Используя кодовую страницу# позволяет выбрать конкретную
кодовую страницу, применяемую для поиска текста. Если в выпадающем списке выбрать
пункт #Все стандартные кодовые страницы#, то Far будет использовать для поиска все стандартные
(ANSI, OEM, UTF-8, UTF-16, UTF-16 BE) и #Избранные# кодовые страницы (список #избранных#
кодовых страниц можно настроить в меню ~кодовых страниц~@CodepagesMenu@ настроек, редактора или
программы просмотра). При необходимости поиска по собственному набору кодовых страниц, отметьте
их в списке при помощи клавиш #Ins# или #Space# и выберите пункт #Отмеченные кодовые страницы#.

 Для поиска файлов и в архивах нужно установить опцию #Искать в архивах#. В
то же время, это существенно замедляет выполнение операции. Поиск во вложенных архивах не производится.

 Параметр #Искать папки# позволяет включать в список поиска папки,
совпадающие с маской поиска. При этом счётчик найденных файлов учитывает также
и найденные папки.

 Параметр #Искать в символических ссылках# позволяет искать файлы в
~символических ссылках~@HardSymLink@ наравне с обычными подкаталогами.

 Параметр #Искать в альтернативных потоках# - помимо основного потока данных
(представляющего собой непосредственно содержимое файла)
производить поиск также в альтернативных именованных потоках, поддерживаемых некоторыми
файловыми системами (например, #NTFS#).

 Поиск может выполняться:
 - ^<wrap>на всех дисках, кроме сменных;
 - на всех локальных дисках, кроме сменных и сетевых;
 - во всех папках, перечисленных в переменной окружения %PATH% (без вложенных папок);
 - во всех папках, начиная с корневой, в диалоге поиска можно выбрать диск поиска (кнопка "Диск");
 - во всех папках, начиная с текущей папки;
 - только в текущей папке;
 - в отмеченных папках.

 Параметры поиска сохраняется в конфигурации.

 Для поиска файлов, попадающих под определённые условия, используйте переключатель
#Использовать фильтр#. Настройка условий ~фильтра~@FiltersMenu@ осуществляется кнопкой #Фильтр#.

 С помощью кнопки #Дополнительно# вызывается диалог настройки
~дополнительных параметров поиска~@FindFileAdvanced@, которые используются для
настройки расширенного набора свойств поиска.


@FindFileAdvanced
$ #Дополнительные параметры поиска#
 #Искать только в первых:# - Введённая в поле #Содержащих текст#
(или в поле #Содержащих 16-ричный код#) строка может разыскиваться
не только во всём файле, но также в начале файла заданной длины.
Если файл длиннее указанного значения, то остаток файла будет
игнорироваться, даже если искомая последовательность там есть.

 При задании размера можно использовать следующие суффиксы:
 - #B# или без суффикса для байтов;
 - #K# для килобайтов;
 - #M# для мегабайтов;
 - #G# для гигабайтов;
 - #T# для терабайтов;
 - #P# для петабайтов;
 - #E# для эксабайтов.

 #Типы колонок# - позволяет задавать формат вывода результатов поиска.
Типы колонок кодируются с помощью одной или нескольких букв, разделённых запятыми.
Допускаются следующие типы колонок:

 S[C,T,F,E] - ^<wrap>размер файла
 P[C,T,F,E] - выделенный размер файла
 G[C,T,F,E] - размер потоков файла, где:
              C - ^<wrap>форматировать размер файла;
              T - использовать 1000 вместо 1024 как делитель;
              F - показывать размер в виде десятичной дроби, используя наиболее подходящую единицу измерения, например 0,97 К, 1,44 М, 53,2 Г;
              E - компактный режим, не показывать пробел перед суффиксом размера файла (например, 0.97KB).

 D          - дата последней записи в файл
 T          - время последней записи в файл

 DM[B,M]    - дата и время последней записи в файл
 DC[B,M]    - дата и время создания файла
 DA[B,M]    - дата и время последнего доступа к файлу
 DE[B,M]    - дата и время изменения файла, где:
              B - ^<wrap>краткий (Unix-стиль) формат времени файла;
              M - использование текстовых имён месяцев.

 A          - атрибуты файла
 Z          - описание файла

 O[L]       - владелец файла, где:
              L - показывать имя домена.

 LN         - количество жёстких ссылок

 F          - количество потоков

 Атрибуты файла имеют следующие обозначения:

 #N# - Аттрибуты не установлены
 #R# - Только для чтения
 #H# - Скрытый
 #S# - Системный
 #D# - Каталог
 #A# - Архивный
 #T# - Временный
 #$# - Разрежённый
 #L# - Точка повторной обработки
 #C# - Сжатый
 #O# - Автономный
 #I# - Неиндексируемый
 #E# - Зашифрованный
 #V# - Поток целостности
 #?# - Виртуальный
 #X# - Нет данных очистки
 #P# - Закреплённый
 #U# - Откреплённый

 #Ширина колонок# - позволяет изменить ширину колонок результатов поиска.
Если ширина равна 0, то используется значение по умолчанию.

 Для использования 12-часового формата времени надо увеличить
на единицу стандартную ширину колонки времени файла или колонки
времени и даты файла. После дальнейшего увеличения в этих колонках
также будут показаны секунды и миллисекунды.

 Для показа года в 4-х символьном формате нужно увеличить ширину колонки даты на 2.

 В отличие от режимов панелей, результат поиска может содержать только
одну колонку. Имя файла присутствует всегда - добавляется последней колонкой автоматически.

 При указании колонок, отвечающих за показ ссылок и потоков (G, LN, и F) время
поиска увеличивается.

 Чтобы в результатах поиска отображать только имена файловых объектов без
дополнительных атрибутов, оставьте поле "Типы колонок" пустым.

 По умолчанию значения полей равны:
 "Типы колонок"   - D,S,A
 "Ширина колонок" - 14,13,0


@FindFileResult
$ #Поиск файла: клавиши управления#
 Во время или после завершения ~поиска~@FindFile@ вы можете использовать
клавиши управления курсором для передвижения по списку файлов и кнопки для
выполнения требуемых действий.

 Во время или после завершения поиска доступны следующие кнопки:

 #Новый поиск#     Начать новую операцию поиска.

 #Перейти#         Прервать поиск, сменить текущую папку и поместить
                 курсор на выбранный файл.

 #Смотреть#        Просмотр выбранного файла без прерывания поиска.

 #Панель#          Создать временную панель и заполнить её найденными
                 файлами.

 #Стоп#            Прервать поиск. Доступна во время поиска.

 #Отмена#          Прервать поиск и закрыть диалог.

 Во время поиска поддерживается просмотр и редактирование найденных файлов.

 Просмотр                                #Ctrl+Shift+F3, Numpad5, F3, Alt+F3#

 #Numpad5#, #F3# или #Alt+F3# используются для вызова ~встроенной~@Viewer@, внешней  или ~ассоциированной~@FileAssoc@
программы просмотра, в зависимости от типа файла и ~настроек программы просмотра~@ViewerSettings@.
#Ctrl+Shift+F3# всегда вызывает встроенную программу просмотра, вне зависимости от файловых ассоциаций.

 Редактирование                                    #Ctrl+Shift+F4, F4, Alt+F4#

 #F4# или #Alt+F4# вызывает ~встроенный~@Editor@, внешний или ~ассоциированный~@FileAssoc@
редактор, в зависимости от типа файла и ~настроек редактора~@EditorSettings@.
#Ctrl+Shift+F4# всегда вызывает встроенный редактор, вне зависимости от файловых ассоциаций.

 Редактирование и просмотр поддерживаются также для файловых систем плагинов. Заметьте, что сохранение
изменений в редакторе по клавише #F2# для файловых систем плагинов будет вызывать операцию
#Сохранить в# вместо обычного #Сохранить#.


@FindFolder
$ #Поиск папки#
 Эта команда предназначена для быстрого поиска нужной папки в дереве папок.

 Для выбора папки вы можете использовать клавиши управления курсором или
набрать несколько начальных символов имени папки.

 Нажмите #Enter# для перехода в выбранную папку.

 #Ctrl+R# и #F2# позволяют перечитать дерево папок.

 #Gray +# и #Gray -# используются для быстрого перемещения вверх или вниз
по папкам одного уровня.

 #F5# позволяет развернуть окно на весь экран, повторное нажатие #F5# вернёт
размер окна в первоначальное состояние.

 С помощью #Ctrl+Enter# можно циклически перемещаться по элементам дерева в
соответствии с введённой в строке файловой маской. #Ctrl+Shift+Enter# позволяет
перемещаться по элементам в обратном направлении.

 См. также список ~макроклавиш~@KeyMacroFindFolderList@, доступных в поиске папок.


@Filter
$ #Фильтр#
 Фильтр служит для обработки определённых групп файлов по заданным
пользователем параметрам, при соблюдении которых файл будет обработан
использующей его операцией. Фильтр может настраиваться по разным типам
параметров.

 Диалог фильтра состоит из следующих элементов:

 #Имя фильтра#
 Название, которое будет отображаться в списке фильтров. Вы можете оставить это поле пустым.

 #Маска#
 Одна или несколько ~масок файлов~@FileMasks@.
 Файл попадает в условия фильтра, если включён анализ масок файла и его имя соответствует хотя бы
одной маске. Если анализ масок отключён, то имя файла не имеет значения.

 #Размер#
 Минимальный и максимальный размер файла. Можно использовать следующие суффиксы:
 - #B# или без суффикса для байтов;
 - #K# для килобайтов;
 - #M# для мегабайтов;
 - #G# для гигабайтов;
 - #T# для терабайтов;
 - #P# для петабайтов;
 - #E# для эксабайтов.

 Файл попадает в условия фильтра, если включён анализ размера файла и он входит в введённый
диапазон. Если в качестве одной или обеих границ диапазона ничего не введено (пустая строка), тогда
размер по этому условию не ограничивается.

 Например:
 >= 1K - выбрать файлы больше или равные 1 килобайт
 <= 1M - до меньше или равные 1 мегабайт

 #Дата/время#
 Дата/время начала и окончания действия фильтра.
 Можно указать дату последней #записи#, дату #создания# файла, дату последнего #доступа# или дату #изменения#.
 Кнопка #Текущая# позволяет заполнить поля времени файла текущим временем, после чего вы можете
поменять отдельную составляющую даты и времени, например только месяц или только минуты.
#Сброс#, чтобы очистить поля с датами и временем.
 Файл попадает в условия фильтра, если включён анализ даты файла и она попадает в введённый
диапазон и соответствует установленному типу. Если одно или оба поля с датами пусто, тогда дата
по этому полю не ограничивается.

 Например:
 <= 31.01.2010 - выбрать файлы в период до 31 числа
 >= 01.01.2010 - но после 1 января 2010 года

 Опция #Относительная# позволяет переключиться на работу с датой в относительном времени.
Логика работы при данной опции аналогична арифметике с отрицательными числами.

 Например:
 <= 0  - выбрать файлы в период от "сегодня"
 >= 30 - и до 30-ти дней назад включительно

 #Атрибуты#
 Атрибуты включения и атрибуты исключения.

 Файл попадает в условия фильтра, если включён
анализ атрибутов файла и он имеет все атрибуты
включения и не имеет атрибутов исключения:

 #[x]# - ^<wrap>атрибут включения - файл должен иметь указанный атрибут.
 #[ ]# - ^<wrap>атрибут исключения - файл не должен иметь указанный атрибут.
 #[?]# - ^<wrap>указанный атрибут не влияет на фильтр.

 Атрибуты #Сжатый#, #Зашифрованный#, #Неиндексируемый#, #Разрежённый#, #Временный# и #Автономный# используются
только на дисках с файловой системой NTFS.
Атрибуты #Поток целостности# и #Нет данных очистки# поддерживаются только на ReFS томах, начиная с Windows Server 2012.

 #Более одной жёсткой ссылки#
 Используется только на дисках с файловой системой NTFS. Условие истинно,
когда на элемент данных, на который ссылается текущий файл, ссылается хотя бы ещё один файл.
 #Внимание#: использование этой опции может #значительно# замедлить работу.

 Для быстрого отключения одного или нескольких условий фильтра отключите
соответствующие опции. Клавиша #Очистить# сбросит все условия фильтра.


@History
$ #История команд#
 История команд показывает список выполненных ранее команд. Кроме клавиш
управления курсором доступны следующие клавиши:

 Повторно выполнить команду                                    #Enter#

 Повторно выполнить команду в отдельном окне             #Shift+Enter#

 Повторно выполнить команду от имени администратора   #Ctrl+Alt+Enter#

 Поместить команду в командную строку                     #Ctrl+Enter#

 Очистить историю команд                                         #Del#

 Установить/снять пометку блокировки пункта истории              #Ins#

 Очистка текущего пункта истории                           #Shift+Del#

 Копировать содержимое текущей позиции истории                #Ctrl+C#
 в Буфер Обмена, не закрывая списка                     или #Ctrl+Ins#

 Показать дополнительную информацию                               #F3#

 Для перехода к предыдущей или следующей команде непосредственно из
командной строки, можно использовать клавиши #Ctrl+E# или #Ctrl+X# соответственно.

 Для сохранения истории команд после выхода, используйте соответствующую
опцию из ~диалога системных параметров~@SystemSettings@.

 Отмеченные пункты не будут удаляться при очистке истории.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@HistoryViews
$ #История просмотра и редактирования#
 История просмотра и редактирования файлов показывает список просмотренных
или редактируемых ранее файлов. Кроме клавиш управления курсором доступны
следующие клавиши:

 Повторно открыть файл на просмотр                             #Enter#
 или редактирование

 Поместить имя файла в командную строку                   #Ctrl+Enter#

 Очистить список истории                                         #Del#

 Очистка текущего пункта истории                           #Shift+Del#

 Установить/снять пометку блокировки пункта истории              #Ins#

 Обновить список, удалив недоступные файлы                    #Ctrl+R#

 Копировать содержимое текущей позиции истории                #Ctrl+C#
 в Буфер Обмена, не закрывая списка                     или #Ctrl+Ins#

 Открыть файл в ~редакторе~@Editor@                                         #F4#

 Открыть файл в ~программе просмотра~@Viewer@                               #F3#
                                                       или  #Numpad5#

 Элементы истории просмотра и редактирования после выбора передвигаются в
конец списка. Вы можете использовать #Shift+Enter#, чтобы выбрать элемент без
смены его позиции.

 Для сохранения истории просмотра и редактирования файлов после
выхода, используйте соответствующие опции из диалога ~системных параметров~@SystemSettings@.

 Примечания:

 1. ^<wrap>Операция обновления списка (Ctrl+R) может занять значительное время,
если файл находился на недоступном в данный момент сетевом ресурсе.
 2. ^<wrap>Отмеченные пункты не будут удаляться при очистке или обновлении истории.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@HistoryFolders
$ #История смены папок#
 История смены папок показывает список ранее посещаемых папок. Кроме клавиш
управления курсором доступны следующие клавиши:

 Перейти в указанную папку                                     #Enter#

 Перейти в указанную папку на пассивной панели      #Ctrl+Shift+Enter#

 Поместить имя папки в командную строку                   #Ctrl+Enter#

 Очистить список истории                                         #Del#

 Очистка текущего пункта истории                           #Shift+Del#

 Установить/снять пометку блокировки пункта истории              #Ins#

 Обновить список, удалив недоступные папки                    #Ctrl+R#

 Копировать содержимое текущей позиции истории                #Ctrl+C#
 в Буфер Обмена, не закрывая списка                     или #Ctrl+Ins#

 Элементы истории смены папок после выбора передвигаются в конец списка. Вы
можете использовать #Shift+Enter#, чтобы выбрать элемент без смены его позиции.

 Для сохранения истории смены папок после выхода, используйте
соответствующую опцию из диалога ~системных параметров~@SystemSettings@.

 Примечания:

 1. ^<wrap>Операция обновления списка (Ctrl+R) может занять значительное время,
если каталог находился на недоступном в данный момент сетевом ресурсе.
 2. ^<wrap>Отмеченные пункты не будут удаляться при очистке или обновлении истории.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@TaskList
$ #Список задач#
 Список задач показывает активные на данный момент задачи. Каждая строка
списка содержит PID процесса и заголовок окна задачи или путь исполняемого модуля.

 Из списка задач можно переключится на окно задачи или удалить задачу,
используя клавишу #Del#. Будьте осторожны с удалением задач. Эта операция
выполняется немедленно и любая несохранённая информация данной задачи будет
потеряна. Поэтому удаление задач должно использоваться только при
необходимости, например, если программа перестала отвечать на запросы пользователя.

 Список задач может быть вызван либо из ~Меню команд~@CmdMenu@, либо
используя #Ctrl+W#. В последнем случае список задач также может быть вызван из
программы просмотра или редактора.

 #Ctrl+R# позволяет обновить список задач.

 #F2# переключает отображение с заголовка окна задачи на путь к
исполняемому модулю и обратно.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@HotPlugList
$ #Список Hotplug-устройств#
 Список Hotplug-устройств показывает платы PC Card и друге аналогичные
устройства, установленные и работающие на компьютере.

 Для удаления устройства необходимо выбрать устройство в списке и нажать
клавишу #Del#. После этого Windows подготавливает устройство к безопасному
извлечению. По окончанию операции пользователю выводится уведомление о
возможности извлечения устройства.

 #Ctrl+R# позволяет обновить список подключённых устройств.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@CompFolders
$ #Сравнение папок#
 Команду сравнения папок можно выполнять, только когда обе панели на экране
являются ~панелями файлов~@FilePanel@. Она сравнивает содержимое отображаемых в
этих панелях папок. Файлы, которые присутствуют только в одной панели, или
файлы с более поздней датой записи, чем у файлов с тем же именем в другой
панели, становятся помеченными.

 Вложенные папки не сравниваются. Для сравнения файлов используется их имя,
дата и время, но не содержимое.


@UserMenu
$ #Меню пользователя#
 Меню пользователя предназначено для упрощения выполнения часто используемых
операций. Оно содержит заданные пользователем команды и последовательности
команд, которые могут быть выполнены с использованием этого меню. Меню
может включать вложенные меню. Специальные ~метасимволы~@MetaSymbols@ поддерживаются и в командах,
 и в заголовках команд меню. Обратите внимание, что символ !?<title>?<init>! может быть использован
для ввода дополнительных параметров непосредственно перед выполнением команды.

 Для редактирования или создания главного или местного меню пользователя
применяется команда #Меню пользователя# из ~Меню команд~@CmdMenu@. Главное меню
пользователя может быть только одно. Главное меню вызывается в том случае, если
для текущей папки отсутствует местное меню. Местное меню может быть расположено
в любой папке. Вы можете в любой момент переключиться между местным меню и
главным меню с помощью клавиш #Shift+F2#. Вы также можете вызвать местное меню
из родительской папки с помощью клавиши #Backspace#.

 Для добавления разделителя в пользовательское меню нужно
добавить новый пункт меню (команду), в котором в качестве "Горячей клавиши"
указать "--". Удалить такой разделитель можно только через #Alt+F4#.

 Пункты меню пользователя можно перемещать #Ctrl+Up# или #Ctrl+Down#.

 Для выполнения команды из меню пользователя нужно выбрать её с помощью
клавиш управления курсором и нажать #Enter#. Также можно использовать
назначенную для данного пункта меню #горячую клавишу#.

 Вы можете удалить вложенное меню или пункт меню, используя клавишу #Del#,
вставить новое вложенное меню или пункт меню с помощью #Ins# и редактировать
существующее вложенное меню или пункт меню с помощью #F4#. Нажмите #Alt+F4# для
редактирования меню в виде текстового файла.

 В качестве горячих клавиш для обращения к пунктам меню могут использоваться
цифры, буквы и функциональные клавиши (#F1#…#F24#). Если использованы #F1# и #F4#,
их первоначальные функции теряются. В этом случае для редактирования меню может
применяться #Shift+F4#.

 При редактировании или создании пункта меню нужно ввести заголовок пункта,
который будет отображаться в меню, последовательность команд, выполняющихся при
выбора данного пункта меню, и, при необходимости, горячую клавишу для быстрого
доступа к этому пункту.

 При редактировании или создании вложенного меню достаточно ввести заголовок
вложенного меню и, при необходимости, горячую клавишу.

 Меню пользователя размещается в текстовых файлах #FarMenu.Ini# и может быть трёх типов:
 - ^<wrap>"Пользовательское меню" располагается в профиле пользователя.
 - ^<wrap>"Глобальное меню" располагается в папке Far Manager и имеет приоритет над "Пользовательским меню".
 - ^<wrap>"Локальное меню" располагается в текущем каталоге и имеет приоритет над прочими меню.

 Вы можете закрыть меню на любом уровне вложенности нажав #Shift+F10#.

 См. также:

 Список ~макроклавиш~@KeyMacroUserMenuList@, доступных в меню пользователя.
 Клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@FileAssoc
$ #Ассоциации файлов#
 Far Manager поддерживает ассоциации файлов, которые позволяют задавать
разнообразные действия для запуска, редактирования и просмотра файлов, заданных
~маской~@FileMasks@.

 Вы можете добавить новые ассоциации с помощью команды #Ассоциации файлов# в
~Меню команд~@CmdMenu@.

 Вы можете задать несколько ассоциаций для одного типа файлов и выбирать
желаемую ассоциацию из меню.

 В списке ассоциаций доступны следующие действия:

 #Ins#        - ~добавить~@FileAssocModify@ новую ассоциацию

 #F4#         - ~изменить~@FileAssocModify@ настройки текущей ассоциации

 #Del#        - удалить текущую ассоциацию

 #Ctrl+Up#    - передвинуть ассоциацию вверх

 #Ctrl+Down#  - передвинуть ассоциацию вниз

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@FileAssocModify
$ #Настройка ассоциации файлов#
 Far позволяет задать шесть команд, ассоциированных с определённым типом
файла, заданным ~маской~@FileMasks@:

 #Команда запуска по Enter#      Выполняется при нажатии #Enter#

 #Команда запуска по Ctrl+PgDn#  Выполняется при нажатии #Ctrl+PgDn#

 #Команда просмотра#             Выполняется при нажатии #F3#

 #Альтернативная команда#        Выполняется при нажатии #Alt+F3#
 #просмотра#

 #Команда редактирования#        Выполняется при нажатии #F4#

 #Альтернативная команда#        Выполняется при нажатии #Alt+F4#
 #редактирования#

 Ассоциацию можно описать в поле #Описание ассоциации#.

 В ассоциированных командах могут использоваться специальные
~метасимволы~@MetaSymbols@.

 Примечания:

 1. ^<wrap>Если для данного файла отсутствуют ассоциированные команды
запуска и установлен параметр #Использовать стандартные типы#
в ~Системных параметрах~@SystemSettings@, то Far пытается использовать
ассоциации Windows для запуска этого типа файлов.
 2. ^<wrap>~Команды~@OSCommands@ операционной системы "IF EXIST" и "IF DEFINED"
позволяют сделать ассоциации более "умными" - если вы назначили несколько
ассоциаций для одного типа файлов, то в меню попадут только те ассоциации,
у которых условия будут выполняться.
 3. ^<wrap>If the specified mask is a regular expression, its capturing groups can be referenced in the commands as %RegexGroup#N# or %RegexGroup{#Name#}.


@MetaSymbols
$ #Метасимволы#
 В ~ассоциированных командах~@FileAssoc@, ~пользовательском меню~@UserMenu@
и команде ~"Применить команду"~@ApplyCmd@ могут использоваться специальные метасимволы:

 #!!#       ^<wrap>символ ‹!›
 #!#        Длинное имя файла без расширения
 #!~~#       Короткое имя файла без расширения
 #!`#       Длинное расширение файла без имени (ext)
 #!`~~#      Короткое расширение файла без имени (ext)
 #!.!#      Длинное имя файла с расширением
 #!-!#      Короткое имя файла с расширением
 #!+!#      Аналогично !-!, но если длинное имя файла утеряно после выполнения команды, Far восстановит его
 #!@@!#      Имя файла, содержащего имена помеченных файлов
 #!$!#      Имя файла, содержащего короткие имена помеченных файлов
 #!&#       Список помеченных файлов
 #!&~~#      Список помеченных файлов с короткими именами
 #!:#       Текущий диск в формате "C:". Для сетевых каталогов - "\\\\server\\share"
 #!\\#       Текущий путь
 #!/#       Короткое имя текущего пути
 #!=\\#      Текущий путь с учётом ~символических ссылок~@HardSymLink@.
 #!=/#      Короткое имя текущего пути с учётом ~символических ссылок~@HardSymLink@.
 #!?!#      Описание файла

 #!?<title>?<init>!#
 При выполнении команды этот символ заменяется данными, введёнными пользователем. <title> и
<init> - заголовок и исходный текст строки редактирования.
 Допускается использование нескольких таких символов в одной строке, например:
 grep !?Search for:?! !?In:?*.*!|c:\\far\\Far.exe -v -

 В <title> можно указать имя истории для строки <init>. В этом случае команда имеет следующий формат:
#!?$<history>$<title>?<init>!#, например:
 grep !?#$GrepHist$#Search for:?! !?In:?*.*!|Far.exe -v -

 Для отключения истории оставьте имя пустым.

 The entered string can also be accessed later as #%<history># (or as #%UserVarN#, where N is the index of the corresponding input).

 В <title> и <init> допускается использование прочих метасимволов, заключив их в круглые операторные скобки, например
grep !?В (!.!) найти:?! |Far.exe -v -.

 #!###
 Префикс "!##" заставляет все последующие метасимволы ссылаться
на пассивную панель (см. примечание 4).
Например, !##!.! обозначает имя текущего файла на
пассивной панели.

 #!^#
 Префикс "!^" заставляет все последующие метасимволы ссылаться
на активную панель (см. примечание 4).
Например, !^!.! обозначает имя текущего файла на
активной панели, а конструкция !##!\\!^!.! - файл на
пассивной панели с таким же именем, как имя текущего
файла на активной панели.

 #![#
 "![" prefix forces all subsequent special symbols
to refer to the left panel (see note 4).
For example, ![!.! denotes a current file name on
the left panel, ![!\\!^!.! - a file on the left
panel with the same name as the name of the current
file on the active panel.

 #!]#
 "!]" prefix forces all subsequent special symbols
to refer to the right panel (see note 4).
For example, !]!.! denotes a current file name on
the right panel, !]!\\!^!.! - a file on the right
panel with the same name as the name of the current
file on the active panel.

 Примечания:

 1. ^<wrap>Far при обработке метасимволов подставляется только то, что они означают
(имя файла, расширение и т.д.). Никаких дополнительных символов (например,
кавычек или фамилий разработчиков Far) не подставляется и вы должны это сделать
сами, если потребуется. Например, если используемая в ассоциациях программа
требует, чтобы имя файла было в кавычках, то вы должны писать
#program.exe "!.!"#, а не #program.exe !.!#.

 2. ^<wrap>Для метасимволов !@@! и !$! допускаются следующие модификаторы:
    #Q# - заключать имена в кавычки;
    #S# - использовать ‹/› вместо ‹\\› в путях файлов;
    #F# - использовать полный путь;
    #A# - использовать кодовую страницу ANSI;
    #U# - использовать кодовую страницу UTF-8;
    #W# - использовать кодовую страницу UTF-16 (Little endian).

    ^<wrap>Например, #!@@AFQ!# - имя файла, содержащего имена помеченных
файлов с полным путём в кодовой странице ANSI; имена файлов будут заключены в кавычки.

    ^<wrap>Для метасимволов !& и !&~~ допускаются следующие модификаторы:
    #Q# - заключать каждое имя в кавычки. Это же поведение по умолчанию, если никакой модификатор не задан.
    #q# - не заключать имена в кавычки (как это было до сборки 5466).

    ^<wrap>Например, #!&Q# - имена помеченных файлов, заключённые в кавычки.

 3. ^<wrap>Метасимволы !@@! и !$! в меню выбора (когда задано несколько ассоциаций) и меню пользователя
показываются как есть, преобразование происходит в момент исполнения команды.

 4. ^<wrap>Префиксы "!##", "!^", "![" и "!]" работают как переключатели.
Действие этих префиксов распространяется до следующего подобного префикса. Например:

    if exist !##!\\!^!.! diff -c -p !##!\\!^!.! !\\!.!

   ^<wrap>"Если на пассивной панели существует такой же файл, как и на
активной под курсором, то показать расхождения между файлом
на пассивной панели и файлом на активной панели, независимо
от имени текущего файла на пассивной панели"

 5. ^<wrap>Если нужно передать программе имя с завершающей обратной чертой,
используйте кавычки - #"!"\#.
    ^<wrap>Например, распаковать rar-архив в папку с таким же именем:

    #winrar x "!.!" "!"\#


@SystemSettings
$ #Системные параметры#
 #Удалять в Корзину#
 Разрешает удаление файлов с использованием Корзины (Recycle Bin). Операция удаления в
Корзину осуществляется только для локальных жёстких дисков.

 #Использовать системную функцию копирования#
 Использовать функции копирования файлов, предоставляемые операционной системой, вместо внутренней
реализации копирования файлов. Это может быть полезно на NTFS, так как системная функция (CopyFileEx)
копирует расширенные атрибуты файлов. В то же время, при включённой опции будет недоступно
"интеллектуальное" ~копирование~@CopyFiles@ разрежённых файлов.

 #Копировать открытые для записи файлы#
 Позволяет копировать файлы, которые открыты для записи другими программами. Этот режим удобен, когда
нужно скопировать открытый в течение долгого времени файл, но он может быть опасным, если этот файл
модифицируется одновременно с копированием.

 #Сканировать символические ссылки#
 Обрабатывать ~символические ссылки~@HardSymLink@ наравне с обычными подкаталогами при построении дерева
каталогов и определении суммарного размера файлов в подкаталогах.

 #Сохранять историю команд#
 Вызывает сохранение ~истории команд~@History@ перед завершением и её восстановление после запуска Far.

 #Сохранять историю папок#
 Вызывает сохранение ~истории папок~@HistoryFolders@ перед завершением и её восстановление после запуска Far.
Для просмотра содержимого истории папок нажмите #Alt+F12#.

 #Сохранять историю просмотра и редактора#
 Вызывает сохранение ~истории просмотра и редактирования~@HistoryViews@ перед завершением и её восстановление
после запуска Far. Для просмотра входящих в этот список файлов нажмите #Alt+F11#.

 #Использовать стандартные типы файлов#
 Если эта опция включена, то при нажатии Enter на файле, тип которого известен Windows и отсутствует
в ~ассоциациях файлов~@FileAssoc@ Far, будет запущена программа Windows,
предназначенная для обработки этого типа файлов.

 #Автообновление переменных окружения#
 При глобальном изменении переменных среды Far Manager автоматические корректирует значения своего окружения.

 #Запрос прав администратора#
 Во время выполнения разнообразных операций с файловой системой у текущего пользователя может не хватать прав.
Far Manager может повторить операцию от имени администратора (повысить права текущего пользователя).
 Доступны следующие опции:
 - ^<wrap>#для изменения#: разрешить выполнять от имени администратора операции, изменяющие состояние файловой системы (например, создание, изменение и удаление файлов)
 - ^<wrap>#для чтения#: разрешить выполнять от имени администратора операции, не изменяющие состояние файловой системы (например, чтение файлов и просмотр папок).
 - ^<wrap>#использовать дополнительные привилегии#: при выполнении действий от имени администратора будет предоставлен доступ ко всем файлам,
независимо от их списков контроля доступа (ACL). Не используйте эту опцию без необходимости.

 #Сортировочное сравнение#
 Выбор и настройки сравнения, используемого в сортировке.
 - ^<wrap>#порядковое# - на основании порядкового номера символов в строке
 - ^<wrap>#инвариантное# - инвариантное сравнение
 - ^<wrap>#лингвистическое# - с учётом языка и региональных параметров

 #Рассматривать цифры как числа#
 Если включено, идущие подряд группы цифр рассматриваются как числа. Следующий пример показывает, как сортируются файлы:
 ┌───────────┬──────────┐
 │ Выключено │ Включено │
 ├───────────┼──────────┤
 │ Ie4_01    │ Ie4_01   │
 │ Ie4_128   │ Ie4_128  │
 │ Ie401sp2  │ Ie5      │
 │ Ie5       │ Ie6      │
 │ Ie501sp2  │ Ie401sp2 │
 │ Ie6       │ Ie501sp2 │
 │ 11.txt    │ 5.txt    │
 │ 5.txt     │ 11.txt   │
 │ 88.txt    │ 88.txt   │
 └───────────┴──────────┘
 Примечание: трактовка цифр как чисел при лингвистическом сравнении доступна в Windows 7 и выше. В более старых ОС будет автоматически использоваться инвариантное сравнение.

 #Учитывать регистр#
 Учитывать регистр символов в строке.

 Примечание: как именно будет учитываться регистр символов в строке зависит от сортировочного сравнения.

 #Автозапись конфигурации#
 Если эта опция включена, Far будет автоматически сохранять конфигурацию. Также будут сохраняться текущие папки обеих панелей.


@PanelSettings
$ #Настройка панели#
 #Показывать скрытые и системные файлы#
 Разрешает показ файлов с атрибутами Скрытый или Системный. Этот режим также может быть переключён с помощью #Ctrl+H#.

 #Раскраска файлов#
 Разрешает ~раскраску файлов~@Highlight@

 #Пометка папок#
 Разрешает пометку папок с использованием #Gray +# и #Gray *#. В противном случае эти команды работают только с файлами.

 #Правый клик помечает файлы#
 Если эта опция включена, #Щелчок правой кнопкой мыши# помечает файлы, иначе он открывает Контекстное меню Проводника.

 #Сортировать имена папок по расширению#
 Применять режим сортировки по расширению не только к файлам, но и к папкам. При включённой опции сортировка по расширению
работает так же, как и в Far 1.65. Если опция выключена, то в режиме сортировки по расширению папки будут
сортироваться так же, как в режиме сортировки по имени.

 #Разрешить обратную сортировку#
 Если эта опция включена, и текущий режим сортировки файловой панели выбран повторно, то будет установлен режим обратной сортировки.

 #Отключать автообновление панелей…#
 Механизм автоматического обновления панели при изменении состояния файловой системы
будет отключаться, если количество файловых объектов превысит заданное значение.
 Механизм автоматического слежения за файловой системой работает только для файловых систем FAT/FAT32/NTFS.
Значение параметра, равное нулю соответствует состоянию "автоматическое обновление включено всегда".
Для принудительного обновления панели используйте #Ctrl+R#.

 #Автообновление сетевых дисков#
 Опция включает механизм автоматического обновления панели при изменении состояния файловой системы на сетевых дисках.
Отключение этой опции полезно на медленных сетевых подключениях.

 #Показывать заголовки колонок#
 Разрешает показ заголовков колонок ~панели файлов~@FilePanel@.

 #Показывать строку статуса#
 Разрешает показ строки статуса в панели файлов.

 #Определять точки монтирования диска#
 Различать обычные связи для папок (Junction) и точки монтирования дисков томов (Volume).
Эта опция существенно замедляет отображение каталога на медленных сетевых подключениях.

 #Показывать суммарную информацию#
 Разрешает показ суммарной информации в нижней строке панели файлов.

 #Показывать свободное место#
 Разрешает показ свободного места на текущем диске.

 #Показывать полосу прокрутки в панелях#
 Разрешает показ полосы прокрутки в панели файлов и ~панели дерева папок~@TreePanel@.

 #Показывать количество фоновых экранов#
 Разрешает показ количества ~фоновых экранов~@ScrSwitch@.

 #Показывать букву режима сортировки#
 Показывать текущий режим сортировки в верхнем левом углу панели.

 #Показывать ".." в корневых каталогах#
 Показывать элемент ".." в корневых каталогах.
Нажатие #Enter# на этом элементе открывает ~Меню выбора диска~@DriveDlg@.


@TreeSettings
$ #Настройки дерева папок#
 #Автосмена папки#
 Если эта опция включена, то передвижение курсора по ~дереву папок~@TreePanel@ будет синхронно менять папку в другой панели.
Если эта опция выключена, то для смены папки из дерева папок вы должны нажать #Enter#.

 #Минимальное количество папок#
 Минимальное количество папок на диске, для которого будет создаваться файл кэша дерева каталогов #tree3.far#.


@InterfSettings
$ #Настройка интерфейса#
 #Часы#
 Показывать часы в верхнем правом углу экрана.

 #Мышь#
 Использовать мышь.

 #Показывать линейку клавиш#
 Показывать назначения функциональных клавиш в нижней строке экрана.
Эта опция также может переключаться по #Ctrl+B#.

 #Всегда показывать меню#
 Показывать меню вверху экрана, даже когда оно неактивно.

 #Сохранение экрана#
 Запуск программы сохранения экрана после заданного в минутах интервала
бездействия. Хранитель экрана также включается, если подвести указатель
мыши в правый верхний угол окна Far Manager (при выбранной опции).

 #Показывать общий индикатор копирования#
 Показывать общий индикатор во время выполнения операции копирования.
Это может потребовать дополнительного времени перед началом копирования
для подсчёта общего размера файлов.

 #Показывать информацию о времени копирования#
 Выводить информации о средней скорости копирования, времени копирования и
примерном времени до конца операции в диалоге копирования.
 Так как эта функция требует времени для сбора статистики, то на
небольших файлах при выключенном "общем индикаторе копирования"
вы можете ничего не увидеть.

 #Показывать общий индикатор удаления#
 Показывать общий индикатор во время выполнения операции удаления.
Это может потребовать дополнительного времени перед началом удаления
для подсчёта общего количества файлов и папок.

 #Использовать Ctrl+PgUp для выбора диска#
 Комбинация клавиш #Ctrl+PgUp# в корневой папке позволяет вызвать
меню выбора дисков.
 Если установлен плагин Network, то для сетевых папок (и сетевых дисков при
третьем состоянии переключателя) будет показан список общих ресурсов сервера.

 #Use Virtual Terminal for rendering#
 Render the output using ANSI escape sequences. You can find more about it ~here~@https://docs.microsoft.com/en-us/windows/console/classic-vs-vt@.
 This allows using 8 and 24-bit colors, text styles, and may (or may not) work better (or worse) with some Unicode characters.
 Requires Windows 10 and above.

 #Fullwidth-aware rendering#
 Take into account the fact that East Asian characters require two screen cells instead of one.
 The support is rudimentary and experimental. It may work or not, depending on your OS, locale, terminal, font and other settings.

 #Учитывать состояние ClearType#
 При использовании векторных шрифтов и ClearType-сглаживания в консоли
иногда могут наблюдаться визуальные артефакты, вызванные недостатками
системных алгоритмов сглаживания, как правило, в виде тонких вертикальных
линий на границе символов.
 При включённой опции будет задействован альтернативный способ вывода
символов, позволяющий устранить эти артефакты, но это может несколько снизить
скорость вывода.

 #Иконка консоли#
 При активации этой опции Far установит выбранную встроенную иконку в качестве иконки своей консоли.
В противном случае вы можете выбрать любую желаемую иконку в свойствах ярлыка Far в Windows.

 #Альтернативная для администратора#
 При активации этой опции Far будет использовать красную иконку при работе с правами администратора.

 #Дополнительная информация для заголовка окна#
 Дополнительная информация, выводимая в заголовке окна консоли.
Может содержать любой текст, включая переменные окружения (например "%USERDOMAIN%\%USERNAME%") и следующие специальные переменные:
 - #%Ver# - версия Far;
 - #%Platform# - архитектура Far;
 - #%Admin# - ^<wrap>слово "Администратор", если Far запущен от имени администратора, иначе пустая строка.
 - #%PID# - ИД текущего процесса Far;


@DialogSettings
$ #Настройка диалогов#
 #История в строках#       Сохранять историю в строках ввода
 #ввода диалогов#          некоторых диалогов Far. Список ранее
                         введённых строк может быть вызван с помощью
                         мыши или #Ctrl+Up# и #Ctrl+Down#. Если вы
                         не хотите вести такую историю, например,
                         по соображениям безопасности, выключите
                         эту опцию.

 #Постоянные блоки#        Не снимать выделение при перемещении
 #в строках ввода#         курсора в строках ввода.

 #Del удаляет блоки#       Клавиша Del удаляет выделенный блок
 #в строках ввода#         в строках ввода.

 #Автозавершение#          Разрешает использование функции
 #в строках ввода#         автозавершения в строках ввода, имеющих
                         историю или в комбинированных списках.
                         При отключённой опции для автозавершения
                         строк можно воспользоваться комбинацией
                         клавиш #Ctrl+End#. Операция автозавершения
                         не работает во время записи и исполнения
                         макроса.

 #Backspace удаляет#       Если опция включена, то нажатие клавиши
 #неизменённый текст#      BackSpace в неизменённой текстовой
                         строке удаляет всю строку, как если бы
                         нажали клавишу #Del#.

 #Клик мыши вне диалога#   Щелчок левой или правой клавишей мыши
 #закрывает диалог#        за пределами диалога закрывает диалог
                         (подробнее см. ~Общие команды~@MiscCmd@).
                         Эта опция позволяет отключать указанную
                         функциональность.

 См. также список ~макроклавиш~@KeyMacroDialogList@, доступных в диалогах.


@VMenuSettings
$ #Настройка меню#
 #Клик левой/правой/средней кнопки мыши вне меню#
 Вы можете выбрать действие кнопок мыши при клике вне поля меню:
#Закрыть с отменой#, #Выполнить текущий пункт# или #Ничего не делать#.


@CmdlineSettings
$ #Настройка командной строки#
 #Постоянные блоки#
 Не снимать выделение при перемещении в командной строке.

 #Del удаляет блоки#
 Клавиша Del удаляет выделенный блок в командной строке.

 #Автозавершение#
 Разрешает использование функции автозавершения в командной строке.
При отключённой опции для автозавершения можно воспользоваться комбинацией
клавиш #Ctrl+Space#. Операция автозавершения не работает во время записи и исполнения макроса.

 #Установить формат командной строки#
 Эта опция позволяет изменить ~формат приглашения~@CommandPrompt@ командной строки.

 #Использовать домашний каталог#
 Эта опция задаёт папку, куда произойдёт переход по команде
~CD ~~~@OSCommands@. Если задана пустая строка, #CD ~~# попытается
перейти в реальную папку «~~» (что приведёт к ошибке, если это
невозможно, например, потому, что такая папка не существует).
Значение по умолчанию: строка «%FARHOME%», символизирующая домашнюю папку
Far Manager’а.


@AutoCompleteSettings
$ #Настройка автозавершения#
 #Показывать список#
 Показать варианты автозавершения в виде списка.

 #Модальный режим#
 Список будет модальным.

 #Подставлять первый подходящий вариант#
 По мере ввода строка будет дополняться первым подходящим значением.

 Cуществует несколько дополнительных параметров, определяющих, какие источники данных будут использованы для наполнения списка автозавершения:
 - #Interface.Completion.UseFilesystem#
 - #Interface.Completion.UseHistory#
 - #Interface.Completion.UsePath#
 - #Interface.Completion.UseEnvironment#
 Все параметры могут принимать 3 состояния: да, нет, только в ручном режиме (используя #Ctrl+Space#).
Управлять этими параметрами можно через ~far:config~@FarConfig@.


@CommandPrompt
$ #Формат командной строки#
 Far позволяет изменить формат приглашения командной строки.
Для этого в поле ввода #Установить формат командной строки# диалога
~Настроек командной строки~@CmdlineSettings@ необходимо ввести нужную
последовательность переменных и специальных кодов, которая позволит
показать дополнительную информацию в приглашении.

 Допускается использовать переменные окружения и следующие специальные коды:

 $a - ^<wrap>символ &
 $b - символ |
 $c - символ (
 $d - текущая дата (зависит от системных настроек)
 $f - символ )
 $g - символ >
 $h - удалить предыдущий символ
 $l - символ <
 $m - полное имя удалённого диска, связанного с именем текущего диска, или пустой строки, если текущий диск не является сетевым
 $n - буква текущего диска
 $p - текущий диск и путь
 $q - символ =
 $s - пробел
 $t - текущее время в формате HH:MM:SS
 $w - текущий рабочий каталог (без указания пути)
 $$ - символ $
 $+ - глубина стека каталогов
 $##nn - ^<wrap>максимальная ширина строки приглашения в процентах от ширины окна
 $@@xx - ^<wrap>"Администратор", если Far Manager запущен от имени администратора.
Вместо 'xx' необходимо указать два символа, которые будут обрамлять слово "Администратор".
Например, #$@@{}$s$p$g# будет представлен как "{Администратор} C:\>"

 По умолчанию используется последовательность #$p$g# - текущий дисковод и путь ("C:\>").

 Примеры.

 1. ^<wrap>Приглашение формата #[%COMPUTERNAME%]$S$P$G# будет
содержать имя компьютера, текущий диск и путь
(переменная окружения %COMPUTERNAME% должна быть определена)

 2. ^<wrap>Приглашение формата #[$T$H$H$H]$S$P$G# перед текущем путём
выведет время в формате HH:MM

 3. ^<wrap>Код "$+" отображает нужное число знаков плюс (+) в зависимости
от текущей глубины стека каталогов ~PUSHD~@OSCommands@, по одному знаку на
каждый сохранённый путь.

 Элементы приглашения можно выделять #цветом#.

 Формат:
 #([[T]FFFFFFFF][:[T]BBBBBBBB][:style[:[T]UUUUUUUU]])#, где:

  #FFFFFFFF#
  Цвет текста в формате aarrggbb или индекс в 16-цветной палитре.

  #BBBBBBBB#
  Цвет фона в формате aarrggbb или индекс в 16-цветной палитре.

  #style#
  One or more text styles, separated by spaces:
  #bold#
  #italic#
  #overline#
  #strikeout#
  #faint#
  #blink#
  #inverse#
  #invisible#
  #underline#
  #underline_double#
  #underline_curly#
  #underline_dot#
  #underline_dash#

  #UUUUUUUU#
  Цвет фона в формате aarrggbb или индекс в 16-цветной палитре.

  #T#
  Признак "труколорности", если он отсутствует - цвет считается индексом в стандартной палитре (00-FF):

  \00 \11 \22 \33 \44 \55 \66 \77 \88 \99 \AA \BB \CC \DD \EE \FF \-
  0123456789ABCDEF

 Если цвет не указан, используется значение по умолчанию.

 Примеры:

 #(E)#               \0e Ярко-жёлтый текст на стандартном фоне   \-
 #(:F)#              \f7 Стандартный текст на белом фоне         \-
 #(B:C)#             \cb Ярко-голубой текст на ярко-красном фоне \-
 #()#                \07 Стандартный текст на стандартном фоне   \-
 #(T00CCCC:TE34234)# \(T00CCCC:TE34234) Яйца дрозда на киновари                 \-

 Указанный цвет окрашивает приглашение до конца либо до следующего вхождения цвета.

 Пример использования:

 #(a)%username%(f)@@(b)%computername%() $p$g# \0aadmin\0f@@\0bserver\07 C:\\>\-


@Viewer
$ #Программа просмотра: клавиши управления#
 Клавиши навигации

 Поведение клавиш навигации зависит от ~режима просмотра~@ViewerMode@.

 Клавиши, работающие во всех режимах:

 #Up#                 ^<wrap>Строка вверх
 #Down#               Строка вниз
 #PgUp#               Экран вверх
 #PgDn#               Экран вниз
 #Home, Ctrl+Home#    В начало файла
 #End, Ctrl+End#      В конец файла

 В режиме #текст без переноса строк# работают дополнительные клавиши:

 #Left#               ^<wrap>Одна колонка влево
 #Right#              Одна колонка вправо
 #Ctrl+Left#          20 колонок влево
 #Ctrl+Right#         20 колонок вправо
 #Ctrl+Shift+Left#    Показать самую левую колонку
 #Ctrl+Shift+Right#   Показать самую правую колонку из всех строк, видимых на экране

 В режимах #дамп# и #код# работают дополнительные клавиши:

 #Ctrl+Left#          ^<wrap>Сдвинуть все символы (режим #дамп#) или байты (режим #код#) вправо,
причём последний символ (байт) каждой строки становится первым в следующей строке
 #Ctrl+Right#         Сдвинуть все символы (режим #дамп#) или байты (режим #код#) влево.
причём первый символ (байт) каждой строки становится последним в предыдущей строке

 В режиме #код# работают дополнительные клавиши:

 #Alt+Left#           ^<wrap>Уменьшить количество байт, показываемых на каждой строке, на один байт
 #Alt+Right#          Увеличить количество байт, показываемых на каждой строке, на один байт
 #Ctrl+Alt+Left#      Уменьшить количество байт, показываемых на каждой строке, до ближайшего кратного 16
 #Ctrl+Alt+Right#     Увеличить количество байт, показываемых на каждой строке, до ближайшего кратного 16

 Команды программы просмотра

 #F1#                 ^<wrap>Помощь
 #F2#                 Переключить режим переноса строк в режиме #текст# или изменить ~режим просмотра~@ViewerMode@
 #Shift+F2#           Переключить способ переноса строк (по буквам или по словам) в ~режиме просмотра~@ViewerMode@ #текст#
 #F4#                 Переключить ~режим просмотра~@ViewerMode@ в #код# и обратно
 #Shift+F4#           Выбрать ~режим просмотра~@ViewerMode@: #текст#, #код# или #дамп#
 #F6#                 Переключиться в ~редактор~@Editor@
 #F7#                 ~Поиск~@ViewerSearch@
 #Shift+F7, Space#    Продолжить поиск вперёд
 #Alt+F7#             Продолжить поиск назад
 #F8#                 Переключить кодовую страницу между OEM и ANSI
 #Shift+F8#           Выбрать кодовую страницу из ~меню~@CodePagesMenu@
 #Alt+F8#             ~Изменить текущую позицию~@ViewerGotoPos@
 #Alt+F9#             Максимизировать или восстановить размер окна Far Manager;
см. также ~Interface.AltF9~@Interface.AltF9@
 #Alt+Shift+F9#       Вызов диалога ~настройки программы просмотра~@ViewerSettings@
 #Numpad5,F3,F10,Esc# Выход
 #Ctrl+F10#           Перейти на текущий файл на активной файловой панели.
 #F11#                Показать меню ~Команд плагинов~@Plugins@
 #Alt+F11#            Показать ~историю просмотра и редактирования~@HistoryViews@
 #Gray +#             Просматривать следующий файл на активной файловой панели
 #Gray -#             Просматривать предыдущий файл на активной файловой панели
 #Ctrl+O#             Показать пользовательский экран
 #Ctrl+Alt+Shift#     Временно показать пользовательский экран
(пока эти клавиши нажаты)
 #Ctrl+B#             Спрятать/показать полосу функциональных клавиш внизу экрана
 #Ctrl+Shift+B#       Спрятать/показать статусную строку
 #Ctrl+S#             Спрятать/показать полосу прокрутки
 #Alt+BS, Ctrl+Z#     Вернуться к предыдущей позиции
 #ПравыйCtrl+0…9#     Установить закладку 0…9 в текущей позиции
 #Ctrl+Shift+0…9#     Установить закладку 0…9 в текущей позиции
 #ЛевыйCtrl+0…9#      Перейти к позиции закладки 0…9
 #Ctrl+Ins, Ctrl+C#   Скопировать выделенный текст в буфер обмена.
Текст может быть выделен вручную или в результате ~поиска~@ViewerSearch@.
 #Ctrl+U#             Сбросить выделение текста
 #Shift+Клик мыши#    Выделить текст вручную. Первый клик мыши задаёт начало выделенной
области, второй клик -- конец области. После первого клика можно
использовать любые клавиши навигации, чтобы сделать видимой конечную
позицию, которая может быть раньше или позже начальной по тексту.

 См. также список ~макроклавиш~@KeyMacroViewerList@, доступных в программе просмотра.

 Примечания:

 1. ^<wrap>Программа просмотра открывает файл в режиме, когда
разрешено его удаление. Если другой процесс попытается удалить файл,
пока он открыт в программе просмотра, то файл будет удалён после
закрытия программы просмотра. Все операции на файле, находящемся в таком
состоянии, будут заканчиваться неуспехом. Это свойство операционной системы Windows.

 2. ^<wrap>Максимальное число колонок, показываемых в
~режиме просмотра~@ViewerMode@ #текст#, можно задать в диалоге
~настроек программы просмотра~@ViewerSettings@. Допустимые значения
от 100 до 100 000, умолчание 10 000. Строки длиннее максимума будут разбиты
на несколько строк, даже если режим переноса строк отключён.

 3. ^<wrap>Far начинает ~поиск~@ViewerSearch@ (#F7#) от начала
видимой в данный момент области.

 4. ^<wrap>Для авто-скроллинга файла, который непрерывно пополняется
другим процессом (ср. Linux «tail»), установите текущую позицию на конец
файла (нажмите клавишу #End#).


@ViewerMode
$ #Программа просмотра: режимы просмотра#
 Программа просмотра может отображать файл в трёх режимах: #Текст#,
#Код# и #Дамп#. Текущий режим обозначается одной буквой в первой
(статусной) строке окна, слева от текущей кодовой страницы:
 - #t#: текст,
 - #h#: код,
 - #d#: дамп.

 При открытии файла, если опция #Сохранять режим просмотра# в
~настройках программы просмотра~@ViewerSettings@
включена и открываемый файл есть в
~истории просмотра и редактирования~@HistoryViews@,
выбирается последний использованный режим. Иначе, если опция #Автовыбор дамп-режима просмотра# в
~настройках программы просмотра~@ViewerSettings@ включена и Far считает
файл бинарным, выбирается режим #дамп#. Иначе выбирается режим #текст#.

 Режим просмотра можно изменить вручную следующими клавишами:

 #Shift+F4#
 Открывает меню #режима просмотра#. Если выбрать
режим #текст# или #дамп#, этот режим становится #базовым# режимом. Выбор
режима #код# переключает текущий режим, но не меняет #базовый# режим.

 #F4#
 Переключает режимы #текст# и #дамп# в #код#,
а режим #код# в последний установленный в меню #режима просмотра#
базовый режим (#текст# или #дамп#).

 #F2#
 В режиме #текст# включает или выключает режим
переноса длинных строк, переключает режим #дамп# в #текст# и переключает
режим #код# в режим противоположный последнему установленному в меню
#режима просмотра# базовому режиму (#дамп# или #текст#). То есть, #F4#
и #F2# переключают режим #код# в разные режимы.

 См. также полный список клавиш управления ~программы просмотра~@Viewer@.

 Режим #текст#

 В режиме #текст# программа просмотра отображает содержимое файла,
интерпретируя последовательности байт как строки символов, используя
кодировку, определённую текущей кодовой страницей. (Обратите внимание,
что в некоторых кодировках символ может быть представлен двумя и более
байтами.) Последовательности байт, недопустимые в текущей кодировке,
и символы, для которых нет изображения в шрифте окна консоли,
изображаются вопросительным знаком, или пустым прямоугольником, или
маленьким вопросительным знаком в прямоугольнике, или пробелом.
Представление зависит от шрифта окна консоли.

 Строки переводятся по обычным разделителям строк: U+000A U+000D
(формат Dos/Windows), U+000A (формат Unix), или U+000D (формат Mac).

 Длинные строки, которые не помещаются в окно, отображаются
не полностью либо переносятся и занимают по несколько строк экрана.
Клавиша #F2# включает и выключает режим переноса. В режиме переноса
комбинация клавиш #Shift+F2# включает или выключает перенос по словам.

 В режиме без переноса строк текст в окне можно двигать
горизонтально. Клавиша #Right# сдвигает текст на одну колонку влево,
клавиша #Left# сдвигает на одну колонку вправо (представьте сдвиг окна
по тексту). Комбинации клавиш #Ctrl+Right# и #Ctrl+Left# сдвигают на 20
колонок. Если опция #Показывать стрелки сдвига# в
~настройках программы просмотра~@ViewerSettings@ включена, строки,
не поместившиеся на экране, обозначаются символами #«# и #»#
у соответствующего края окна. Эти символы отображаются другим цветом.

 Максимальная длина строк ограничена параметром #Максимальная ширина строки#
~настроек программы просмотра~@ViewerSettings@. Более длинные строки
переносятся и отображаются на нескольких строках экрана даже если режим
переноса выключен.

 Режим #дамп#

 В режиме #дамп# нет понятия строки текста. Программа просмотра
отображает содержимое файла посимвольно, без учёта переводов строк
и управляющих символов, отображаемых как обычные символы. Символы
заполняют строки экрана слева направо. По достижении конца строки
следующий символ отображается в левой позиции следующей строки.

 ПРИМЕЧАНИЕ: Строго говоря, текст отображается по кодовым единицам,
а не по символам. Размер кодовой единицы зависит от кодировки текущей
кодовой страницы; один байт для однобайтовых кодировок (например, все
кодовые страницы ANSI) и UTF-8, два байта для кодировок UTF-16 and
UTF-16BE. Например:

 Кодовая страница 1252 (ANSI - Latin I): каждый байт отображается
в своей позиции экрана.

 Кодовая страница 65001 (UTF-8): символ отображается в позиции,
соответствующей ведущему байту последовательности UTF-8, а позиции
байтов продолжения заполняются символом #›# (кодовая позиция U+203A).

 Кодовая страница 1200 (UTF-16): каждая позиция экрана представляет
два последовательных байта начиная с чётного смещения в файле.

 Режим #код# (Hex, шестнадцатеричные коды)

 В режиме #код# программа просмотра отображает шестнадцатеричное
представление байтов файла. Каждая строка начинается с шестнадцатеричного
смещения первого байта и заканчивается символьным изображением байт этой строки.

 Отображение зависит от кодировки, определяемой текущей кодовой страницей.
Для однобайтовых кодировок (например, все кодовые страницы ANSI)
байты на каждой строке изображаются последовательностью двузначных
шестнадцатеричных значений, за которой следует последовательность
символов такой же длины. Для кодировки UTF-8 байты изображаются так же,
а символы отображаются в позициях ведущих байт UTF-8
последовательностей. Байты продолжения заполняются символом #›# (кодовая
позиция U+203A). Для кодировки UTF-16(BE) каждой паре двузначных
шестнадцатеричных значений соответствует один символ. Например:

 Кодовая страница 1252 (ANSI - Latin I)

@-
 \1b0000000000: 54 68 65 20 71 75 69 63 │ 6B 20 62 72 6F 77 6E 20  The quick brown \-
 \1b0000000010: 66 6F 78 20 6A 75 6D 70 │ 73 20 6F 76 65 72 20 74  fox jumps over t\-
 \1b0000000020: 68 65 20 6C 61 7A 79 20 │ 64 6F 67 27 73 20 62 61  he lazy dog's ba\-
 \1b0000000030: 63 6B 2E 0D 0A          │                          ck.♪◙           \-
@+

 Кодовая страница 65001 (UTF-8)

@-
 \1b0000000035: D0 92 20 D1 87 D0 B0 D1 │ 89 D0 B0 D1 85 20 D1 8E  В› ч›а›щ›а›х› ю›\-
 \1b0000000045: D0 B3 D0 B0 20 D0 B6 D0 │ B8 D0 BB 2D D0 B1 D1 8B  г›а› ж›и›л›-б›ы›\-
 \1b0000000055: D0 BB 20 D1 86 D0 B8 D1 │ 82 D1 80 D1 83 D1 81 2C  л› ц›и›т›р›у›с›,\-
@+

 Кодовая страница 1200 (UTF-16)

@-
 \1b00000000A2: 3D 04 3E 04 20 00 44 04 │ 30 04 3B 04 4C 04 48 04  но фальш\-
 \1b00000000B2: 38 04 32 04 4B 04 39 04 │ 20 00 4D 04 3A 04 37 04  ивый экз\-
 \1b00000000C2: 35 04 3C 04 3F 04 3B 04 │ 4F 04 40 04 2C 00 20 00  емпляр, \-
 \1b00000000D2: 34 04 30 04 2E 00 0D 00 │ 0A 00                    да.♪◙   \-
@+


@ViewerGotoPos
$ #Программа просмотра: изменить текущую позицию#
 Этот диалог позволяет сменить позицию во встроенной программе просмотра

 Вы можете ввести абсолютное или относительное значение или процентное соотношение в десятичной или 16-ричной системе.
 Для относительного добавьте #+# или #-# перед значением.
 Для процентного добавьте #%# после значения.
 Для десятичной добавьте #m# после значения или выключите #16-ричное значение#.
 Для 16-ричной добавьте #0x# или #$# перед значением, или #h# после, или включите #16-ричное значение#.

 Значение будет интерпретировано как смещение от начала файла. Если текущий режим просмотра - #текст без переноса строк#,
можно ввести дополнительное значение, которое будет интерпретировано как номер первой видимой колонки.
Значения должны быть разделены пробелом или одним из следующих символов: #,.;:#.
Если значение опущено, соответствующий параметр не будет изменён.


@ViewerSearch
$ #Программа просмотра: поиск#
 Для поиска в ~программе просмотра~@Viewer@ вам доступны следующие режимы и
опции:

 #Искать текст#
 Поиск произвольного теста, набранного в строке #Искать#.

 #Искать 16-ричный код#
 Поиск фрагмента, соответствующего шестнадцатеричным кодам, набранного в строке #Искать#.

 #Учитывать регистр#
 При поиске будет учитываться регистр введённых символов.

 #Только целые слова#
 При поиске будет произведён поиск только целого слова.

 #Нестрогий поиск#
 При поиске не будут учитываться различия в диакритических знаках (например, образец #deja# будет найден
в строке #déjà vu#), не будут различаться лигатуры и соответствующие многосимвольные последовательности
(#fluffy# совпадает с #ﬂuﬀy#), затейливые и обычные цифры (#42# совпадает с #④②#), и многое другое.

 Заметьте, что нестрогий поиск с учётом регистра может оказаться полезен. Например, #Uber# будет найден
в #Überwald# но не в #überwald#. Однако, #Æther# совпадает с #AEther#, но не с #Aether#.

 #Регулярные выражения#
 Рассматривать строку поиска, как ~регулярное выражение~@RegExp@.
Поиск построчный, поэтому многострочные конструкции и переводы строк не будут найдены.

 Кнопка #Искать следующий# начинает поиск вперёд.

 Кнопка #Искать предыдущий# начинает поиск назад.


@Editor
$ #Редактор#
 Для редактирования выделенного курсором файла следует нажать #F4#. Может
использоваться как встроенный редактор, так и любой иной указанный
пользователем, выбор редактора осуществляется в меню ~Настройки редактора~@EditorSettings@.

 #Создание файлов с помощью редактора#

 Если после нажатия комбинации клавиш #Shift+F4# ввести имя файла, не
имеющегося на диске, то при этом будет создан ~новый файл~@FileOpenCreate@.

 Примечания:

 1. ^<wrap>Если при открытии нового файла вы указали имя несуществующей папки, то
появится предупреждение: "~Путь к редактируемому файлу не существует~@WarnEditorPath@".
 2. ^<wrap>При попытке повторного открытия на редактирование файла, Far выдаст
предупреждение: "~Повторное открытие файла~@EditorReload@".
 3. ^<wrap>Кодовую страницу, используемую при создании нового файла можно выбрать в меню
~Настройки редактора~@EditorSettings@.

 #Клавиши управления#

 Команды управления курсором

 #Left#                    ^<wrap>Символ влево
 #Ctrl+S#                  Символ влево, но курсор не будет переходить на предыдущую строку при достижении начала строки
 #Right#                   Символ вправо
 #Up#                      Строку вверх
 #Down#                    Строку вниз
 #Ctrl+Left#               Слово влево
 #Ctrl+Right#              Слово вправо
 #Ctrl+Up#                 Прокрутка экрана вверх
 #Ctrl+Down#               Прокрутка экрана вниз
 #PgUp#                    Страницу вверх
 #PgDn#                    Страницу вниз
 #Home#                    В начало строки
 #End#                     В конец строки
 #Ctrl+Home, Ctrl+PgUp#    В начало файла
 #Ctrl+End, Ctrl+PgDn#     В конец файла
 #Ctrl+N#                  В начало экрана
 #Ctrl+E#                  В конец экрана

 Удаление

 #Del#                     ^<wrap>Удалить символ (также может удалить блок, в зависимости от ~Настроек редактора~@EditorSettings@)
 #BS#                      Удалить символ слева
 #Ctrl+Y#                  Удалить строку
 #Ctrl+K, Alt+D#           Удалить до конца строки
 #Ctrl+BS#                 Удалить слово слева
 #Ctrl+T, Ctrl+Del#        Удалить слово справа

 Операции над блоками

 #Shift+Клавиши курсора#   ^<wrap>Пометка блока
 #Ctrl+Shift+Клав.курсора# Пометка блока
 #Alt+серые клав.курсора#  Пометка вертикального блока
 #Alt+Shift+Клав.курсора#  Пометка вертикального блока
 #Ctrl+Alt+серые клавиши#  Пометка вертикального блока
 #Ctrl+A#                  Пометить весь текст
 #Ctrl+U#                  Снять пометку с блока
 #Shift+Ins, Ctrl+V#       Скопировать блок из Буфера Обмена
 #Shift+Del, Ctrl+X#       Переместить блок в Буфер Обмена
 #Ctrl+Ins, Ctrl+C#        Скопировать блок в Буфер Обмена
 #Ctrl+<Gray +>#           Добавить блок в Буфер Обмена
 #Ctrl+D#                  Удалить блок
 #Ctrl+P#                  Копировать блок в текущую позицию курсора (только в режиме постоянных блоков, Буфер Обмена не изменяется)
 #Ctrl+M#                  Перенести блок в текущую позицию курсора (только в режиме постоянных блоков, Буфер Обмена не изменяется)
 #Alt+U#                   Сдвинуть блок влево
 #Alt+I#                   Сдвинуть блок вправо

 Прочие операции

 #F1#                      ^<wrap>Помощь
 #F2#                      Сохранить файл
 #Shift+F2#                ~Сохранить файл как…~@FileSaveAs@
 #Shift+F4#                Редактировать ~новый файл~@FileOpenCreate@
 #F6#                      Переключиться в ~программу просмотра~@Viewer@
 #F7#                      ~Поиск~@EditorSearch@
 #Ctrl+F7#                 ~Замена~@EditorSearch@
 #Shift+F7#                Продолжить поиск/замену вперёд
 #Alt+F7#                  Продолжить поиск/замену назад
 #F8#                      Переключение OEM/ANSI кодовой страницы
 #Shift+F8#                Выбор кодовой страницы
 #Alt+F8#                  ~Перейти~@EditorGotoPos@ на указанную строку и позицию
 #Alt+F9#                  Максимизировать или восстановить размер окна Far Manager; см. также ~Interface.AltF9~@Interface.AltF9@
 #Alt+Shift+F9#            Вызов диалога ~настроек редактора~@EditorSettings@
 #F10, F4, Esc#            Выход
 #Shift+F10#               Сохранение и выход
 #Ctrl+F10#                Позиционировать на текущий файл без выхода.
 #F11#                     Вызвать меню "~Команды плагинов~@Plugins@"
 #Alt+F11#                 Показать ~историю просмотра и редактирования~@HistoryViews@
 #Alt+BS, Ctrl+Z#          Отмена действия (Undo)
 #Ctrl+Shift+Z#            Повтор действия (Redo)
 #Ctrl+L#                  Запретить модификацию редактируемого текста
 #Ctrl+O#                  Показать пользовательский экран
 #Ctrl+Alt+Shift#          Временно показать пользовательский экран (работает до тех пор, пока удерживаем эти клавиши)
 #Ctrl+Q#                  Рассматривать следующую комбинацию клавиш как код символа
 #ПравыйCtrl+0…9#          Установить закладку 0…9 в текущей позиции
 #Ctrl+Shift+0…9#          Установить закладку 0…9 в текущей позиции
 #ЛевыйCtrl+0…9#           Перейти к позиции закладки 0…9
 #Shift+Enter#             Вставить в позицию курсора имя текущего файла на панели.
 #Ctrl+Shift+Enter#        Вставить в позицию курсора имя текущего файла на пассивной панели.
 #Ctrl+F#                  Вставить в позицию курсора полное имя редактируемого файла.
 #Ctrl+B#                  Спрятать/Показать линейку функциональных клавиш
 #Ctrl+Shift+B#            Спрятать/Показать статусную строку

 См. также список ~макроклавиш~@KeyMacroEditList@, доступных в редакторе.

 Примечания:

 1. ^<wrap>#Alt+U#/#Alt+I# сдвигают текущую строку, если блок не выделен.
 2. ^<wrap>Alt+Код символа на дополнительной клавиатуре вставляет в
редактируемую строку символ с указанным кодом (0-65535).
 3. ^<wrap>Если блок не выделен, то #Ctrl+Ins#/#Ctrl+C# помечают текущую
строку как блок и копируют её в Буфер Обмена.


@EditorSearch
$ #Редактор: поиск и замена#
 Для поиска и замены в ~редакторе~@Editor@ вам доступны следующие режимы и опции:

 #Учитывать регистр#
 При поиске будет учитываться регистр введённых символов.

 #Только целые слова#
 При поиске будет произведён поиск только целого слова.

 #Нестрогий поиск#
 При поиске не будут учитываться различия в диакритических знаках (например, образец #deja# будет найден
в строке #déjà vu#), не будут различаться лигатуры и соответствующие многосимвольные последовательности
(#fluffy# совпадает с #ﬂuﬀy#), затейливые и обычные цифры (#42# совпадает с #④②#), и многое другое.

 Заметьте, что нестрогий поиск с учётом регистра может оказаться полезен. Например, #Uber# будет найден
в #Überwald# но не в #überwald#. Однако, #Æther# совпадает с #AEther#, но не с #Aether#.

 #Регулярные выражения#
 Использовать регулярные выражения для ~поиска~@RegExp@ и ~замены~@RegExpRepl@.
Поиск построчный, поэтому многострочные конструкции и переводы строк не будут найдены.

 ~Сохранять стиль~@PreserveStyle@
 Сохранять стиль (регистр и разделители в исходном коде программ) заменяемого образца.

 Кнопки #Искать следующий# / #Заменить следующий# начинают поиск / замену вперёд.

 Кнопка #Искать предыдущий# / #Заменить предыдущий# начинают поиск / замену назад.

 Кнопка #Всё# открывает ~меню~@FindAllMenu@ результатов поиска всех вхождений образца поиска.


@PreserveStyle
$ #Редактор: Режим замены - Сохранять стиль#
 Режим ~замены~@EditorSearch@ #«Сохранять стиль»# в ~редакторе~@Editor@
осуществляет замену с сохранением стиля (регистр, разделители)
заменяемого текста. Этот режим может быть удобен для работы с исходным
кодом программ. Вот несколько примеров. Обратите внимание, что в каждом
случае сохранён стиль заменяемых строк.

@-
 ┌───────────────────┬────────────────────┬──────────────────────┐
 │ Искать / Заменить │ До замены          │ После замены         │
 ├───────────────────┼────────────────────┼──────────────────────┤
 │ tu / to           │ #Tu# be or not #tu# be │ #To# be or not #to# be   │
 ├───────────────────┼────────────────────┼──────────────────────┤
 │ UserName          │ writerUserName     │ writerPersonLogin    │
 │  /                │ user.NAME          │ person.LOGIN         │
 │ PersonLogin       │ DEFAULT_USER_NAME  │ DEFAULT_PERSON_LOGIN │
 │                   │ default-User-name  │ default-Person-login │
 └───────────────────┴────────────────────┴──────────────────────┘
@+

 #Более формально.#

 Основная операция, используемая в алгоритме, - это разбор строки
на токены. Токены разделяются одной литерой-разделителем или между
строчной и прописной буквами. Разделителем токенов может быть
#подчёркивание “_”#, #дефис “-”#, и #точка “.”#. Все токены должны быть
разделены одним и тем же разделителем. Если разбор неоднозначен, то вся
строка считается одним токеном. Например:

@-
 ┌──────────────────────┬──────────────────────┬─────────────────┐
 │ Образец поиска       │ Токены               │ Комментарий     │
 ├──────────────────────┼──────────────────────┼─────────────────┤
 │ testMe               │ test Me              │                 │
 │ WhatIsIt             │ What Is It           │                 │
 │ far-manager          │ far manager          │                 │
 │ Contact.Address.Type │ Contact Address Type │                 │
 │ USER_FIRST_NAME      │ USER FIRST NAME      │                 │
 ├──────────────────────┼──────────────────────┼─────────────────┤
 │ test_userName        │ test_userName        │ Неоднозначные   │
 │ one.two-three        │ one.two-three        │ разделители     │
 │ aBc.dEf.gHi          │ aBc.dEf.gHi          │                 │
 ├──────────────────────┼──────────────────────┼─────────────────┤
 │ A..B                 │ A..B                 │ Смежные         │
 │                      │                      │ разделители     │
 └──────────────────────┴──────────────────────┴─────────────────┘
@+

 В результате разбора также определяется общий тип разделителя и
стиль каждого токена. Токены бывают трёх стилей: #Title#case,
#lower#case, и #UPPER#case. Если в токене встречаются прописные
и строчные буквы или не-буквы, стиль такого токена не определён. Токен
состоящий из одной прописной буквы считается одновременно #Title#case
и #UPPER#case.

 #Для замены с сохранением стиля используется алгоритм, описанный ниже.#

 Образец поиска и строка замены разбираются по описанным выше
правилам. В тексте ищется строка, которая может быть разобрана на такие
же токены, как и образец поиска. Сравнение осуществляется в соответствии
с режимами поиска #«Учитывать регистр»# и #«Только целые слова»#.

 Если в найденной строке и в строке замены одинаковое количество
токенов, и у найденных токенов есть общий стиль (при этом #Title#case
предпочтительнее, чем #UPPER#case), токены замены преобразуются к этому
общему стилю. Если общий стиль не удаётся определить, то токены замены
преобразуются к стилю соответствующих им найденных токенов. После
преобразования токены замены соединяются через разделитель, полученный
при разборе найденной строки. Результат используется как строка замены.
Несколько примеров:

@-
 ┌───────────────────┬────────────────────┬──────────────────────┐
 │ Искать / Заменить │ До замены          │ После замены         │
 ├───────────────────┼────────────────────┼──────────────────────┤
 │ abc-def-ghi       │ AbcDefGhi          │ PqRstXyz             │
 │  /                │ ABC_DEF_GHI        │ PQ_RST_XYZ           │
 │ pq.RST.Xyz        │ abc.def.ghi        │ pq.rst.xyz           │
 │                   │ abcDefGhi          │ pqRstXyz             │
 │                   │ ABC_Def_Ghi        │ PQ_Rst_Xyz           │
 ├───────────────────┼────────────────────┼──────────────────────┤
 │ AA-B-C            │ Aa_B_C             │ Xxx_Yy_Zz            │
 │  /                │ aa-b-c             │ xxx-yy-zz            │
 │ xxx.Yy.ZZ         │ AA_B_C             │ XXX_YY_ZZ            │
 │                   │ aa.B.C             │ xxx.Yy.Zz            │
 │                   │ Aa.B.c             │ Xxx.Yy.zz            │
 └───────────────────┴────────────────────┴──────────────────────┘
@+

 Если в найденной строке и в строке замены количество токенов
не одинаково, первый токен и остальные токены обрабатываются
по отдельности. Первый токен замены наследует стиль первого найденного
токена. Остальные токены замены преобразуются к общему стилю остальных
найденных токенов. Если общий стиль не удаётся определить, то остальные
токены замены не изменяются. Как и в предыдущем случае, токены замены
соединяются через разделитель, полученный при разборе найденной строки,
и результат используется как строка замены. Примеры:

@-
 ┌───────────────────┬────────────────────┬──────────────────────┐
 │ Искать / Заменить │ До замены          │ После замены         │
 ├───────────────────┼────────────────────┼──────────────────────┤
 │ abc-def-ghi       │ Abc.def.ghi        │ Pq.rst.uvw.xyz       │
 │  /                │ ABC.Def.Ghi        │ PQ.Rst.Uvw.Xyz       │
 │ pq.RST.uvw.Xyz    │ abc.Def.ghi        │ pq.RST.uvw.Xyz       │
 │                   │ ABC.DEF.ghi        │ PQ.RST.uvw.Xyz       │
 ├───────────────────┼────────────────────┼──────────────────────┤
 │ A-B-C             │ A_B_C              │ Aa_Bb_Cc_Dd          │
 │  /                │ a-b-c              │ aa-bb-cc-dd          │
 │ aa.Bb.cc.DD       │ A.B.c              │ Aa.Bb.cc.DD          │
 └───────────────────┴────────────────────┴──────────────────────┘
@+

 В специальном случае, когда найденная строка состоит из одного
токена, а в строке замены несколько токенов, первый токен замены
наследует стиль найденного токена. Общий стиль остальных токенов замены
и тип разделителя выводятся их контекста найденной строки. Если сделать
это не удаётся, общим стилем считается стиль (единственного) найденного
токена, а разделителем -- пустая строка. Как и раньше, преобразованные
токены замены соединяются и используются как строка замены. Ещё
несколько примеров:

@-
 ┌───────────────────┬────────────────────┬──────────────────────┐
 │ Искать / Заменить │ До замены          │ После замены         │
 ├───────────────────┼────────────────────┼──────────────────────┤
 │ ijk               │ ijk.Zzz            │ mno.Pqr.Stu.Zzz      │
 │  /                │ AAA-ijk            │ AAA-mno-pqr-stu      │
 │ MnoPqrStu         │ aaa-ijk_ZZZ        │ aaa-mno_PQR_STU_ZZZ  │
 │                   │ AaaIjk             │ AaaMnoPqrStu         │
 │                   │ 0_ijk_9            │ 0_mno_Pqr_Stu_9      │
 │                   │ >ijk<              │ >mnopqrstu<          │
 └───────────────────┴────────────────────┴──────────────────────┘
@+

 Если образец поиска не удаётся найти по вышеописанным правилам,
но удаётся найти, как обычную строку, и найденная строка и строка замены
начинаются с буквы, то регистр первой буквы строки замены изменятся
на регистр первой буквы найденной строки. Например:

@-
 ┌───────────────────┬────────────────────┬──────────────────────┐
 │ Искать / Заменить │ До замены          │ После замены         │
 ├───────────────────┼────────────────────┼──────────────────────┤
 │ ab.cd / wx-yz     │ #A#b.cD              │ #W#x-yz                │
 └───────────────────┴────────────────────┴──────────────────────┘
@+


@FindAllMenu
$ #Редактор: Меню результатов поиска всех вхождений#
 В этом меню доступны следующие сочетания клавиш:

 #F5#
 Переключить размер меню.

 #Ctrl+Up#, #Ctrl+Down#
 Прокручивать текст в редакторе.

 #Ctrl+Enter#, #Ctrl+Щелчок левой кнопки мыши#
 Перейти к позиции найденного текста.

 #Ctrl+Numpad5#
 Выровнять все вхождения по вертикали.

 #Gray +#
 Добавить сеансовую закладку с текущей позицией.

 #ПравыйCtrl+0…9#, #Ctrl+Shift+0…9#
 Установить закладку 0…9 в текущей позиции.

 #ЛевыйCtrl+0…9#
 Перейти к позиции закладки 0…9.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@FileOpenCreate
$ #Редактор: Открыть/создать файл#
 Комбинация клавиш #Shift+F4# открывает существующий или создаёт
новый файл.

 Если указанный файл не существует, будет создан новый файл. Кодовая
страница для нового файла задаётся в списке #Кодовых страниц#. Если
в списке выбрано #По умолчанию#, то используется кодовая страница,
определённая в ~настройках редактора~@EditorSettings@.

 Кодовая страница для существующего файла определяется в соответствии
c выбором в списке #Кодовых страниц#.

 #По умолчанию#   - ^<wrap>Если файл открывался ранее и для него уже
сохранена кодовая страница (зависит от состояния параметра #Сохранять#
#позицию файла# в ~настройках редактора~@EditorSettings@), используется
сохранённая кодовая страница. Иначе, если в файле присутствует Byte
Order Mark, используется соответствующая Юникодная кодовая страница
-- UTF-8, UTF-16 (Little endian) или UTF-16 (Big endian). Иначе кодовая
страница определяется ~автоматически~@CodePageAuto@.

 #Автоматическое определение#
 Делается попытка ~автоматически~@CodePageAuto@ определить кодовую страницу по содержимому файла.

 #Определённая кодовая страница#
 Используется выбранная кодовая страница.


@FileSaveAs
$ #Редактор: сохранить файл как…#
 Редактируемый файл можно сохранить под другим именем - нажать #Shift+F2# и
указать другое имя, кодовую страницу и формат представления символа перевода строки.

 Если для сохраняемого файла выбрана одна из кодовых страниц: UTF-8,
UTF-16 (Little endian) или UTF-16 (Big endian), то при включённой опции #Добавить сигнатуру (BOM)#
в начало файла добавляется специальный маркер, позволяющий другим приложениям
однозначно идентифицировать этот файл.

 Вы можете также указать формат представления символа перевода строки:

 #Исходный формат#
 Не изменять символы перевода строк.

 #В формате Dos/Windows (CR LF)#
 В качестве последовательности перевода строк будут использоваться два символа -
возврат каретки и перевод строки (CR LF), принятые в Dos/Windows.

 #В формате Unix (LF)#
 В качестве последовательности перевода строк будет использоваться символ перевода
строки (LF), принятый в Unix.

 #В формате Mac (CR)#
 В качестве последовательности перевода строк будет использоваться символ возврата
каретки (CR), принятый в Mac.


@EditorGotoPos
$ #Редактор: перейти на указанную позицию#
 Этот диалог позволяет сменить позицию в редакторе

 Вы можете ввести абсолютное или относительное значение или процентное соотношение в десятичной или 16-ричной системе.
 Для относительного добавьте #+# или #-# перед значением.
 Для процентного добавьте #%# после значения.
 Для десятичной добавьте #m# после значения или выключите #16-ричное значение#.
 Для 16-ричной добавьте #0x# или #$# перед значением, или #h# после, или включите #16-ричное значение#.

 Первое значение будет интерпретировано как номер строки, второе - как номер символа.
Значения должны быть разделены пробелом или одним из следующих символов: #,.;:#.
Если значение опущено, соответствующий параметр не будет изменён.


@EditorReload
$ #Редактор: повторное открытие файла#
 Far Manager отслеживает все попытки повторного открытия в редакторе уже
редактируемых файлов. Правила повторного открытия следующие:

 1. ^<wrap>Если файл не был изменён, то при отключённой опции "Повторное открытие
файла в редакторе" в диалоге ~подтверждений~@ConfirmDlg@ происходит переход к
редактированию текущего файла без дополнительных запросов.

 2. ^<wrap>Если файл был изменён или включена опция "Повторное открытие файла в
редакторе", то существует три варианта действий:

 #Текущий#
 Продолжить редактирование того же файла.

 #Новая копия#
 Файл будет открыт для редактирования в новой
копии редактора. В этом случае будьте внимательны:
содержимое файла на диске будет соответствовать
тому, в какой из копий редактора последний раз
сохраняли этот файл.

 #Перегрузить#
 Текущие изменения не сохраняются и в редактор
загружается прежнее содержимое файла (с момента последнего сохранения).


@WarnEditorPath
$ #Предупреждение: Путь к редактируемому файлу не существует#
 При открытии нового файла в ~редакторе~@Editor@ вы указали имя
несуществующей папки. Перед сохранением файла Far создаст такую папку при
условии, что вами указан корректный путь (некорректным будет, например, путь,
начинающийся с несуществующей буквы диска) и что вы имеете достаточно
полномочий на создание папки.


@WarnEditorPluginName
$ #Предупреждение: Имя редактируемого файла не может быть пустым#
 Для создания нового файла на активной панели плагина необходимо указать
имя файла.


@WarnEditorSavedEx
$ #Предупреждение: Файл был изменён внешней программой#
 Дата/время записи или размер редактируемого файла на диске не
совпадают с теми, которые Far запомнил при последнем обращении к этому файлу.
Это означает, что другая программа, другой пользователь (или даже вы сами в
другом окне редактора) изменили содержимое файла на диске.

 Если вы нажмёте "Сохранить", файл будет перезаписан, и все изменения,
внесённые внешней программой, будут утеряны.


@CodePagesMenu
$ #Меню выбора кодовой страницы#
 Это меню позволяет выбрать кодовую страницу в редакторе и программе просмотра.

 Меню разделено на несколько частей:

 #Автоматическое определение#
 Far попытается ~автоматически~@CodePageAuto@ определить кодовую страницу текста;

 #Системные#
 Основные однобайтные системные кодовые страницы - ANSI и OEM;

 #Юникод#
 Юникодные кодовые страницы;

 #Избранные#
 Кодовые страницы, выбранные пользователем;

 #Прочие#
 Все остальные установленные в системе кодовые страницы.

 В этом меню доступны следующие сочетания клавиш:

 #Ctrl+H#
 Показывает или скрывает раздел #Прочие#.

 #Ins#
 Перемещает кодовую страницу из раздела #Прочие# в раздел #Избранные#.

 #Del#
 Перемещает кодовую страницу из раздела #Избранные# обратно в раздел #Прочие#.

 #F4#
 Открывает диалог ~Переименования кодовой страницы~@EditCodePageNameDlg@.
Переименованы могут быть только #Избранные# и #Прочие# кодовые страницы.
Переименованные кодовые страницы помечаются символом #*#.

 См. также общие ~клавиатурные команды меню~@MenuCmd@.


@EditCodePageNameDlg
$ #Переименование кодовой страницы#
 Этот диалог позволяет переименовать #Избранные# и #Прочие# кодовые
страницы. Far будет показывать новые имена кодовых страниц в меню
~кодовых страниц~@CodePagesMenu@.

 Кнопка #Сбросить# устанавливает имя кодовой страницы в заданное
системой значение по умолчанию. Имя также можно сбросить, оставив его
пустым и нажав кнопку #OK#.


@DriveDlg
$ #Меню выбора диска#
 Это меню позволяет сменить текущий диск панели или открыть новую панель ~плагина~@Plugins@.

 Выберите пункт меню с соответствующей буквой диска для смены текущего диска
или пункт с названием плагина, чтобы создать новую панель плагина. Если панель не
является ~панелью файлов~@FilePanel@, её тип будет изменён на панель файлов.

 Клавиши #Ctrl+A#, #F4# для дисков вызывают диалог ~файловых атрибутов~@FileAttrDlg@.

 Клавиши #Ctrl+A#, #F4# для плагинов позволяют назначить горячую клавишу.

 Клавиша #F3# показывает техническую информацию по плагину.

 Клавиша #Del# может использоваться для:
 - ^<wrap>~отсоединения~@DisconnectDrive@ сетевого диска;
 - удаления SUBST-диска;
 - отсоединения виртуального диска;
 - извлечения дисков из CD-ROM и сменных приводов.

 Для операции извлечения диска из ZIP-приводов требуются права администратора.

 Закрыть CD-ROM можно клавишей #Ins#.

 Комбинация #Shift+Del# используется для подготовки к безопасному
извлечению запоминающих устройств для USB. Если диск, для которого
применяется функция извлечения, является одной из flash-карт, вставленных
в картридер с поддержкой нескольких flash-карт, то будет отключён сам картридер.

 #Ctrl+1# - #Ctrl+9# переключают отображение различной информации:

 #Ctrl+1# - ^<wrap>тип диска;
 #Ctrl+2# - ^<wrap>сетевое имя / путь, ассоциированный с SUBST-диском
/ имя файла, содержащего виртуальный диск;
 #Ctrl+3# - ^<wrap>метка диска;
 #Ctrl+4# - ^<wrap>тип файловой системы;
 #Ctrl+5# - ^<wrap>размер диска и количество свободного места (эта опция имеет
два режима, нажмите два раза чтоб увидеть);
 #Ctrl+6# - ^<wrap>параметры сменных дисков;
 #Ctrl+7# - ^<wrap>плагины;
 #Ctrl+8# - ^<wrap>параметры компакт-дисков;
 #Ctrl+9# - ^<wrap>параметры сетевых дисков.

 Настройки #меню выбора диска# сохраняются в конфигурации Far.

 #F9# показывает ~диалог~@ChangeDriveMode@ для настройки отображения
этой информации.

 При включённой опции "~Использовать Ctrl+PgUp для выбора диска~@InterfSettings@",
комбинация клавиш #Ctrl+PgUp# аналогична клавише #Esc# - отказаться от
выбора диска и закрыть меню.

 #Shift+Enter# вызывает Проводник с показом корня указанного диска (работает
только для дисков).

 #Ctrl+H# shows unmapped volumes.

 #Ctrl+R# позволяет обновить меню выбора диска.

 Если включён показ параметров компакт-дисков (#Ctrl+8#), то Far будет
пытаться определить тип CD-привода. Различаются следующие приводы: CD-ROM,
CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW и DVD-RAM. Функция определения типа привода
требует или административных прав, или разрешения доступа к локальным СD-приводам
с помощью политик (для этого надо запустить из командной строки утилиту #secpol.msc#
и установить настройку '#Локальные политики/Параметры безопасности/Устройства:#
#Разрешить доступ к дисководам компакт-дисков только локальным пользователям#'
в значение '#Разрешить#').

 #Alt+Shift+F9# позволяет ~настроить параметры~@PluginsConfig@ плагинов
(работает, если включён показ имён плагинов).

 #Shift+F9# в области плагинов вызывает диалог настройки соответствующего плагина.

 #Shift+F1# в области плагинов показывает соответствующую
плагину контекстно-зависимую подсказку (если у плагина есть файл помощи).

 Символ #A# в крайней левой колонке меню означает, что соответствующий плагин
разработан для Far 1.7x и не поддерживает всех возможностей текущей версии Far (в частности,
символов Unicode в именах файлов и в редакторе).

 См. также:

 Список ~макроклавиш~@KeyMacroDisksList@, доступных в меню выбора диска.
 Клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@ChangeDriveMode
$ #Настройка меню выбора диска#
 Диалог позволяет управлять показом информации в
~меню выбора диска~@DriveDlg@.

 #Показывать тип диска#
 Показать тип диска: “жёсткий”, “сетевой” и т.п.
 Комбинация клавиш в меню: #Ctrl+1#.

 #Показывать метку диска#
 Показать метку диска (если есть).
 Комбинация клавиш в меню: #Ctrl+3#.

 #Использовать имя оболочки#
 Запрашивать имя диска у оболочки Windows.
 Комбинация клавиш в меню: #Ctrl+3# (повторное нажатие).

 #Показывать тип файловой системы#
 Показать тип файловой системы: “NTFS”, “FAT” и т.п.
 Комбинация клавиш в меню: #Ctrl+4#.

 #Показывать размер#
 Показать размер диска и количество свободного места на нём.
 Комбинация клавиш в меню: #Ctrl+5#.

 #Показывать размер в виде десятичной дроби#
 Показать размер диска и количество свободного места в виде
десятичной дроби с не более чем тремя цифрами до запятой. Если эта опция
включена, 1 GiB (2 в степени 30) будет показано как #1.00 Г#, иначе как #1024 М#.
 Комбинация клавиш в меню: #Ctrl+5# (повторное нажатие).

 #Показывать сетевое имя / путь SUBST / имя VHD#
 Показать сетевое имя / путь, ассоциированный с SUBST-диском / имя
файла, содержащего виртуальный диск.
 Комбинация клавиш в меню: #Ctrl+2#.

 #Показывать плагины#
 Показать плагины.
 Комбинация клавиш в меню: #Ctrl+7#.

 #Сортировать плагины по горячей клавише#
 Если эта опция #выключена#, список плагинов сортируется по имени;
иначе по горячей клавише.

 #Показывать параметры сменных дисков#
 Показать параметры сменных дисков.
 Комбинация клавиш в меню: #Ctrl+6#.

 #Показывать параметры компакт-дисков#
 Если опция включена, то Far будет пытаться определить тип
CD-привода: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW, DVD-RAM,
HD DVD-ROM, HD DVD-RW, Blue-ray Disk-ROM, Blue-ray Disk-RW.
 Комбинация клавиш в меню: #Ctrl+8#.

 #Показывать параметры сетевых дисков#
 Показать размеры сетевых дисков и количество свободного места на них.
Формат отображения зависит от опции #Показывать размер#.
 Комбинация клавиш в меню: #Ctrl+9#.

 #Определять виртуальные диски#
 Определять виртуальные диски (VHD, VHDX). Может приводить к пробуждению спящих жёстких дисков.


@DisconnectDrive
$ #Отсоединение сетевого диска#
 Отсоединить сетевой диск можно из ~Меню выбора диска~@DriveDlg@
клавишей #Del#.

 Опция #[x] Восстанавливать при входе в систему# доступна для изменений
только для сетевых дисков, подключённых постоянно.

 Выдачу подтверждения можно отключить в диалоге ~"Подтверждения"~@ConfirmDlg@


@Highlight
$ #Раскраска файлов и группы сортировки#
 Для более удобного и наглядного представления файлов и папок на панелях в
Far Manager предусмотрена возможность цветовыделения файловых объектов.
Файловые объекты можно объединять по разным критериям (~маски файлов~@FileMasks@,
файловые атрибуты) в группы и назначать собственные цвета.

 Раскраску файлов можно включить или отключить в диалоге
~настройки панелей~@PanelSettings@ (пункт "Параметры|Раскраска файлов").

 ~Изменить~@HighlightEdit@ параметры любой группы раскраски можно из меню
"~Параметры~@OptMenu@" (пункт "Раскраска файлов и группы сортировки").


@HighlightList
$ #Раскраска файлов и группы сортировки: клавиши управления#
 Меню ~раскраски файлов и группы сортировки~@Highlight@ позволяет
манипулировать списком. Доступны следующие сочетания клавиш:

 #Ins#          - ^<wrap>Добавить новую группу раскраски

 #F5#           - ^<wrap>Дублировать текущую группу

 #Del#          - Удалить текущую группу

 #Enter# или #F4# - ^<wrap>~Изменить параметры~@HighlightEdit@ текущей группы раскраски

 #Ctrl+R#       - ^<wrap>Восстановить предопределённые группы раскраски файлов.

 #Ctrl+Up#      - ^<wrap>Передвинуть группу вверх.

 #Ctrl+Down#    - ^<wrap>Передвинуть группу вниз.

 Группы раскраски анализируются от начала к концу. Если обнаружено, что файл
принадлежит к какой-либо группе, то принадлежность к остальным группам не проверяется,
unless #[x] Continue processing# is set in the group.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@HighlightEdit
$ #Раскраска файлов и группы сортировки: редактирование#
 Диалог #Редактирование раскраски файлов# в ~Меню параметров~@OptMenu@ позволяет изменить
параметры группы раскраски файлов. Каждое определение группы ~включает~@Filter@:

 - одну или несколько ~масок файлов~@FileMasks@;

 - атрибуты включения и исключения:
   #[x]# - ^<wrap>атрибут включения - файл должен иметь указанный атрибут.
   #[ ]# - ^<wrap>атрибут исключения - файл не должен иметь указанный атрибут.
   #[?]# - ^<wrap>указанный атрибут не влияет на фильтр;

 - ^<wrap>цвета обычного имени, помеченного имени, имени под курсором
и помеченного имени под курсором. Если вы хотите использовать
цвет по умолчанию, установите цвет в "Чёрный на чёрном";

 - ^<wrap>пометкy для обозначения принадлежащих к группе файлов.
Она может быть использована как вместе с цветовым выделением, так и вместо него.

 Файл принадлежит к группе раскраски, если:
 - ^<wrap>включён анализ масок и его имя соответствует хотя бы
одной маске (если анализ масок отключён, то имя файла не
имеет значения);
 - он имеет все атрибуты включения;
 - он не имеет атрибутов исключения.

 Атрибуты "Сжатый", "Зашифрованный", "Неиндексируемый", "Разрежённый",
"Временный", "Точка повторной обработки", "Автономный" используются
только на дисках с файловой системой NTFS. Атрибуты #Поток целостности# и #Нет данных очистки#
поддерживаются только на ReFS томах, начиная с Windows Server 2012.


@ViewerSettings
$ #Настройка программы просмотра#
 В этом диалоге можно изменить параметры внешней и встроенной ~программы просмотра~@Viewer@.

@=
^#Программа просмотра#
@=
 #Запускать внешнюю программу просмотра по F3 вместо Alt+F3#
 Запускать внешнюю программу просмотра по клавише #F3#, а встроенную программу просмотра по комбинации клавиш #Alt+F3#.

 #Команда просмотра#
 Команда для запуска внешней программы просмотра.
Для указания имени просматриваемого файла используйте ~специальные символы~@MetaSymbols@.

@=
^#Встроенная программа просмотра#
@=
 #Постоянное выделение#
 Не удалять пометку блока при перемещении курсора.

 #Размер табуляции#
 Количество пробелов на одну позицию табуляции.

 #Показывать стрелки сдвига#
 Показывать стрелки сдвига по краям окна программы просмотра, если текст не помещается по горизонтали.

 #Показывать '\0'#
 Для символа '\0' показывать печатный символ вместо пробела.
Используемый символ можно задать в ~far:config~@FarConfig@ #Viewer.ZeroChar#.

 #Показывать полосу прокрутки#
 Показывать полосу прокрутки во внутренней программе просмотра. Эту опцию можно также переключать нажатием #Ctrl+S# в окне просмотра.

@=
 #Сохранять позицию файла#
 Сохранять и восстанавливать позицию в недавно просмотренных файлах. Эта опция также сохраненяет
и восстанавливает кодовую страницу (если она была выбрана вручную) и ~режим просмотра~@ViewerMode@.

 #Сохранять кодовую страницу файла#
 Сохранять и восстанавливать выбранную кодировку файла. При включённой опции #Сохранять позицию файла# кодировка
также сохраняется, так как позиция в файле зависит от кодировки.

 #Сохранять закладки#
 Сохранять и восстанавливать закладки в недавно просмотренных файлах. (Закладки можно создать при помощи комбинаций
клавиш #ПравыйCtrl+0…9# или #Ctrl+Shift+0…9#.)

 #Максимальная ширина строки#
 Максимальное число колонок для текстового режима просмотра. Минимум=100, Максимум=100 000, Умолчание=10 000.

 #Сохранять режим просмотра#
 Сохранять и восстанавливать ~режимы просмотра~@ViewerMode@ для недавно просмотренных файлов.

 #Сохранять режим переноса#
 Сохранять и восстанавливать ~режимы~@ViewerMode@ #переноса# и #переноса по словам# для недавно просмотренных файлов.

 #Автовыбор дамп-режима просмотра#
 Если опция включена и Far считает файл бинарным, то при первом просмотре файла автоматически выбирается
~режим~@ViewerMode@ #дамп#. Иначе выбирается режим #текст#.

 #Автоопределение кодовой страницы#
 ~Автоматическое определение~@CodePageAuto@ кодовой страницы просматриваемого файла.

 #Кодовая страница по умолчанию#
 Позволяет выбрать кодовую страницу по умолчанию.

@=
 Если внешняя программа просмотра назначена на клавишу #F3#, она будет запускаться только в том случае,
если ~ассоциированная~@FileAssoc@ программа просмотра для данного типа файлов отсутствует.

 Изменённые настроек не влияют на уже открытые окна встроенной программы просмотра.

 Диалог настройки также можно вызвать из ~программы просмотра~@Viewer@,
нажав #Alt+Shift+F9#. Изменения вступят в силу немедленно, но действовать будут
только на текущий сеанс работы.


@EditorSettings
$ #Настройка редактора#
 В этом диалоге можно изменить используемые по умолчанию параметры внешнего и ~встроенного редакторов~@Editor@.

@=
^#Внешний редактор#
@=
 #Запускать внешний редактор по F4#
 Запускать внешний редактор по #F4# вместо #Alt+F4#.

 #Команда редактирования#
 Команда для запуска внешнего редактора.
Для указания имени просматриваемого файла используйте ~специальные символы~@MetaSymbols@.

@=
^#Встроенный редактор#
@=
 #Не преобразовывать табуляцию#
 При редактировании документа символ #Tab# не преобразовывать в пробелы.

 #Преобразовывать новые символы табуляции в пробелы#
 При редактировании документа нововведённый символ #Tab# заменять на соответствующее
количество пробелов. Остальные символы #Tab# не преобразовывать.

 #Преобразовывать все символы табуляции в пробелы#
 При открытии документа в редакторе все символы #Tab# заменить на соответствующее количество пробелов.

 #Постоянные блоки#
 Не удалять пометку блока при перемещении курсора.

 #Del удаляет блоки#
 Если есть помеченный блок, #Del# будет удалять этот блок, а не символ под курсором.

 #Автоотступ#
 Включает режим автоотступа при вводе текста.

 #Размер табуляции#
 Количество пробелов при показе символа табуляции.

 #Пробельные символы#
 Показать пробельные символы (пробелы, табуляции, переводы строк и возвраты кареток).

 #Курсор за пределами строки#
 Разрешить перемещение курсора за пределы строки.

 #Выделять найденное#
 Найденные последовательности будут выделены.

 #Курсор в конце#
 Установить курсор в конец фрагмента, найденного в результате поиска.

 #Показывать полосу прокрутки#
 Показывать полосу прокрутки

@=
 #Сохранять позицию файла#
 Сохранять и восстанавливать позицию в недавно отредактированных файлах. Эта опция также вызывает сохранение кодовой
страницы, использованной при редактировании файла, если эта страница была выбрана пользователем вручную.

 #Сохранять закладки#
 Сохранять и восстанавливать закладки на текущие позиции в недавно просмотренных
файлах, сохранённых с использованием #ПравыйCtrl+0…9# или #Ctrl+Shift+0…9#.

 #Редактировать открытые для записи файлы#
 Позволяет открывать в редакторе файлы, которые открыты для записи другими программами.
Этот режим удобен, когда нужно получить доступ к открытому в течение долгого времени файлу,
но он может быть опасным, если этот файл модифицируется одновременно с редактированием.

 #Блокировать редактирование файла с атрибутом R/O#
 При открытии на редактирование файла, имеющего атрибут "только для чтения", редактор
также переходит в режим запрета модификации содержимого файла, как если бы нажали #Ctrl+L#.

 #Предупреждать при открытии файла с атрибутом R/O#
 Перед открытием на редактирование файла, имеющего атрибут "только для чтения", будет выдаваться предупреждающее сообщение.

 #Автоопределение кодовой страницы#
 ~Автоматическое~@CodePageAuto@ определение кодовой страницы редактируемого файла.

 #Кодовая страница по умолчанию#
 Выбираем кодовую страницу по умолчанию.

 Если внешний редактор назначен на клавишу #F4#, он будет запускаться только
в том случае, если ~ассоциированный~@FileAssoc@ редактор для данного типа файлов отсутствует.

 Изменённые настройки не влияют на ранее открытые окна встроенного редактора.

 Диалог настройки также можно вызвать из ~редактора~@Editor@, нажав
#Alt+Shift+F9#. Изменения вступят в силу немедленно, но действовать будут
только на текущий сеанс работы.


@CodePageAuto
$ #Автоопределение кодовой страницы#
 Far постарается выбрать правильную кодовую страницу для просмотра/редактирования
файла. Заметьте, что корректное определение не гарантируется, особенно для
маленьких или нетипичных текстовых файлов.

 См. также меню ~кодовых страниц~@CodePagesMenu@ и
~far:config Codepages.NoAutoDetectCP~@Codepages.NoAutoDetectCP@


@FileAttrDlg
$ #Файловые атрибуты#
 Эта команда позволяет изменить атрибуты и время как у отдельных файлов, так
и у групп файлов и папок.

 #Файловые атрибуты#

 Для выделенных объектов (файлов и папок) контрольные переключатели имеют 3 состояния:

 #[x]# - атрибут установлен для всех объектов
       (установить у всех)

 #[ ]# - атрибут сброшен для всех объектов
       (сбросить у всех)

 #[?]# - атрибут не у всех объектов
       (не изменять этот атрибут)

 Если выделенные объекты имеют одинаковые атрибуты, то контрольные
переключатели будут 2-х позиционными - установить/сбросить. Исключение
составляет случай, когда среди выделенных объектов встречаются папки - в этом
случае все контрольные переключатели будут 3-позиционными.

 Если состояние контрольных переключателей на момент исполнения команды
установки атрибутов не изменилось (по сравнению с начальным состоянием), то
указанный атрибут меняться не будет.

 Атрибуты #Сжатый#, #Зашифрованный#, #Неиндексируемый#, #Разрежённый#,
#Временный#, #Автономный#, #Точка повторной обработки# доступны только на дисках с
файловой системой NTFS. Атрибуты #Сжатый# и #Зашифрованный# являются взаимоисключающими,
т.е. можно выставить только один из них. В Windows 2000/XP/2003 выставленный
атрибут #Разрежённый# сбросить нельзя. Атрибуты #Поток целостности# и #Нет данных очистки#
поддерживаются только на ReFS томах, начиная с Windows Server 2012.

 Для ~символических ссылок~@HardSymLink@ в диалоге отображается путь, на
который она ссылается. Если эта информация недоступна, то выводится
сообщение "#(нет данных)#".

 #Дата и время#

 Поддерживаются четыре различных времени файла:
 - время последней записи;
 - время создания файла;
 - время последнего доступа;
 - время изменения.

 Для дисков с файловой системой FAT часы, минуты и секунды времени
последнего доступа всегда равны нулю.

 Если вы не хотите изменять время файла, оставьте соответствующее поле
пустым. Вы можете нажать кнопку #Blank# (Сброс), чтобы очистить все поля с
датами и временем, после чего поменять отдельную составляющую даты и времени,
например только месяц или только минуты. Остальные значения полей остаются
неизменными.

 Кнопка #Current# (Текущее) позволяет заполнить поля времени файла текущим временем.
 Кнопка #Original# (Исходное) заполняет поля времени файла оригинальными
значениями. Доступна для одиночного файлового объекта.

 The #System properties# button invoke the system properties dialog for
selected objects.


@FolderShortcuts
$ #Ссылки на папки#
 Ссылки на папки позволяют обеспечить быстрый доступ к часто используемым
папкам. Для создания ссылки на текущую папку нужно нажать #Ctrl+Shift+0…9#.
После этого, чтобы перейти в папку, записанную в ссылке, достаточно нажать
#ПравыйCtrl+0…9#. Если #ПравыйCtrl+0…9# нажат в строке редактирования, то
путь ссылки будет вставлен в эту строку.

 Пункт #Ссылки на папки# в ~Меню команд~@CmdMenu@ позволяет просматривать,
устанавливать, редактировать и удалять ссылки на папки.

 В режиме редактирования (#F4#) вы не можете сделать ссылку на плагиновую
панель.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@FiltersMenu
$ #Меню фильтров#
 С помощью #Меню фильтров# вы можете определить набор типов файлов, с
заданным вами параметрами, при соблюдении которых файл будет обработан
использующей его операцией.

 Меню состоит из двух частей. В верхней части расположены #Фильтры#
#пользователя#, в нижней части меню находятся маски всех файлов, содержащихся в
данный момент в текущей панели файлов (а также маски файлов выбранные в
текущей области меню даже если файлов подходящим к этим маскам нет в текущей
панели).

 Для #Фильтра пользователя# доступны следующие клавиши:

 #Ins#        Создать новый фильтр, откроется пустой диалог для
            задания параметров ~фильтра~@Filter@.

 #F4#         Изменить существующий ~фильтр~@Filter@.

 #F5#         Копировать ~фильтр~@Filter@.

 #Del#        Удалить фильтр.

 #Ctrl+Up#    Переместить фильтр на одну позицию вверх.

 #Ctrl+Down#  Переместить фильтр на одну позицию вниз.

 Управление, как #Фильтрами пользователя#, так и автоматически
сгенерированными фильтрами (маски файлов), осуществляется следующими клавишами:

 #Space#,              Элементы, выбранные с помощью #Space# или ‹#+#›,
 #Plus#                помечаются символом ‹+›. Если такие элементы
                     присутствуют, то будут обработаны только
                     удовлетворяющие им файлы.

 #Minus#               Элементы, выбранные с помощью клавиши ‹#-#›,
                     помечаются символом ‹-›, и все удовлетворяющие
                     им файлы не будут обработаны.

 #I# и #X#               Подобны #Plus# и #Minus#, но имеют более
                     высокий приоритет при фильтрации.

 #Backspace#           Снять пометку с выбранного объекта.

 #Shift+Backspace#     Снять пометку со всех выбранных объектов.

 Пометка фильтров сохраняется в конфигурации.

 Когда фильтр используется в панели, это индицируется символом ‹*› после
буквы режима сортировки в верхнем левом углу панели.

 Меню фильтров используется в следующих областях:
 - ~Панель файлов~@FilePanel@;
 - ~Копирование, перенос, переименование и создание ссылок~@CopyFiles@;
 - ~Поиск файла~@FindFile@.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@FolderDiz
$ #Описания папок#
 Имена или ~маски файлов~@FileMasks@, отображаемых в ~панели информации~@InfoPanel@
в качестве описания папки.


@FileDiz
$ #Описания файлов#
 Описания могут быть использованы для того, чтобы связать с файлом текстовую
информацию. Описания файлов текущей папки хранятся в этой папке в специальном
файле - списке описаний. В нём в начале каждой строки содержится имя
описываемого файла, и отделённый от него пробелами текст описания.

 Описания можно посмотреть в соответствующих ~режимах просмотра~@PanelViewModes@
панели файлов. По умолчанию этими режимами являются #Описания# и #Длинные описания#.

 Команда #Описание файлов# (#Ctrl+Z#) из ~Меню файлов~@FilesMenu@
предназначена для добавления описаний к выбранным файлам.

 Имена списков описаний могут быть изменены в диалоге #Описания файлов# из
меню ~Меню параметров~@OptMenu@. В этом диалоге также можно установить режим
обновления локальных описаний. Обновление может быть запрещено совсем,
разрешено, только если текущий режим просмотра файловой панели показывает
описания, или разрешено всегда. По умолчанию Far устанавливает атрибут "Hidden"
на созданные списки описаний, но вы можете это запретить, выключив опцию
"Устанавливать атрибут "Hidden" на новые списки описаний" в этом же диалоге.
Также здесь вы можете указать позицию для выравнивания новых описаний в списке описаний.

 Если файл с описаниями имеет атрибут "Только для чтения", то Far не
обновляет описания и, после операций переименования/удаления файловых объектов,
будет выведено сообщение об ошибке. При включённой опции #Обновлять файл#
#описаний с атрибутом "Только для чтения"# Far попытается корректно обновить описания.

 Если это разрешено в конфигурации, Far обновляет описания файлов при
копировании, переносе и удалении файлов. Но если команда обрабатывает и часть
файлов во вложенных папках, то для этих файлов описания не обновляются.

 #Использовать кодовую страницу ANSI по умолчанию#
 By default Far uses the OEM codepage for file descriptions, both for reading and writing.
This option changes it to ANSI.

 #Сохранять в UTF-8#
 If set, the description file will be read as OEM or ANSI, depending on the option above,
but saved in UTF-8 after you add, remove or update the descriptions.

 #Note#: these options are irrelevant when the file has the UTF-8 signature. In this case it is always read and written in UTF-8.


@PanelViewModes
$ #Настройка режимов просмотра панели файлов#
 ~Панель файлов~@FilePanel@ может выводить информацию, используя 10 заданных
заранее режимов: краткий, средний, полный, широкий, детальный, описания,
длинные описания, владельцы файлов, ссылки файлов, альтернативный полный. Обычно
этого достаточно, но, тем не менее, при желании можно изменить параметры этих
режимов или даже полностью заменить их на новые.

 Команда #Режимы панели файлов# из меню ~Меню параметров~@OptMenu@ позволяет
изменить параметры режимов просмотра. Сначала она предлагает выбрать требуемый
режим из списка. В этом списке режим 0 соответствует режиму просмотра,
вызываемому по #ЛевыйCtrl+0# (альтернативный полный), режим 1 соответствует
краткому режиму (#ЛевыйCtrl+1#), режим 2 соответствует среднему режиму
(#ЛевыйCtrl+2#) и так далее. После выбора режима появляется диалог, в котором
можно изменить следующие параметры:

 - #Типы колонок# - список, разделённый запятыми. Тип колонки начинается
со свойства файла (например, имя или размер), обозначенного одной
буквой. За некоторыми свойствами могут следовать модификаторы.
Допустимые типы колонок (свойства и их модификаторы) перечислены ниже.

 Если список типов колонок состоит из нескольких повторяющихся групп,
файлы на панели будут организованы в «полосы». Свойства каждого файла
будут показаны в колонках одной полосы, а список файлов будет
продолжаться с полосы на полосу, как текст в газетной статье. Если
список типов колонок невозможно разбить на одинаковые группы, список
файлов будет показан в одной полосе.

 Допускаются следующие типы колонок:

 N[M[D],O,R[F],N] - имя файла, где:
                    M - ^<wrap>показывать символы пометки где:
                        D - динамические символы пометки;
                    O - ^<wrap>показывать имена без путей (предназначено в основном для ~плагинов~@Plugins@);
                    R - ^<wrap>выравнивать не умещающиеся имена по правому краю, где:
                        F - выравнивать все имена по правому краю;
                    N - ^<wrap>не отображать расширения файлов;

 Эти символы можно комбинировать, например NMR.

 X[R]       - расширение файла, где:
              R - ^<wrap>выравнивать по правому краю;

 S[C,T,F,E] - размер файла
 P[C,T,F,E] - выделенный размер файла
 G[C,T,F,E] - размер потоков файла, где:
              C - ^<wrap>группировать цифры, используя символ из настроек Windows;
              T - ^<wrap>использовать десятичные единицы вместо
двоичных, т.е., чтобы вычислить килобайты, размер будет делиться
на 1000, а не на 1024; в этом режиме символ единиц показывается
строчными буквами, например, #к#, #м#, #г# вместо #К#, #М#, #Г#;
              F - ^<wrap>показывать размер в виде десятичной
дроби с не более чем тремя цифрами до запятой, например, 999 байт будут
показаны как #999#, а 1024 байт как #1.00 К#; заметьте, что поведение
зависит от наличия модификатора #T#;
              E - ^<wrap>экономичный режим, не показывать пробел
между размером и символом единиц, например, #1.00к#;

 D          - дата последней записи в файл;
 T          - время последней записи в файл;

 DM[B,M]    - дата и время последней записи в файл;
 DC[B,M]    - дата и время создания файла;
 DA[B,M]    - дата и время последнего доступа к файлу;
 DE[B,M]    - дата и время изменения файла, где:
              B - краткий (Unix-стиль) формат времени файла;
              M - использование текстовых имён месяцев;

 A          - атрибуты файла;
 Z          - описание файла;

 O[L]       - владелец файла, где:
              L - отображать также имя домена;

 LN         - количество жёстких ссылок;

 F          - количество потоков.

 Если описание типов колонок содержит более одной колонки имени
файла, панель файлов будет отображаться в многоколоночной форме.

 Атрибуты файла имеют следующие обозначения:

 #N# - Аттрибуты не установлены
 #R# - Только для чтения
 #H# - Скрытый
 #S# - Системный
 #D# - Каталог
 #A# - Архивный
 #T# - Временный
 #$# - Разрежённый
 #L# - Точка повторной обработки
 #C# - Сжатый
 #O# - Автономный
 #I# - Неиндексируемый
 #E# - Зашифрованный
 #V# - Поток целостности
 #?# - Виртуальный
 #X# - Нет данных очистки
 #P# - Закреплённый
 #U# - Откреплённый

 По умолчанию размер колонки атрибутов - 6 символов. Для отображения
дополнительных атрибутов необходимо увеличить размер колонки.

 #Ширина колонок# - позволяет изменить ширину колонок панели.
Если ширина равна 0, то используется значение по умолчанию.
Если ширина колонки с именем, описанием или владельцем равна 0,
она будет подсчитана автоматически, в зависимости от ширины панели.
Для правильной работы с различной шириной экрана настоятельно
рекомендуется, чтобы в каждом режиме просмотра была хотя бы одна
колонка с автоматически вычисляемой шириной.
Ширину колонки также можно задать в процентах от свободного места
оставшегося после колонок с фиксированной шириной, для этого после
числового значения необходимо дописать знак %. Если суммарный размер
таких колонок больше 100%, то их размеры соответственно масштабируются.

 Для использования 12-часового формата времени надо увеличить
на единицу стандартную ширину колонки времени файла или колонки
времени и даты файла. После дальнейшего увеличения в этих колонках
также будут показаны секунды и миллисекунды.

 Для показа года в 4-х символьном формате нужно увеличить ширину колонки даты на 2.

 При указании колонок, отвечающих за показ ссылок, потоков и владельцев (G, LN, F и O) время
отображения содержимого каталога увеличивается.

 #Типы колонок строки статуса# и #Ширина колонок строки статуса# -
аналогично "Типам колонок" и "Ширине колонок", но для строки статуса
панели.

 #Полноэкранный режим# - показывать панель во весь экран вместо
половины экрана.

 #Выравнивать расширения файлов# - показывать расширения файлов
выровненными.

 #Выравнивать расширения папок# - показывать расширения папок
выровненными.

 #Показывать папки заглавными буквами# - показывать все имена папок
в верхнем регистре, вне зависимости от реального регистра.

 #Показывать файлы строчными буквами# - показывать все имена файлов
в нижнем регистре, вне зависимости от реального регистра.

 #Показывать имена файлов из заглавных букв строчными буквами# -
показывать все имена файлов, которые содержат только заглавные буквы,
строчными буквами. По умолчанию эта опция включена, но если вы хотите
всегда видеть настоящий регистр имени файла, выключите её, а также
#Показывать папки заглавными буквами# и #Показывать файлы строчными буквами#.
Все эти параметры влияют только на способ показа файлов, для их обработки
Far всегда использует настоящий регистр.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@ColorGroups
$ #Color groups#
 Это меню позволяет измененить цвета различных элементов интерфейса или всей палитры цветов на предлагаемую по умолчанию.

 #Set default colors#
 Set the colors to default values, expressed as indices in the console palette.

 #Set default colors (RGB)#
 Set the colors to default values, expressed as colors in RGB space, normally used for the corresponding console palette indices.
 Unlike the indices in the console palette, the RGB values are device-independent and will look the same in any terminal.
 For example, the default #index# value of panels background is #1#, which is usually, but not necessarily, mapped to some unspecified shade of blue.
 The default #RGB# value of panels background, on the contrary, is always exactly #000080#.

 #Note#: RGB colors require Virtual Terminal-based rendering, which can be enabled in ~Interface settings~@InterfSettings@.
If it is not enabled or if your terminal does not support RGB colors, they will be approximated to the closest console palette indices.

 This is the current palette:

 \00  \10  \20  \30  \40  \50  \60  \70  \-
 \80  \90  \A0  \B0  \C0  \D0  \E0  \F0  \-

 This is the default RGB representation:

 \(T0:T000000)  \(T0:T000080)  \(T0:T008000)  \(T0:T008080)  \(T0:T800000)  \(T0:T800080)  \(T0:T808000)  \(T0:TC0C0C0)  \-
 \(T0:T808080)  \(T0:T0000FF)  \(T0:T00FF00)  \(T0:T00FFFF)  \(T0:TFF0000)  \(T0:TFF00FF)  \(T0:TFFFF00)  \(T0:TFFFFFF)  \-


@ColorPicker
$ #Color Picker#
 This dialog allows to define a foreground color, a background color and a text style.

 The foreground and the background colors can be either:
 - one of the 16 colors from the standard Windows Console pallete,
 - one of the 256 colors from the Xterm pallette, or
 - one of the 16 million colors from the RGB color space.

 The standard 16-color palette is available in the dialog.
 To access the ~256-color palette~@ColorPicker256@ and the ~RGB color space~@ColorPickerRGB@ use the corresponding buttons.

 #Default# is the color used by your terminal when no colors are specified explicitly, e.g. \(800000:800000) C:\> \-.
 Usually it is one of the palette colors, e.g. \(7:0)silver on black\-, but not necessarily: some terminals could handle it differently, e.g. render as translucent.

 The color value is also represented in the hexadecimal form for convenience, where:
 - #AA______# - the alpha channel, representing the degree of transparency from fully transparent (00) to fully opaque (FF).
 - #______##### - the palette index from 00 to FF.
 - #__RRGGBB# - the red, green and blue channels in the RGB color space, from 00 to FF each.

 When the color is not fully opaque, the previous color in the logical Z-order is taken into account.

 The foreground text style can include ANSI/VT100-like attributes listed in the right section.
 When #Inherit# is checked, the previous foreground text style in the logical Z-order is taken into account.

 Default:   \(7:0) Example \-
 Bold:      \(7:0:bold) Example \-
 Italic:    \(7:0:italic) Example \-
 Overline:  \(7:0:overline) Example \-
 Strikeout: \(7:0:strikeout) Example \-
 Faint:     \(7:0:faint) Example \-
 Blink:     \(7:0:blink) Example \-
 Inverse:   \(7:0:inverse) Example \-
 Invisible: \(7:0:invisible) Example \-
 Underline:
   Single:  \(7:0:underline) Example \-
   Double:  \(7:0:underline_double) Example \-
   Curly:   \(7:0:underline_curly) Example \-
   Dotted:  \(7:0:underline_dot) Example \-
   Dashed:  \(7:0:underline_dash) Example \-

 The preview section below displays the final result.

 #Attention#
 Only the standard 16-color palette is guaranteed to work everywhere.
 Support for everything else is conditional and defined by your terminal.

 Extended colors and styles require Virtual Terminal-based rendering, which can be enabled in ~Interface settings~@InterfSettings@.
You can find more about it ~here~@https://docs.microsoft.com/en-us/windows/console/classic-vs-vt@.


@ColorPicker256
$ #256 Color Picker#
 This dialog allows to pick a color from the 256-color Xterm pallette.

 The first 16 colors are the same as the standard palette and are available in the ~main dialog~@ColorPicker@.

 \00  \10  \20  \30  \40  \50  \60  \70  \-
 \80  \90  \A0  \B0  \C0  \D0  \E0  \F0  \-

 The next 216 colors are represented as a 6x6x6 cube. The palette usually has 6 levels for every primary color and forms a homogeneous RGB cube.
 Use the buttons on the right to rotate the cube, access its inner levels or mix the primary colors directly.

 \(:10)  \(:11)  \(:12)  \(:13)  \(:14)  \(:15)  \-  \(:34)  \(:35)  \(:36)  \(:37)  \(:38)  \(:39)  \-  \(:58)  \(:59)  \(:5A)  \(:5B)  \(:5C)  \(:5D)  \-
 \(:16)  \(:17)  \(:18)  \(:19)  \(:1A)  \(:1B)  \-  \(:3A)  \(:3B)  \(:3C)  \(:3D)  \(:3E)  \(:3F)  \-  \(:5E)  \(:5F)  \(:60)  \(:61)  \(:62)  \(:63)  \-
 \(:1C)  \(:1D)  \(:1E)  \(:1F)  \(:20)  \(:21)  \-  \(:40)  \(:41)  \(:42)  \(:43)  \(:44)  \(:45)  \-  \(:64)  \(:65)  \(:66)  \(:67)  \(:68)  \(:69)  \-
 \(:22)  \(:23)  \(:24)  \(:25)  \(:26)  \(:27)  \-  \(:46)  \(:47)  \(:48)  \(:49)  \(:4A)  \(:4B)  \-  \(:6A)  \(:6B)  \(:6C)  \(:6D)  \(:6E)  \(:6F)  \-
 \(:28)  \(:29)  \(:2A)  \(:2B)  \(:2C)  \(:2D)  \-  \(:4C)  \(:4D)  \(:4E)  \(:4F)  \(:50)  \(:51)  \-  \(:70)  \(:71)  \(:72)  \(:73)  \(:74)  \(:75)  \-
 \(:2E)  \(:2F)  \(:30)  \(:31)  \(:32)  \(:33)  \-  \(:52)  \(:53)  \(:54)  \(:55)  \(:56)  \(:57)  \-  \(:76)  \(:77)  \(:78)  \(:79)  \(:7A)  \(:7B)  \-

 \(:7C)  \(:7D)  \(:7E)  \(:7F)  \(:80)  \(:81)  \-  \(:A0)  \(:A1)  \(:A2)  \(:A3)  \(:A4)  \(:A5)  \-  \(:C4)  \(:C5)  \(:C6)  \(:C7)  \(:C8)  \(:C9)  \-
 \(:82)  \(:83)  \(:84)  \(:85)  \(:86)  \(:87)  \-  \(:A6)  \(:A7)  \(:A8)  \(:A9)  \(:AA)  \(:AB)  \-  \(:CA)  \(:CB)  \(:CC)  \(:CD)  \(:CE)  \(:CF)  \-
 \(:88)  \(:89)  \(:8A)  \(:8B)  \(:8C)  \(:8D)  \-  \(:AC)  \(:AD)  \(:AE)  \(:AF)  \(:B0)  \(:B1)  \-  \(:D0)  \(:D1)  \(:D2)  \(:D3)  \(:D4)  \(:D5)  \-
 \(:8E)  \(:8F)  \(:90)  \(:91)  \(:92)  \(:93)  \-  \(:B2)  \(:B3)  \(:B4)  \(:B5)  \(:B6)  \(:B7)  \-  \(:D6)  \(:D7)  \(:D8)  \(:D9)  \(:DA)  \(:DB)  \-
 \(:94)  \(:95)  \(:96)  \(:97)  \(:98)  \(:99)  \-  \(:B8)  \(:B9)  \(:BA)  \(:BB)  \(:BC)  \(:BD)  \-  \(:DC)  \(:DD)  \(:DE)  \(:DF)  \(:E0)  \(:E1)  \-
 \(:9A)  \(:9B)  \(:9C)  \(:9D)  \(:9E)  \(:9F)  \-  \(:BE)  \(:BF)  \(:C0)  \(:C1)  \(:C2)  \(:C3)  \-  \(:E2)  \(:E3)  \(:E4)  \(:E5)  \(:E6)  \(:E7)  \-

 The last 24 colors are usually defined as a grayscale ramp.

 \(:E8)  \(:E9)  \(:EA)  \(:EB)  \(:EC)  \(:ED)  \(:EE)  \(:EF)  \(:F0)  \(:F1)  \(:F2)  \(:F3)  \(:F4)  \(:F5)  \(:F6)  \(:F7)  \(:F8)  \(:F9)  \(:FA)  \(:FB)  \(:FC)  \(:FD)  \(:FE)  \(:FF)  \-


@ColorPickerRGB
$ #RGB Color Picker#
 This dialog allows to pick a color from the RGB color space.

 The 16 777 216 RGB colors are represented as a 16x16x16 hypercube.

 Use the buttons on the right to rotate the cube, access its inner levels or mix the primary colors directly.

 Each of the 4096 cells in the hypercube represents a 16x16x16 cube with RGB colors. To switch between the cubes use the #↔# button.

 The #«# button allows to save the selected color to the custom palette for quick access.

 The #System# button opens the system RGB color picker.


@SortGroups
$ #Группы сортировки#
 Группы сортировки могут применяться в ~панели файлов~@FilePanel@ совместно
с сортировкой #по имени# или #по расширению#. Они активизируются при нажатии
#Shift+F11# и позволяют задать правила сортировки файлов, дополняющие уже
действующие.

 Каждая группа сортировки состоит из одной или нескольких разделённых
запятыми ~масок файлов~@FileMasks@. Если позиция одной группы сортировки в
общем списке групп выше, чем у другой группы, то при сортировке по возрастанию
все принадлежащие к этой группе файлы будут выше, чем принадлежащие к другой
группе.

 Команда #Группы сортировки# из ~Меню команд~@CmdMenu@ позволяет удалять,
создавать и редактировать группы сортировки, используя клавиши #Del#, #Ins# и
#F4#. Группы, находящиеся выше разделителя меню, относятся к началу файловой
панели, и все файлы, попавшие в эти группы, будут расположены выше не попавших
в них файлов. Группы, находящиеся ниже разделителя меню, относятся к концу
файловой панели, и все файлы, попавшие в эти группы, будут расположены ниже не
попавших в них файлов.


@FileMasks
$ #Маски файлов#
 Маски файлов часто используются в командах Far для выбора отдельных файлов
и папок или их групп. Маски могут включать обычные допустимые в именах файлов
символы, ‹*› и ‹?›, а также специальные выражения:

 #*#           любое количество символов (в т.ч. ни одного);

 #?#           любой символ;

 #[cx-z]#     любой символ из находящихся в квадратных скобках.
             Допускаются и отдельные символы, и их диапазоны.

 Например, файлы ftp.exe, fc.exe и f.ext могут быть выбраны с помощью маски
f*.ex?, маска *co* выберет и color.ini, и edit.com, маска [c-ft]*.txt может
выбрать config.txt, demo.txt, faq.txt и tips.txt.

 Во многих командах Far можно задать несколько разделённых запятыми или
точкой с запятой масок. Например, чтобы выбрать все документы, вы можете ввести
*.doc,*.txt,*.wri в команде "Пометить группу".

 Допускается заключать любую из масок (но не весь список) в двойные кавычки.
Например, это нужно делать, когда маска содержит один из символов-разделителей
(запятую или точку с запятой), чтобы такая маска не была спутана со списком.

 В масках можно использовать ~регулярные выражения~@RegExp@, при этом текст
регулярного выражения должен быть окружён символами #/#.

 Пример:
 #/(eng|rus)/i#  файлы, имена которых содержат строки “eng” или “rus”,
регистр символов не учитывается.

 #Маска исключения# - одна или несколько масок файлов, которой не должны
соответствовать имена требуемых файлов, она отделяется от основной маски символом ‹#|#›.

 Примеры использования масок исключения:

 1. *.cpp
    Все файлы с расширением cpp.
 2. *.*|*.bak,*.tmp
    Все файлы, кроме файлов с расширением bak и tmp.
 3. *.*|
    Введён разделитель |, но сама маска исключения не указана,
    выражение трактуется как *.*
 4. *.*|*.bak|*.tmp
    Разделитель | может быть использован только один раз,
    выражение трактуется как *.*|*.bak
 5. |*.bak
    Обрабатывается как *|*.bak
 6. *.*|/^pict\d{1,3}\.gif$/i
    Все файлы, кроме pict0.gif — pict999.gif, независимо от регистра символов.

 Через запятую (или точку с запятой) перечисляются маски файлов, а при
помощи ‹|› маски-включения отделяются от масок-исключения.

 Маски файлов могут быть объединены в ~группы~@MaskGroupsSettings@.


@SelectFiles
$ #Пометка файлов#
 Элементы ~панели файлов~@FilePanel@ (файлы и папки) могут быть
помечены для групповой обработки. Если ни один элемент не помечен,
то будет обработан только элемент под курсором.

 #Пометка с клавиатуры#

 #Ins# переключает пометку на элементе под курсором и сдвигает курсор
вниз.

 #Shift+Клавиши управления курсором# перемещают курсор, помечая
элементы или снимая пометку. Действие (пометка или снятие пометки)
зависит от состояния элемента под курсором до нажатия комбинации клавиш.

 #Gray +# помечает элементы, а #Gray -# снимает пометку
с использованием одной или нескольких ~масок файлов~@FileMasks@. #†#

 #Gray *# инвертирует текущую пометку. #†#

 #Ctrl+<Gray +># помечает элементы, а #Ctrl+<Gray -># снимает пометку
с элементов с тем же #расширением#, что и у элемента под курсором. #†#

 #Alt+<Gray +># помечает элементы, а #Alt+<Gray -># снимает пометку
с элементов с тем же #именем#, что и у элемента под курсором. #†#

 #Shift+<Gray +># помечает все элементы, а #Shift+<Gray -># снимает
пометку со всех элементов. #†#

 #Ctrl+<Gray *># инвертирует текущую пометку на всех элементах,
включая папки.

 #Alt+<Gray *># инвертирует текущую пометку только на файлах,
снимает пометку с папок.

 #Ctrl+M# восстанавливает предыдущую пометку.

 #Пометка мышью#

 #Щелчок правой кнопкой мыши# переключает пометку на элементе,
по которому щёлкнули, и перемещает на него курсор. См. также параметр
#Правый клик помечает файлы# в диалоге ~Настроек панели~@PanelSettings@.

 #Щелчок и удерживание правой кнопкой мыши# на #строке статуса# или
#заголовках колонок# перемещает курсор соответственно вперёд или назад,
помечая элементы или снимая пометку. Действие (пометка или снятие
пометки) зависит от состояния элемента под курсором до нажатия кнопки
мыши.

 ────────────────
 #†# Если параметр #Пометка папок# в диалоге
~Настроек панели~@PanelSettings@ выключен, пометка ставится или
снимается только на файлах. Иначе, пометка меняется также и на папках.


@CopyFiles
$ #Копирование, перенос, переименование и создание связей и ссылок#
 Следующие команды могут быть использованы для копирования, переноса и
переименования файлов и папок:

 Копировать ~выбранные~@SelectFiles@ файлы                                    #F5#

 Копировать файл под курсором вне зависимости            #Shift+F5#
 от пометки

 Переименовать или перенести выбранные файлы                   #F6#

 Переименовать или перенести файл под курсором           #Shift+F6#
 вне зависимости от пометки

 Создание ~ссылок~@HardSymLink@ файлов и папок                            #Alt+F6#

 Для папки: если папка по указанному целевому пути (относительному
или абсолютному) существует, то исходная папка будет скопирована
/ перемещена в целевую папку; иначе новая папка будет создана
по целевому пути, и содержимое исходной папки будет скопировано
/ перемещено во вновь созданную папку.

 Например, при перемещении #c:\folder1\# в #d:\folder2\#:

 - ^<wrap>если #d:\folder2\# существует, то содержимое #c:\folder1\# будет перемещено
в #d:\folder2\folder1\#, в противном случае содержимое #c:\folder1\# будет перемещено во
вновь созданную папку #d:\folder2\#.

 Если включена опция «#Обрабатывать несколько имён файлов#», то в строке
ввода можно указать несколько путей для копирования или перемещения. Пути
должны быть разделены символом-разделителем «#;#» или «#,#». Если путь
содержит эти символы, заключите его в двойные кавычки.

 Если вы хотите создать папку назначения перед копированием,
добавьте к её имени обратную черту.

 Если ~far:config~@FarConfig@ параметр
~Panel.Tree.TurnOffCompletely~@Panel.Tree.TurnOffCompletely@ установлен
в значение «false», то для того чтобы выбрать целевой путь, вы можете
использовать диалог ~поиска папки~@FindFolder@. Следующие горячие
клавиши открывают диалог с разными выбранными папками:
 - ^<wrap>#F10# выбирает папку из активной панели.
 - ^<wrap>#Alt+F10# выбирает папку из пассивной панели.
 - ^<wrap>#Shift+F10# выбирает заданную целевую папку. Если в строке
ввода указано несколько папок, используется первая из них.

 Если включена опция «#Обрабатывать несколько имён файлов#», то
выбранная папка добавляется к содержимому строки ввода.

 Работает ли копирование, перенос или переименование файлов для плагина
зависит от функциональности конкретного плагина.

 Параметр #Права доступа# используется только для файловой системы
NTFS и управляет тем, как устанавливаются права доступа к создаваемым
файлам и папкам. Опция #По умолчанию# оставляет обработку прав доступа
операционной системе. Опция #Копировать# применяет права доступа исходных
объектов. Опция #Наследовать# применяет наследуемые права родительской
папки.

 Параметр «#Уже существующие файлы#» определяет поведение Far для случая,
когда одноимённый файл уже существует в папке-приёмнике.

 Возможные значения:
 - ^<wrap>#Запрос действия# - будет отображён ~диалог~@CopyAskOverwrite@ с запросом;
 - #Вместо# - все существующие файлы будут заменены копируемыми;
 - #Пропустить# - существующие файлы останутся без изменений;
 - #Имя# - существующие файлы останутся без изменений,
копируемым будут присвоены другие имена;
 - #Дописать# - копируемые файлы будут дописаны в конец существующих;
 - #Только новые/обновлённые файлы# - копировать только файлы с более
новыми датой и временем записи;
 - #Запрос подтверждения для R/O файлов# - определяет, нужно ли
дополнительное подтверждение для файлов с установленным атрибутом "только
для чтения".

 Параметр «#Использовать системную функцию копирования#» из диалога
~Системные параметры~@SystemSettings@ включает использование функции
CopyFileEx операционной системы Windows. Это может быть полезно на NTFS, так как CopyFileEx
копирует расширенные атрибуты файлов. Если этот параметр выключен, используется внутренняя
реализация функции копирования файлов. Внутренняя функция используется
также, когда исходный файл зашифрован и производится копирование
на другой том.

 Параметр «#Копировать содержимое символических ссылок#» управляет
~логикой~@CopyRule@ работы с ~символическими ссылками~@HardSymLink@.

 При переносе файлов для определения того, должна ли операция осуществляться
как копирование с последующим удалением или как прямой перенос (в пределах
одного физического диска), Far учитывает ~символические ссылки~@HardSymLink@.

 Far обрабатывает попытку копирования в #con# так же, как и копирование в
#nul# или в #\\\\.\\nul# - то есть, файл читается с диска, но никуда не
записывается.

 При перемещении в #nul#, #\\\\.\\nul# или #con# файлы не удаляются
с диска.

 Состояние параметров «#Права доступа#» и «#Только новые/обновлённые файлы#»
действуют только на текущий сеанс копирования.

 Для копирования файлов, соответствующих определённым критериям, включите
переключатель #Использовать фильтр# и нажмите кнопку #Фильтр#, чтобы
открыть параметры ~фильтра~@FiltersMenu@. Учтите, что если вы копируете
каталог, в котором ни один из файлов не соответствует критериям фильтра,
то пустая папка в месте назначения создана #не# будет.


@CopyAskOverwrite
$ #Копирование: запрос действия#
 Если одноимённый файл уже существует в папке-приёмнике, Far предложит на выбор
несколько возможных действий:

 #Вместо# - существующий файл будет заменён копируемым;

 #Пропустить# - существующий файл останется без изменений;

 #Имя# - существующие файлы останутся без изменений, копируемым будут присвоены другие имена;

 #Дописать# - копируемый файл будет дописан в конец существующего.

 Если отмечен переключатель #Запомнить выбор#, выбранное действие будет
использовано для всех существующих файлов в текущем сеансе копирования
и повторные запросы появляться не будут.

 Если для принятия решения вам недостаточно информации о размере и дате последней
записи файлов, вы также можете сравнить их содержимое при помощи встроенной программы просмотра,
установив курсор на один из файлов в диалоге и нажав F3.


@CopyRule
$ #Копирование: правила#
 При ~копировании/перемещении~@CopyFiles@ папок и
~символических ссылок~@HardSymLink@ соблюдаются следующие правила.

 #Копирование символической ссылки#

 Если включена опция "Копировать содержимое символических ссылок"
или источник или приёмник - сетевые диски, то в приёмнике
создаётся папка и в неё копируется содержимое ссылки-источника
(для вложенных ссылок рекурсивно).

 Если опция "Копировать содержимое символических ссылок" выключена,
и источник и приёмник - локальные диски, то в приёмнике создаётся
связь или символическая ссылка, в зависимости от типа источника.

 #Перемещение символической ссылки#

 Если включена опция "Копировать содержимое символических ссылок"
или источник или приёмник - сетевые диски, то в приёмнике
создаётся папка и в неё копируется содержимое ссылки-источника
(для вложенных ссылок рекурсивно). Сама ссылка в источнике удаляется.

 Если опция "Копировать содержимое символических ссылок" выключена,
и источник и приёмник - локальные диски, то ссылка-источник просто
переносится. Рекурсивный спуск по дереву не производится.

 #Перемещение каталога, содержащего символические ссылки#

 Если источник и приёмник - локальные диски, то каталог просто
перемещается.

 Если источник или приёмник - сетевые диски, то независимо от
состояния опции "Копировать содержимое символических ссылок"
в приёмнике создаётся папка и в неё копируется содержимое
ссылки-источника (для вложенных ссылок рекурсивно).
Сама ссылка в источнике удаляется.


@HardSymLink
$ #Жёсткие ссылки, связи папок, символические ссылки#
 На разделах NTFS можно создавать #жёсткие ссылки# (hard links) для файлов,
#связи папок# (directory junctions) для папок и #символические ссылки# (symbolic links) для файлов и
папок с помощью команды #Alt+F6#.

 #Жёсткие ссылки#

 Жёсткая ссылка (hard link) - это просто ещё одна запись в папке для данного
файла. Когда создаётся жёсткая ссылка, сам файл не копируется физически, а только
появляется под ещё одним именем в ещё одном месте, а его старые имя и
местонахождение остаются нетронутыми. С этого момента жёсткая ссылка
#неотличима# от первоначальной записи в папке. Единственное отличие - то, что
для жёсткой ссылки не генерируется короткое имя файла, поэтому из ДОС-программ она
не видна.

 Когда меняется размер или дата файла, все соответствующие записи в папках
обновляются автоматически. При удалении файла он не удаляется физически до тех
пор, пока все жёсткие ссылки, указывающие на него, не будут удалены. Порядок их
удаления значения не имеет. При удалении жёсткой ссылки в корзину количество
ссылок у файла сохраняется.

 Far умеет создавать жёсткие ссылки, отображать их количество для каждого
файла в отдельной колонке (по умолчанию это последняя колонка в 9-м режиме
панелей), а также сортировать файлы по количеству жёстких ссылок.

 Создавать жёсткие ссылки можно только на том же разделе, на котором расположен исходный файл.

 #Связи папок#

 Связи позволяют обращаться к локальным папкам как к любым другим локальным папкам.
Например, если папка D:\\JUNCTION является связью, указывающей на C:\\WINNT\\SYSTEM32
то программа, обращающаяся к D:\\JUNCTION\\DRIVERS, будет на самом деле обращаться к
C:\\WINNT\\SYSTEM32\\DRIVERS.

 Связь не может указывать на сетевую папку.

 В Windows 2000 нельзя напрямую создать связь, ссылающуюся на папку на CD-ROM,
но это ограничение можно обойти, смонтировав CD-ROM на папку NTFS-раздела.

 #Символические ссылки#

 Символические ссылки (symbolic links) на NTFS поддерживаются, начиная с Windows Vista
(NT 6.0). Они представляют собой улучшенный вариант связей каталогов - символические
ссылки могут указывать как на папки, так и на файлы, как на локальные, так и на сетевые,
при этом поддерживаются относительные пути.

 Создавать символические ссылки по умолчанию могут только члены группы "Администраторы",
это поведение можно изменить в локальных настройках безопасности.


@ErrCopyItSelf
$ #Ошибка: копирование/перенос "в самого себя"#
    Вы не можете копировать/переносить файл или папку "в самого себя".

 Данная ошибка также возникает, если имеются две папки, одна из которых
является ~символической ссылкой~@HardSymLink@ на другую.


@WarnCopyEncrypt
$ #Предупреждение: Потеря шифрования файла#
 Исходный файл зашифрован. Копирование или перемещение его за пределы
исходного диска возможно, если в месте назначения файл будет расшифрован.

 Кнопки "Игнорировать" (или "Игнорировать все") игнорируют данное
предупреждение и файл копируется в новое место нешифрованным.

 Для копирования шифрованного файла за пределы исходного диска будет использован
внутренний механизм копирования, независимо от того, включён ли параметр
"Использовать системную функцию копирования" или нет.


@WarnCopyStream
$ #Предупреждение: Исходный файл содержит более одного потока данных#
 Исходный файл содержит более одного потока данных или файловая система
назначения не поддерживает многопоточность файловых объектов.

 Потоки - это возможность файловой системы NTFS, позволяющая ассоциировать с
файлом дополнительную информацию (например, сведения о его авторе, названии,
ключевые слова и т.д., а также любые другие данные). Эта информация хранится
вместе с файлом и никак не видна при использовании программ, не поддерживающих
потоки. В частности, потоки использует Windows Explorer для хранения дополнительных
свойств файла. Файловые системы FAT/FAT32 не поддерживают потоки.

 Для того, чтобы скопировать файловый объект полностью (со всеми потоками),
включите опцию #"Использовать системную функцию копирования"# в диалоге
настройки ~системных параметров~@SystemSettings@.

 Если вы копируете многопоточный файловый объект на том, отличный от NTFS,
то и в этом случае потеряете данные - будет скопирован только основной поток.


@ErrLoadPlugin
$ #Ошибка: плагин не загружен#
 Эта ошибка появляется в случаях, когда:

 1. ^<wrap>Для нормальной работы плагина требуется динамическая библиотека, которая отсутствует в вашей системе.
 2. ^<wrap>Плагин по какой-то причине вернул системе информацию о недопустимости дальнейшей загрузки.
 3. ^<wrap>DLL-модуль плагина испорчен.


@ScrSwitch
$ #Переключение между экранами#
 Far позволяет открыть несколько копий встроенной программы просмотра и
редактора. Используйте #Ctrl+Tab#, #Ctrl+Shift+Tab# или #F12# для переключения
между панелями и экранами с этими копиями. #Ctrl+Tab# переключает на следующий
экран, #Ctrl+Shift+Tab# на предыдущий, #F12# выводит список всех доступных
экранов.

 Количество фоновых экранов редактирования и просмотра отображается в
верхнем левом углу левой панели. Вы можете запретить показ количества экранов,
используя диалог ~Настройки панели~@PanelSettings@.

 См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@ApplyCmd
$ #Применить команду#
 Используя пункт #Применить команду# из ~Меню файлов~@FilesMenu@,
можно применить команду к каждому помеченному файлу. Для обозначения
имени файла должны использоваться те же ~символы~@MetaSymbols@, что
и в ~Ассоциациях файлов~@FileAssoc@.

 Например, 'type !.!' будет выводить на экран все помеченные файлы по
очереди, а команда 'rar32 m !.!.rar !.!' перенесёт все отмеченные файлы в
одноимённые RAR-архивы. Команда 'explorer /select,!.!' запустит проводник и
установит курсор на текущем файле или папке.

 См. также ~"Команды операционной системы"~@OSCommands@


@OSCommands
$ #Команды операционной системы#
 Far Manager выполняет следующие команды операционной системы сам,
без обращения к командному процессору операционной системы:

 #CLS#
 Очищает экран.

 #disk:#
 Меняет текущий диск на активной панели на указанный «disk».

 #CD [disk:]path# или #CHDIR [disk:]path#
 Меняет текущий путь на активной панели на указанный «path». Если
указана буква диска, меняется также и диск. Если активная панель
отображает файловую систему, эмулируемую ~плагином~@Plugins@, то команда
«CD» меняет текущую папку в этой файловой системе. В отличие от «CD»,
команда «CHDIR» всегда интерпретирует свой параметр как имя папки
в дисковой файловой системе вне зависимости от типа файловой панели.
 Команда #CD ~~# переходит в домашнюю папку (если в текущей папке нет
реального файла или папки с именем «~~»). Домашняя папка задаётся опцией
#использовать домашний каталог# диалога
~настроек командной строки~@CmdlineSettings@. По умолчанию, это строка
«%FARHOME%», символизирующая домашнюю папку Far Manager’а.

 #CHCP [nnn]#
 Показывает или изменяет текущую кодовую страницу. Параметр «nnn»
задаёт номер кодовой страницы, которую надо установить. «CHCP» без
параметра показывает номер текущей кодовой страницы.

 #SET variable=[string]#
 Устанавливает переменную среды «variable» в значение «string». Если
параметр «string» не указан, то переменная «variable» удаляется. При
запуске Far Manager устанавливает некоторые ~переменные среды~@FAREnv@.

 #IF [NOT] EXIST filename command#
 Выполняет команду «command», если «filename» существует, или не
существует (при использовании с «NOT»).

 #IF [NOT] DEFINED variable command#
 Выполняет команду «command», если переменная среды «variable»
определена, или не определена (при использовании с «NOT»).
 Команды «IF» могут быть вложенными. В следующем примере команда
«command» будет выполнена, если файл «file1» существует, файл «file2»
не существует, и переменная среды «variable» определена.
 #if exist file1 if not exist file2 if defined variable command#

 #PUSHD [path]#
 Сохраняет текущий путь для использования командой «POPD».
If “path” is specified, changes the current path on the active panel to it.

 #POPD#
 Меняет текущий путь на активной панели на сохранённый командой «PUSHD».

 #CLRD#
 Очищает стек путей, сохранённых командой «PUSHD».

 #TITLE [string]#
 Устанавливает фиксированный заголовок окна консоли Far Manager’а
в «string». Заголовок не будет меняться ни при переключении между
панелями, ни при исполнении команд, ни при изменении опции
#информация для заголовка окна# диалога
~настроек интерфейса~@InterfSettings@. Установка «string» будет
использоваться до завершения текущего сеанса или до восстановления
обычного поведения командой «TITLE» без параметра.

 #EXIT#
 Завершает работу Far Manager’а.

 Примечания:

 1. ^<wrap>Если синтаксис команды отличается от указанных выше,
то Far Manager вызовет для исполнения команды командный процессор
операционной системы.
 2. ^<wrap>Far Manager исполняет вышеперечисленные команды
следующих контекстах:
 - ~Командная строка~@CmdLineCmd@
 - ~Применить команду~@ApplyCmd@
 - ~Меню пользователя~@UserMenu@
 - ~Ассоциации файлов~@FileAssoc@


@FAREnv
$ #Переменные среды#
 После запуска Far Manager выставляет следующие переменные среды, доступные
дочерним процессам:

 #FARHOME#            ^<wrap>папка, содержащая основной исполняемый модуль Far.

 #FARPROFILE#         ^<wrap>папка, содержащая перемещаемые персональные данные (настройки Far и плагинов, дополнительные плагины и т. п.)

 #FARLOCALPROFILE#    ^<wrap>папка, содержащая локальные персональные данные (истории, кеш плагинов и т. п.)

 #FARLANG#            ^<wrap>название текущего языка интерфейса

 #FARUSER#            ^<wrap>имя пользователя, указанное в параметре /u ~командной строки~@CmdLine@

 #FARDIRSTACK#        ^<wrap>содержимое вершины стека каталогов (который управляется командами pushd и popd)

 #FARADMINMODE#       ^<wrap>равна "1", если Far Manager запущен от имени администратора


@RegExp
$ #Регулярные выражения для поиска#
 Синтаксис регулярных выражений почти полностью совпадает с перловыми регэкспами.

 Общий вид: #regexp# или /#regexp#/#options#.

 Опции (#options#):
 #i# - игнорировать регистр
 #s# - ^<wrap>рассматривать текст как одну строку, ‹#.#› совпадает с абсолютно любым знаком
 #m# - ^<wrap>рассматривать текст как много строк. ‹#^#› и ‹#$#› совпадают с началом и концом
любой "внутренней" строки
 #x# - ^<wrap>просто пробельные знаки (без обратного слеша впереди) игнорируются -
полезно в сложных выражениях для структуризации

 #regexp# - последовательность знаков и метасимволов. К знакам
относятся буквы и цифры, всё остальное, если и не является метасимволом, может
им стать, поэтому всё, что не есть буква и не есть цифра, следует делать
знаком «насильственно». Для этого надо перед ним поставить обратный слеш - ‹#\#›.

 Обратите внимание на то, что все слеши (и прямые, и обратные) в вашем
регулярном выражении должны писаться со спецсимволом ‹#\#› впереди, чтобы не
быть спутанными с другими спецсимволами или концом выражения. Пример: строка
"большое\белое/страшное" в виде регулярного выражения должна выглядеть так -
"большое\\\\белое\/страшное".

 #Метасимволы#

 #\#  - ^<wrap>следующий за ним знак будет рассмотрен именно как знак, а не как метасимвол
 #^#  - ^<wrap>начало строки
 #$#  - ^<wrap>конец строки
 #|#  - ^<wrap>альтернатива. Должно совпасть выражение до или после ‹#|#›.
        ^<wrap>Пример: "\d+\w+|Hello\d+" работает как "(\d+\w+)|(Hello\d+)", а не как "\d+(\w+|H)ello\d+".
 #()# - ^<wrap>группировка - группировка служит либо для использования
"ссылок", либо для использования попавшего в группу фрагмента текста при замене.
 #[]# - ^<wrap>класс знаков - это метасимвол который совпадёт с любым из
перечисленных в #[]# знаком или диапазоном знаков. Диапазоны указываются например так: [a-z]
Метасимволы не учитываются в классах символов. Если первым знаком в классе указать ‹#^#›, то это сделается негативный класс.
Если требуется добавить в класс сам знак #^#, он либо должен быть не первым, либо перед ним должен быть ‹#\#›.

 Кроме группировки, круглые скобки служат ещё для следующих операций:
 #(?:pattern)#  - ^<wrap>обычная группировка, но только эта группа не получает номера.
 #(?=pattern)#  - ^<wrap>просмотр вперёд. Совпадение продолжится с того же места, но только если образец в этой группе
совпал. Например, #\w+(?=\s)# совпадёт со словом, за которым идёт пробел, причём пробел не будет
включён в результат поиска.
 #(?!pattern)#  - ^<wrap>отрицание просмотра вперёд. Совпадение продолжится с того же места, если pattern НЕ
совпадёт. Например, #foo(?!bar)# совпадёт с любым вхождением "foo", которое встречается без
последующего "bar". Помните, что это выражение имеет нулевой размер, что означает, что
#a(?!b)d# совпадёт с #ad#, потому что #a# сопровождается знаком, который не #b# (а #d#),
а #d# идёт за выражением нулевого размера.
 #(?<=pattern)# - ^<wrap>просмотр назад. К сожалению, pattern должен быть фиксированной длины.
 #(?<!pattern)# - ^<wrap>отрицание просмотра назад. Те же ограничения, что и для просмотра назад.

 #(?{name}pattern)# - именованная группа.
 В качестве имени "name" может использоваться последовательность из знаков слова (#\w#) и пробелов (#\s#).

 #Квантификаторы#

 За любым знаком, группой или классом знаков может идти один из квантификаторов:

 #?#      - ^<wrap>жадное совпадение 0 или один раз.
 #??#     - ^<wrap>нежадное совпадение 0 или один раз.
 #*#      - ^<wrap>жадное совпадение 0 или более раз.
 #*?#     - ^<wrap>нежадное совпадение 0 или более раз.
 #+#      - ^<wrap>жадное совпадение 1 или более раз.
 #+?#     - ^<wrap>нежадное совпадение 1 или более раз.
 #{n}#    - ^<wrap>совпадение точно n раз.
 #{n,}#   - ^<wrap>жадное совпадение n или более раз.
 #{n,}?#  - ^<wrap>нежадное совпадение n или более раз.
 #{n,m}#  - ^<wrap>жадное совпадение не меньше чем n, но не больше чем m раз.
 #{n,m}?# - ^<wrap>нежадное совпадение не меньше чем n, но не больше чем m раз.
 #{,m}#   - ^<wrap>эквивалентно {0,m}
 #{,m}?#  - ^<wrap>эквивалентно {0,m}?

 #Что такое "жадный" и "нежадный" квантификатор#

 Жадный квантификатор захватывает как можно больше. И только, если
дальнейшего совпадения не получилось, "отдаёт" захваченное (происходит
"откат", не самая "дешёвая" операция).
 Если выражение "A.*Z" сопоставить строке
"AZXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", то #.*# сначала захватит всю строку, а
потом будет по одному знаку "откатываться" пока не найдёт Z. А если
выражение будет "A.*?Z" то Z найдётся сразу же. Нежадный квантификатор ещё
называют #минимизирующим#, он захватывает минимально возможное количество
знаков, и только, если дальнейшее совпадение не получилось, захватывает ещё.

 #Спецсимволы#

 Перед не-буквой и не-цифрой можно в большинстве случаев ставить знак ‹#\#›, а
для букв и цифр это делать нужно осторожно, ибо таким образом обозначаются
спецсимволы:

 #.#    - ^<wrap>любой знак, кроме перевода строки. Если среди опций есть s, то вообще любой знак.
 #\t#   - tab (0x09)
 #\n#   - new line (LF, 0x0a)
 #\r#   - carriage return (CR, 0x0d)
 #\f#   - form feed (0x0c)
 #\a#   - bell (0x07)
 #\e#   - escape (0x1b)
 #\xNNNN# - hex char, где N - [0-9A-Fa-f].
 #\Q#   - ^<wrap>начало квотирования метасимволов - всё, что квотируется,
будет обрабатываться как текст, а не как регулярное выражение
 #\E#   - конец квотирования метасимволов
 #\w#   - буква, цифра или подчерк (‹_›)
 #\W#   - не \w
 #\s#   - пробельный знак (tab/space/LF/CR)
 #\S#   - не \s
 #\d#   - цифра
 #\D#   - не цифра
 #\i#   - буква
 #\I#   - не буква
 #\l#   - знак в нижнем регистре
 #\L#   - не знак в нижнем регистре
 #\u#   - знак в верхнем регистре
 #\U#   - не знак в верхнем регистре
 #\b#   - ^<wrap>граница слова - означает, что слева или справа от текущей
позиции находится знак из "слова", а справа или слева, соответственно, из "не слова"
 #\B#   - не \b
 #\A#   - начало текста, независимо от опции m
 #\Z#   - конец текста, независимо от опции m
 #\O#   - ^<wrap>точка "невозврата". Если при поиске соответствия пройден этот знак,
то отката назад не будет, вместо него вернётся «совпадение не найдено». Можно
использовать в сложном выражении после обязательного
фрагмента с квантификатором. Этот спецсимвол можно
использовать, когда обрабатываемые объёмы данных очень большие.
        Пример:
        /.*?name\O=(['"])(.*?)\1\O.*?value\O=(['"])(.*?)\3/
        ^<wrap>Строки,  в которых есть "name=", но нет "value=", будут обрабатываться (фактически - пропускаться) быстрее.

 #\NN#  - ^<wrap>ссылка на ранее совпавшую группу. NN - целое положительное число
Каждая группа, кроме (?:pattern), (?=pattern), (?!pattern), (?<=pattern) и (?<!pattern)
имеет номер (по порядку появления открывающей скобки).
        Пример:
        "(['"])hello\1" совпадёт с "hello" или 'hello'.

 #\p{name}# - ^<wrap>ссылка на ранее совпавшую группу с именем name.

 #Примеры#

 #/foobar/# совпадёт с "foobar", но не с "FOOBAR"
 #/ FOO bar /ix# совпадёт с "foobar" и с "FOOBAR"
 #/(foo)?bar/# совпадёт с "foobar" и "bar"
 #/^foobar$/# совпадёт _только_ с "foobar", но не с "foofoofoobarfoobar"
 #/[\d\.]+/# совпадёт с любым числом с десятичной точкой
 #/(foo|bar)+/# совпадёт с "foofoofoobarfoobar" и "bar"
 #/\Q.)))$\E/# эквивалентно "\.\)\)\)\$"


@RegExpRepl
$ #Регулярные выражения для замены#
 В строке замены помимо обычных знаков вы можете использовать специальные
операторы - регулярные выражения для строки замены.

 #$0#…#$N#

 Номера найденных групп. Соответствующая группа подставляется в строку во время
работы. Номера группам присваиваются в порядке следования открывающих скобок в
регулярном выражении. #$0# означает всю найденную последовательность целиком.

 $#{#name#}#    Подставить группу с именем #name#.


@ElevationDlg
$ #Запрос привилегий администратора#
 Во время выполнения разнообразных операций с файловой системой
у текущего пользователя может не хватать прав. В этом случае Far Manager
предлагает повторить попытку от имени администратора (повысить права
текущего пользователя).

 Доступны опции:

 #Выполнить это действие для всех текущих объектов#
 Не задавать вопросов о повышении прав для текущей файловой операции.

 #Больше не спрашивать в текущей сессии#
 В текущем сеансе Far Manager будет самостоятельно повышать
привилегии без запроса пользователя.

 См. также опцию #Запрос прав администратора#
в ~Системных параметрах~@SystemSettings@.


@KeyMacro
$ #Макросы#
 По умолчанию макросы грузятся из файлов с расширениями #.lua# и #.moon#, находящихся в папке
#%FARPROFILE%\\Macros\\scripts#. Подробнее см. в документе #%FARHOME%\\Encyclopedia\\macroapi_manual.ru.chm#.

 Клавиатурные макрокоманды или макросы - это записанная последовательность
нажатий клавиш. Макрос позволяет многократно выполнять одну и ту же
последовательность действий за одно нажатие горячей клавиши.

 Каждый макрос имеет следующие параметры:
 - ^<wrap>горячую клавишу, при нажатии на которую будет выполнена
записанная последовательность;
 - набор дополнительных ~параметров~@KeyMacroSetting@, которые влияют на способ
и место воспроизведения Far записанной последовательности;

 Макросы, чаще всего, используются для:
 - ^<wrap>Совершения одинаковых действий несколько раз, используя для
вызова последовательности этих действий одно сочетание кнопок.
 - Выполнения специальных функций, которые задаются специальными
командами в тексте макроса.
 - Переопределение стандартных сочетаний клавиш, которые
использует Far для совершения тех или иных действий.

 Основным применением макросов является определение кнопок для быстрого
вызова внешних плагинов и переопределение действий Far.

 См. также:

 ~Области действия макросов~@KeyMacroArea@
 ~Кнопки назначения~@KeyMacroAssign@
 ~Запись и воспроизведение макросов~@KeyMacroRecPlay@
 ~Удаление макроса~@KeyMacroDelete@
 ~Параметры макрокоманды~@KeyMacroSetting@
 ~Установленные макросы~@KeyMacroList@


@KeyMacroArea
$ #Макросы: области действия#
 Far позволяет создавать независимые ~макросы~@KeyMacro@ (макросы, у которых
совпадает сочетание клавиш запуска) для различных областей.

 Внимание: Область, к которой будет принадлежать макрос,
определяется тем местом, где его #начали# записывать.

 В настоящий момент такими независимыми областями являются:
 - файловые панели;
 - внутренняя программа просмотра;
 - редактор;
 - диалоги;
 - быстрый поиск в панелях;
 - меню выбора дисков;
 - основное меню;
 - прочие меню;
 - система помощи;
 - информационная панель;
 - панель быстрого просмотра;
 - панель дерева папок;
 - пользовательское меню;
 - остальное: режим копирования текста с экрана, вертикальные меню.

 Нельзя назначить на какое-либо сочетание клавиш в одной области несколько
различных действий. При попытке назначить для нового макроса уже используемое
сочетание предыдущий макрос будет удалён.

 Таким образом, вы можете иметь по одному макросу с одинаковым сочетанием
клавиш запуска в каждой из перечисленных областей.


@KeyMacroAssign
$ #Макросы: кнопки назначения#
 ~Макрос~@KeyMacro@ может быть назначен на:
 - ^<wrap>любую клавишу;
 - на сочетание клавиши с модификаторами #Ctrl#, #Alt# и #Shift#;
 - на сочетание клавиши с двумя модификаторами.
   Far позволяет использовать следующие двойные модификаторы:
   #Ctrl+Shift+<клавиша>#, #Ctrl+Alt+<клавиша># и #Alt+Shift+<клавиша#>

 Макрос #не# может быть назначен на следующие клавиши и сочетания клавиш:
#Alt+Ins#, #Ctrl+<.>#, #Ctrl+Shift+<.>#, #Ctrl+Alt#, #Ctrl+Shift#, #Shift+Alt#
и #Shift+<символ>#.

 Некоторые комбинации клавиш (в частности, #Enter#, #Esc#, #F1#, #Ctrl+F5#,
#MsWheelUp# и #MsWheelDown# с комбинацией #Ctrl#, #Shift# и #Alt#) невозможно
ввести напрямую в диалоге назначения макроклавиши, поскольку они имеют
специальные функции. Для того, чтобы назначить макрос на одну из таких
комбинаций клавиш, выберите её из выпадающего списка.


@KeyMacroRecPlay
$ #Макросы: запись и воспроизведение#
 Far может выполнять ~макросы~@KeyMacro@ в двух основных режимах:

 1. ^<wrap>Общий режим: нажимаемые клавиши при записи
и воспроизведении #будут# передаваться плагинам.
 2. ^<wrap>Специальный режим: нажимаемые клавиши при записи
и воспроизведении #не будут# передаваться плагинам,
перехватывающим события в редакторе.

 Например, если какой-то плагин обрабатывает сочетание клавиш #Ctrl+A#, то
при специальном режиме работы макросов этот плагин не получит управления и не
выполнит действия, которые он обычно выполняет при реакции на это сочетание
клавиш.

 Создание макроса выполняется следующими действиями:

 #Начало записи макроса#
 Клавиша #Ctrl+<.># (#Ctrl# и клавишу с точкой) для записи
макроса в общем режиме и #Ctrl+Shift+<.># (#Ctrl#,
#Shift# и клавишу с точкой), для записи макроса в специальном
режиме.
 После того как Far начал запись макроса в левом верхнем
углу экрана будет отображаться символ '\4FR\-'.

 #Ввод текста макроса#
 Far будет сохранять все нажимаемые клавиши со следующими
исключениями:
 - ^<wrap>будут сохранены только клавиши, обрабатываемые Far.
Т.е. если вы в процессе записи макроса из консоли Far
запустите внешнюю программу, то Far сохранит только
клавиши, нажатые до запуска и после завершения внешней
программы.

 #Примечание#: На время записи макроса все остальные макросы
отключаются. Таким образом, нельзя записать «многоуровневый» макрос,
вызывающий ранее записанные макросы.

 #Окончание записи макроса#
 Для завершения записи макроса служат специальные сочетания
клавиш. Т.к. макрос может быть дополнительно настроен,
то таких сочетаний два: #Ctrl+<.># (#Ctrl# и клавиша с точкой)
и #Ctrl+Shift+<.># (#Ctrl#, #Shift# и клавиша с точкой).
Первое сочетание вызывает запись макроса с параметрами
воспроизведения, принятыми по умолчанию. Второе сочетание
клавиш показывает диалог с ~параметрами~@KeyMacroSetting@ выполнения макроса.

 #Назначение сочетания клавиш для запуска макроса#
 После окончания ввода текста макроса и назначения параметров
его выполнения будет показан диалог ~назначения клавиши~@KeyMacroSetting@,
в котором можно задать горячую клавишу для воспроизведения
записанной последовательности.

 Воспроизведение макроса сопровождается отображением в левом верхнем углу экрана символа '\2FP\-'.
См. также "~Macros.ShowPlayIndicator~@Macros.ShowPlayIndicator@" для включения/отключения отображения символа.


@KeyMacroDelete
$ #Макросы: удаление макроса#
 Для того, чтобы удалить ~макрос~@KeyMacro@, нужно записать пустой (не
содержащий действий) макрос и присвоить ему горячую клавишу макроса, который вы
хотите удалить.

 Эту операцию можно выполнить, осуществив следующие действия:
 1. ^<wrap>Начать запись макроса (#Ctrl+<.>#)
 2. Закончить запись макроса (#Ctrl+<.>#)
 3. Ввести или выбрать в диалоге назначения горячей клавиши
сочетание, макрос для которого вы хотите удалить

 #Внимание#: после удаления макроса сочетание клавиш, используемое для его
выполнения, начнёт выполнять свою первоначальную функцию. Т.е.
если это сочетание клавиш до записи макроса обрабатывалось Far
или каким-либо плагином, то после удаления макроса оно снова начнёт
обрабатываться.


@KeyMacroSetting
$ #Макросы: параметры макрокоманды#
 Для задания дополнительных параметров ~макрокоманды~@KeyMacro@ завершите её
запись с помощью #Ctrl+Shift+<.># вместо #Ctrl+<.># и выберите желаемые опции в
появившемся диалоге:

 #Последовательность:#
 Позволяет изменить записанную последовательность клавиш.

 #Описание:#
 Позволяет изменить описание данной последовательности клавиш.

 #Разрешить во время выполнения вывод на экран#
 Если отключить этот параметр, то во время выполнения макрокоманды Far
Manager отключает перерисовку экрана. Все изменения будут отображены после
завершения макрокоманды.

 #Выполнять после запуска Far#
 Позволяет выполнять макрокоманду сразу после запуска Far Manager.

 Для активной и пассивной панелей возможны следующие условия, активизирующие макрокоманду:

 #На панели плагина#
 [x] - выполнять, только если панель плагиновая
 [ ] - выполнять только для файловой панели
 [?] - игнорировать тип панели

 #Выполнять для папок#
 [x] - ^<wrap>выполнять, только если на панели под курсором папка
 [ ] - выполнять, только если на панели под курсором файл
 [?] - выполнять для папок и файлов

 #Отмечены файлы#
 [x] - ^<wrap>выполнять, только если на панели есть отмеченные файлы/папки
 [ ] - выполнять, если нет отмеченных файлов/папок
 [?] - игнорировать состояние отметки файлов/папок

 Прочие условия активизирующие макрокоманду:

 #Пустая командная строка#
 [x] - ^<wrap>выполнять, только если командная строка пуста
 [ ] - выполнять, только если командная строка не пуста
 [?] - игнорировать состояние командной строки

 #Отмечен блок#
 [x] - ^<wrap>выполнять, только если выделен блок в редакторе,
программе просмотра, командной строке или в строке ввода в диалоге.
 [ ] - выполнять, если нет отмеченного блока
 [?] - игнорировать состояние отметки блока

 Примечания:

 1. ^<wrap>Far, перед активацией макрокоманды, проверяет все описанные выше
условия.

 2. ^<wrap>Некоторые комбинации клавиш (в частности, #Enter#, #Esc#, #F1#, #Ctrl+F5#,
#MsWheelUp#, #MsWheelDown# и другие клавиши мыши с комбинацией #Ctrl#, #Shift# и #Alt#)
невозможно ввести напрямую, поскольку они имеют специальные функции в диалоге.
Для того, чтобы ~назначить макрос~@KeyMacroAssign@ на одну из таких комбинаций
клавиш, выберите её из выпадающего списка в диалоге.


@KeyMacroList
$ #Макросы: Список установленных макросов#
 Ниже приведён список разделов, в которых можно узнать какие ~макросы~@KeyMacro@
действуют в текущей сессии Far Manager.

 ~Общие макросы#~@KeyMacroCommonList@

 ~Панели~@KeyMacroShellList@
 ~Панель быстрого просмотра~@KeyMacroQViewList@
 ~Панель папок~@KeyMacroTreeList@
 ~Информационная панель~@KeyMacroInfoList@
 ~Автодополнение в панелях~@KeyMacroShellAutoCompletionList@

 ~Быстрый поиск в панелях~@KeyMacroSearchList@
 ~Поиск папки~@KeyMacroFindFolderList@

 ~Диалоги~@KeyMacroDialogList@
 ~Автодополнение в диалогах~@KeyMacroDialogAutoCompletionList@

 ~Главное меню~@KeyMacroMainMenuList@
 ~Меню выбора дисков~@KeyMacroDisksList@
 ~Меню пользователя~@KeyMacroUserMenuList@
 ~Прочие меню~@KeyMacroMenuList@

 ~Программа просмотра~@KeyMacroViewerList@
 ~Редактор~@KeyMacroEditList@

 ~Файл помощи#~@KeyMacroHelpList@

 ~Остальные области~@KeyMacroOtherList@


@KeyMacroCommonList
$ #Макросы: Общие#
 Ниже приведены комбинации макроклавиш, действующих везде.

<!Macro:Common!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroQViewList
$ #Макросы: Панель быстрого просмотра#
 Ниже приведены комбинации макроклавиш, действующих в панели быстрого просмотра.

<!Macro:Common!>

<!Macro:Qview!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroMainMenuList
$ #Макросы: Главное меню#
 Ниже приведены комбинации макроклавиш, действующих в главном меню.

<!Macro:Common!>

<!Macro:MainMenu!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroTreeList
$ #Макросы: Панель папок#
 Ниже приведены комбинации макроклавиш, действующих в панели папок.

<!Macro:Common!>

<!Macro:Tree!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroDialogList
$ #Макросы: Диалоги#
 Ниже приведены комбинации макроклавиш, действующих в диалогах.

<!Macro:Common!>

<!Macro:Dialog!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroInfoList
$ #Макросы: Информационная панель#
 Ниже приведены комбинации макроклавиш, действующих в информационной панели.

<!Macro:Common!>

<!Macro:Info!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroDisksList
$ #Макросы: Меню выбора дисков#
 Ниже приведены комбинации макроклавиш, действующих в меню выбора дисков.

<!Macro:Common!>

<!Macro:Disks!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroUserMenuList
$ #Макросы: Меню пользователя#
 Ниже приведены комбинации макроклавиш, действующих в пользовательском меню.

<!Macro:Common!>

<!Macro:UserMenu!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroShellList
$ #Макросы: Панели#
 Ниже приведены комбинации макроклавиш, действующих в файловых панелях.

<!Macro:Common!>

<!Macro:Shell!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroSearchList
$ #Макросы: Быстрый поиск в панелях#
 Ниже приведены комбинации макроклавиш, действующих в быстром поиске файловых панелей.

<!Macro:Common!>

<!Macro:Search!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroFindFolderList
$ #Макросы: Поиск папки#
 Ниже приведены комбинации макроклавиш, действующих в поиске папки.

<!Macro:Common!>

<!Macro:FindFolder!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroEditList
$ #Макросы: Редактор#
 Ниже приведены комбинации макроклавиш, действующих в редакторе.

<!Macro:Common!>

<!Macro:Editor!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroViewerList
$ #Макросы: Программа просмотра#
 Ниже приведены комбинации макроклавиш, действующих в программе просмотра.

<!Macro:Common!>

<!Macro:Viewer!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroMenuList
$ #Макросы: Прочие меню#
 Ниже приведены комбинации макроклавиш, действующих в прочих меню.

<!Macro:Common!>

<!Macro:Menu!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroHelpList
$ #Макросы: Файл помощи#
 Ниже приведены комбинации макроклавиш, действующих в файле помощи.

<!Macro:Common!>

<!Macro:Help!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroOtherList
$ #Макросы: Остальные области#
 Ниже приведены комбинации макроклавиш, действующих в других областях: копировании текста с экрана, вертикальных меню.

<!Macro:Common!>

<!Macro:Other!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroShellAutoCompletionList
$ #Макросы: Автодополнение в панелях#
 Ниже приведены комбинации макроклавиш, действующих в автодополнении в панелях.

<!Macro:Common!>

<!Macro:ShellAutoCompletion!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@KeyMacroDialogAutoCompletionList
$ #Макросы: Автодополнение в диалогах#
 Ниже приведены комбинации макроклавиш, действующих в автодополнении в диалогах.

<!Macro:Common!>

<!Macro:DialogAutoCompletion!>

 См. также ~«Список установленных макросов»~@KeyMacroList@


@FarAbout
$ #Информация о версиях#
 Запускается по команде #far:about#

 Позволяет посмотреть:
 - версию и битность Far Manager
 - версии используемых в проекте сторонних библиотек
 - имена и версии подключённых плагинов


@CustomizingUI
$ #Настройка элементов пользовательского интерфейса#
 Все элементы, встречающиеся в пользовательском интерфейсе (UI) Far
Manager’а, определены в файлах #.lng# (например, #FarRus.lng#).
Пользователь может изменить эти элементы, как ему удобно. К примеру,
можно изменить горячие клавиши или надписи на каком-нибудь диалоге.
Чтобы переопределить элементы пользовательского интерфейса, необходимо
создать файл с именем #Far<Lng>.lng.custom# в папке #%FARHOME%# или
#%FARPROFILE%# и задать новые значения для тех UI ID’ов, которые нужно
изменить.

 Например, для того, чтобы типы ссылок файлов и папок на панелях Far
выглядели так же, как в листинге DOS’овской команды DIR, можно создать
файл #FarRus.lng.custom# в папке #%FARPROFILE%# со следующим содержимым:

@-
 \0A┌────────────────────────────┐\-
 \0A│\30│  │UTF-8│Ln 1/7│Col│8:34 PM\0A│\-
 \0A│\1b//[MListUp]                 \0A│\-
 \0A│\1b"..↑"                       \0A│\-
 \0A│\1b                            \0A│\-
 \0A│\1bMListFolder   = "<DIR>"     \0A│\-
 \0A│\1bMListSymlink  = "<SYMLINK>" \0A│\-
 \0A│\1bMListJunction = "<JUNCTION>"\0A│\-
 \0A│\071\30Help  \07 2\30Save  \07 3\30      \07 \30    \0A│\-
 \0A└────────────────────────────┘\-
@+

 Новые элементы пользовательского интерфейса могут быть определены двумя
способами, на двух отдельных строках или на одной строке. Новые значения
всегда должны быть заключены в двойные кавычки. UI ID’ы, которые надо
переопределить, можно найти в оригинальном файле #Far<Lng>.lng#.

 Если файлы настройки пользовательского интерфейса существуют в обеих
папках, файл в #%FARPROFILE%# приоритетнее, чем файл в #%FARHOME%#.


@FarConfig
$ #Редактор конфигурации#
 Запускается по команде #far:config#

 Позволяет просмотреть и изменить все настройки Far Manager.
 Большинство настроек можно изменить через ~Меню параметров~@OptMenu@, но некоторые доступны только отсюда или через импорт конфигурации.
Параметры показаны в виде единого списка, состоящего из трёх полей: имя в формате SectionName.ParamName (например Editor.TabSize),
тип (boolean, 3-state, integer, string) и значение параметра (для типа integer дополнительно отображаются 16-ричное и символьное представления).
Если значение параметра отличается от значения по умолчанию, он помечается символом ‹*› слева от имени.

 Кроме клавиш перемещения по списку доступны следующие сочетания:

 #Enter# или #F4#
 Переключить или редактировать значение.

 #Shift+F4#
 Редактировать целое значение как шестнадцатеричное число. Для прочих типов аналогично #F4#.

 #Alt+F4#
 Редактировать целое значение как двоичное число. Для прочих типов аналогично #F4#.

 #Del#
 Сбросить параметр в значение по умолчанию.

 #Ctrl+H#
 Переключить отображение неизмененных параметров.

 #Shift+F1#
 Показать описание параметра, если оно доступно.

 #Ctrl+Alt+F#
 Переключить режим быстрой фильтрации.


@Codepages.NoAutoDetectCP
$ #far:config Codepages.NoAutoDetectCP#
 This parameter allows to exclude specific code pages from the heuristic code page detection results.
Such detection is unreliable by definition: it depends on statistical data and could guess wrong, especially when the amount of input data is small.

 By default the parameter is empty and there are no restrictions which code pages could be detected heuristically.

 If this parameter is set to #-1#, only the code pages, currenltly visible in the ~Code pages~@CodePagesMenu@ menu, will be accepted.
You can control which code pages are visible there with the #Ctrl+H# key combination and the #Favorites# section.

 If this parameter contains a comma-separated list of code page numbers, all the specified code pages will be excluded from the heuristic detection.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Help.ActivateURL
$ #far:config Help.ActivateURL#
 Этот числовой параметр управляет тем будет ли Far открывать
(активировать) URL ссылки в файлах подсказки:

 0 - ^<wrap>URL ссылки не открываются;
 1 - URL ссылки открываются;
 2 - URL ссылки открываются после подтверждения пользователем.

 По умолчанию значение = 1 (ссылки открываются).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Confirmations.EscTwiceToInterrupt
$ #far:config Confirmations.EscTwiceToInterrupt#
 Этот логический (Boolean) параметр управляет поведением клавиши #Esc# в диалоге
подтверждения прерывания операции.

 False - ^<wrap>Клавиша #Esc# закрывает сообщение и продолжает выполнение операции;
 True  - Клавиша #Esc# закрывает сообщение и прерывает выполнение операции.

 По умолчанию значение = False (закрыть сообщение и продолжить выполнение операции).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.AllCtrlAltShiftRule
$ #far:config System.AllCtrlAltShiftRule#
 Этот числовой параметр управляет тем, какие объекты пользовательского
интерфейса могут быть временно скрыты комбинацией клавиш
#Ctrl+Alt+Shift#. Каждый бит соответствует определённому типу объектов.

 Номера битов:
 0 - Панели;
 1 - Редактор;
 2 - Программа просмотра;
 3 - Окно подсказки;
 4 - Диалоги и меню.

 Если бит установлен, объекты соответствующего типа могут быть скрыты.

 По умолчанию разрешено скрытие всех объектов.

 См. также ~System.CASRule~@System.CASRule@.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.CASRule
$ #far:config System.CASRule#
 Этот числовой параметр позволяет отключать комбинацию клавиш
#Ctrl+Alt+Shift# для временного скрытия объектов пользовательского
интерфейса. Отдельные биты управляют поведением левой и правой
комбинации клавиш.

 Номера битов:
 0 - Левая комбинация клавиш Ctrl+Alt+Shift;
 1 - Правая комбинация клавиш Ctrl+Alt+Shift.

 Если бит установлен, соответствующая комбинация клавиш скрывает объекты
интерфейса.

 По умолчанию разрешены обе комбинации.

 См. также ~System.AllCtrlAltShiftRule~@System.AllCtrlAltShiftRule@.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Panel.ShellRightLeftArrowsRule
$ #far:config Panel.ShellRightLeftArrowsRule#
 Этот логический (Boolean) параметр управляет поведением клавиш влево
и вправо, расположенных как на основной, так и на цифровой клавиатуре.

 False - ^<wrap>Как в Far 1.70. Если командная строка не пуста,
поведение клавиш #Left#, #Right#, #Numpad4#, и #Numpad6# зависит
от ~режима просмотра~@PanelViewModes@ панели файлов.
         - ^<wrap>Если имена файлов отображаются в нескольких полосах
(режимы 2 и 3 по умолчанию), то клавиши двигают курсор на панелях (как
при пустой командной строке).
         - ^<wrap>Если имена файлов отображаются в одной полосе (все
остальные режимы по умолчанию), то клавиши управляют курсором командной
строки.
 True  - ^<wrap>При включённой панели, клавиши #Left#, #Right#,
#Numpad4#, and #Numpad6# всегда двигают курсор панели, даже если
командная строка не пуста. Поведение не зависит от режима панели.

 Примечание: Клавиши #Ctrl+D# and #Ctrl+S# всегда двигают курсор
командной строки.

 По умолчанию значение = False (традиционное поведение).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Panel.Layout.ScrollbarMenu
$ #far:config Panel.Layout.ScrollbarMenu#
 Этот логический (Boolean) параметр разрешает показывать полосу
прокрутки в меню, когда пунктов меню больше, чем помещается
по вертикали.

 False - ^<wrap>Никогда не показывать полосу прокрутки в меню;
 True  - Показывать полосу прокрутки в меню, если нужно.

 По умолчанию значение = True (показывать полосу прокрутки, если нужно).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Panel.CtrlFRule
$ #far:config Panel.CtrlFRule#
 Этот логический (Boolean) параметр управляет поведением комбинации
клавиш #Ctrl+F# в ~командной строке~@CmdLineCmd@.

 False - ^<wrap>Имя файла вставляется в командную строку так, как оно
сохранено в файловой системе;
 True  - Имя файла вставляется так, как оно отображается на панели,
возможно в нижнем регистре или используя короткое имя.

 По умолчанию значение = False (вставлять, как есть).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Panel.CtrlAltShiftRule
$ #far:config Panel.CtrlAltShiftRule#
 Этот числовой параметр управляет поведением комбинации клавиш
#Ctrl+Alt+Shift# для временного скрытия файловых панелей.

 0 - ^<wrap>Скрывать только панели (подобно комбинации клавиш #Ctrl+O#);
 1 - Скрывать панели и командную строку;
 2 - Скрывать панели, командную строку и линейку функциональных клавиш
в нижней строке экрана.

 По умолчанию значение = 0 (скрывать только панели).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Panel.RightClickRule
$ #far:config Panel.RightClickRule#
 Этот числовой параметр управляет поведением #щелчка правой кнопки мыши#
на пустой полосе файловой панели.

 0 - ^<wrap>Установить курсор панели на последний файл в предыдущей
полосе и пометить его;
 1 - Установить курсор панели на последний файл в предыдущей полосе,
но не помечать его (аналогично #щелчку левой кнопки мыши#);
 2 - Не передвигать курсор панели и не помечать файл.

 Примечание: Если полоса не пуста, то последний файл всегда помечается.

 По умолчанию значение = 2 (ничего не делать).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.ExcludeCmdHistory
$ #far:config System.ExcludeCmdHistory#
 Этот числовой параметр определяет, команды каких категорий не будут
сохраняться в истории. Если бит в числе установлен, команды
соответствующих категорий не сохраняются.

 Номера битов и соответствующие категории команд:
 0 - ^<wrap>Программы, ассоциированные с определёнными типами файлов
в Windows;
 1 - Программы, ~ассоциированные с файлами~@FileAssoc@ в Far;
 2 - Исполняемые файлы под курсором на ~файловой панели~@FuncCmd@;
 3 - Команды, введённые в ~командной строке~@CmdLineCmd@.

 По умолчанию значение = 0 (сохранять команды всех категорий).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.Executor.RestoreCP
$ #far:config System.Executor.RestoreCP#
 Этот логический (Boolean) параметр управляет тем, будет ли Far Manager
восстанавливать кодовую страницу консоли после завершения исполнения
внешней программы. Некоторые программы изменяют кодовую страницу
консоли в процессе работы и не восстанавливают её перед выходом.
Используйте этот параметр для компенсации проблемы.

 False - ^<wrap>Оставить всё как есть; не восстанавливать кодовую
страницу;
 True  - Восстанавливать кодовую страницу консоли после окончания
внешней программы.

 По умолчанию значение = True (восстанавливать кодовую страницу
консоли).

 См. также ~команду операционной системы~@OSCommands@ #CHCP#.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.Executor.ExcludeCmds
$ #far:config System.Executor.ExcludeCmds#
 Этот строковый параметр определяет команды, которые будут немедленно
переданы на исполнение командному процессору операционной системы
(заданному переменной окружения #ComSpec#), не производя поиск
в текущем каталоге, каталогах, перечисленных в переменной окружения
#PATH#, и других предопределённых местах.

 Команды разделяются точкой с запятой (#;#). Производится подстановка
переменных окружения, заключённых в знаки процента (#%#).

 Например, если при значении этого параметра «DATE;ECHO» ввести
в командной строке «date», то будет выполнена внутренняя команда
командного процессора #DATE#. Чтобы выполнить внешнюю программу
«date.exe», надо ввести имя файла целиком, включая расширение. Однако,
если «DATE» не перечислено в этом параметре, и программа «date.exe»
существует в одном из каталогов #PATH#, внутреннюю команду командного
процессора выполнить невозможно.

 Готовые настройки для CMD.EXE и других известных командных
процессоров находятся в файлах #Addons\SetUp\Executor.*.farconfig#.

 Примечание: Far Manager исполняет некоторые
~команды операционной системы~@OSCommands@ сам, без обращения
к командному процессору операционной системы. Эти команды не перечислены
в файлах #Addons\SetUp\Executor.*.farconfig#. Некоторые другие команды
Far Manager исполняет с ограниченной функциональностью. Если синтаксис
отличается от описанного в разделе
~Команды операционной системы~@OSCommands@, команда будет передана для
выполнения командному процессору.

 Значение по умолчанию: пустая строка #""#.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.Executor.ComspecArguments
$ #far:config System.Executor.ComspecArguments#
 Этот строковый параметр определяет аргументы, которые Far Manager будет
использовать для вызова командного процессора операционной системы
(заданного переменной окружения #ComSpec#).

 Последовательность символов #{0}# будет заменена на текст команды. Этот
параметр полезен при использовании нестандартных командных процессоров,
требующих необычных параметров или кавычек.

 Значение по умолчанию: #/S /C "{0}"# (совместимо с CMD.EXE)

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Interface.FormatNumberSeparators
$ #far:config Interface.FormatNumberSeparators#
 Этот строковый параметр позволяет переопределить разделитель групп
разрядов и разделитель целой и дробной части числа в региональных
настройках ОС.

 Первый символ - ^<wrap>разделитель групп разрядов;
 Второй символ - разделитель целой и дробной части.

 Значение по умолчанию: пустая строка #""#
(использовать региональные настройки ОС).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.CmdHistoryRule
$ #far:config System.CmdHistoryRule#
 Этот логический (Boolean) параметр управляет тем, будет ли изменяться
текущая позиция в ~истории команд~@History@, если клавиша #Esc# была
нажата после комбинации клавиш #Ctrl+E# или #Ctrl+X#.

 False - ^<wrap>Текущей командой в истории станет команда, выбранная при
помощи #Ctrl+E# / #Ctrl+X#.
 True  - Текущей командой в истории станет последняя (самая новая)
команда.

 Примечание: Порядок команд в истории не меняется ни в каком случае.

 По умолчанию значение = False (изменять текущую позицию в истории
команд).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.ConsoleDetachKey
$ #far:config System.ConsoleDetachKey#
 Этот строковый параметр определяет комбинацию клавиш для отделения
консоли Far Manager’а от не-интерактивного процесса, запущенного в ней.

 Если длительный процесс использует консоль Far Manager’а, используйте
эту комбинацию клавиш, чтобы создать новую консоль, в которой Far
Manager продолжит работать, как если бы процесс уже завершился,
а старая консоль останется этому процессу.

 Эта функция может оказаться полезной, например, если архиватор,
запущенный из командной строки Far Manager’а, работает дольше, чем
ожидалось, и вы хотите продолжить редактировать файл, открытый в фоне,
или просто не хотите запускать новый Far.

 Значение по умолчанию: #"CtrlShiftTab"# (для отделения консоли Far
Manager’а используется комбинация клавиш #Ctrl+Shift+Tab#).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.QuotedSymbols
$ #far:config System.QuotedSymbols#
 Этот строковый параметр определяет специальные символы, требующие
кавычек вокруг имён файлов и папок. Если имя содержит один из этих
символов, то Far Manager будет заключать имя в кавычки при вставке
в командную строку или редактор, или копировании в буфер обмена.

 Значение по умолчанию: #" &()[]{}^=;!'+,` "#. Первый символ
~Пробел (Space, U+0020)~@https://ru.wikipedia.org/wiki/Пробел@;
Последний символ ~Неразрывный пробел (Non-breaking space, U+00A0)~@https://ru.wikipedia.org/wiki/Неразрывный_пробел@.

 См. также ~System.QuotedName~@System.QuotedName@

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.QuotedName
$ #far:config System.QuotedName#
 Этот числовой параметр управляет тем, будет ли Far Manager заключать
в кавычки имена файлов и папок, содержащие специальные символы (см.
параметр ~System.QuotedSymbols~@System.QuotedSymbols@). Отдельные биты
управляют этим поведением в разных контекстах.

 Номера битов:
 0 - ^<wrap>Заключать имена в кавычки при вставке в командную строку или
редактор;
 1 - Заключать имена в кавычки при копировании в буфер обмена.

 Значение по умолчанию: 1 (заключать в кавычки при вставке в командную
строку или редактор).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Interface.AltF9
$ #far:config Interface.AltF9#
 Этот логический (Boolean) параметр управляет поведением комбинации
клавиш #Alt+F9# (переключение размеров окна Far Manager).

 False - ^<wrap>Переключать высоту окна Far Manager’а между 25 и 50
строками; установить ширину окна в 80 колонок;
 True  - Максимизировать окно Far Manager’а или восстановить его размеры.

 Значение по умолчанию: True (максимизировать / восстанавливать).

 Примечание: Этот параметр влияет только на поведение в оконном режиме
работы.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Dialog.CBoxMaxHeight
$ #far:config Dialog.CBoxMaxHeight#
 Этот числовой параметр задаёт максимальную высоту списка истории
в диалогах.

 Значение по умолчанию: 8.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Editor.UndoDataSize
$ #far:config Editor.UndoDataSize#
 Этот числовой параметр ограничивает память, отведённую под буфер отмены
в редакторе.

 Значение по умолчанию: 104857600 (100MB).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Editor.CharCodeBase
$ #far:config Editor.CharCodeBase#
 Этот числовой параметр определяет, как код символа под курсором
представляется в статусной строке в редакторе.

 0 - Восьмеричное значение (6 цифр с ведущим нулём);
 1 - Десятичное значение (до 5 цифр);
 2 - Шестнадцатеричное значение (4 цифры и символ «h»).

 Значение по умолчанию: 1 (десятичное).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Editor.BSLikeDel
$ #far:config Editor.BSLikeDel#
 Этот логический (Boolean) параметр определяет поведение клавиши
#BackSpace# в редакторе, когда выделен вертикальный блок.

 False - ^<wrap>Удаляет символ слева от курсора; сохраняет
(вертикальное) выделение;
 True  - Удаляет выделенный вертикальный блок так же, как клавиша #Del#.

 Значение по умолчанию: True (удаляет выделенный блок).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Editor.AllowEmptySpaceAfterEof
$ #far:config Editor.AllowEmptySpaceAfterEof#
 Этот логический (Boolean) параметр определяет, может ли прокрутка файла
в редакторе вниз (например, с помощью комбинации клавиш #Ctrl+Down#),
оставить пустые строки внизу окна.

 False - ^<wrap>Остановить прокрутку, когда последняя строка файла
появилась в последней строке окна редактора;
 True  - Продолжать прокрутку, пока последняя строка файла не достигнет
курсора, оставляя пустые строки ниже курсора.

 Значение по умолчанию: False (остановить прокрутку).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Interface.RedrawTimeout
$ #far:config Interface.RedrawTimeout#
 Этот числовой параметр задаёт период обновления (в миллисекундах)
диалога прогресса, показываемого в процессе длительных операций, таких
как копирование, перемещение, удаление и поиск файлов и папок,
применение прав доступа после перемещения файлов и папок, сканирование
файловой системы.

 Чем больше это значение, тем реже выводится информация о процессе,
и тем быстрее проходит этот самый процесс.

 Значение по умолчанию: 200 мс.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@TitleFormat
$ #far:config Interface.ViewerTitleFormat, Interface.EditorTitleFormat#
 Эти строковые параметры задают заголовок окна консоли для
~редактора~@Editor@ и ~программы просмотра~@Viewer@.

 Макрос #%File# заменяется на имя редактируемого или просматриваемого
файла.

 Макрос #%Lng# заменяется на слово «редактирование» или «просмотр»
на текущем языке, см. ~Меню параметров~@OptMenu@.

 Строка #Дополнительная информация для заголовка окна#
~настроек интерфейса~@InterfSettings@ будет автоматически добавлена
в конец заголовка окна консоли.

 Значение по умолчанию: #"%Lng %File"#.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.WipeSymbol
$ #far:config System.WipeSymbol#
 Этот числовой параметр задаёт байт-заполнитель для операции
"~уничтожения файла~@DeleteFile@" (комбинация клавиш #Alt+Del#).

 Каждый байт файла перезаписывается младшим байтом этого параметра. Если
параметр установлен в -1, будут использованы случайные значения.

 Значение по умолчанию: 0.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.ShowCheckingFile
$ #far:config System.ShowCheckingFile#
 Этот логический (Boolean) параметр определяет, будет ли имя плагина,
проверяющего файл, отображаться в заголовке окна консоли.

 Когда пользователь нажимает #Enter# или #Ctrl+PgDn#, Far Manager
по очереди вызывает зарегистрированные плагины проверить, не могут
ли они «открыть» или иным способом отобразить файл. Если значение этого
параметра True, то Far Manager будет показывать имя плагина в заголовке
окна, пока тот проверяет файл.

 Значение по умолчанию: False (не показывать имена плагинов).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.PluginMaxReadData
$ #far:config System.PluginMaxReadData#
 Этот числовой параметр определяет максимальный размер данных файла,
используемых, чтобы найти плагин, поддерживающий этот файл.

 Когда пользователь нажимает #Enter# или #Ctrl+PgDn#, Far Manager читает
указанное количество байт от начала файла и передаёт эти данные
зарегистрированным плагинам проверить, не могут ли они «открыть» или
иным способом отобразить файл.

 Минимальное значение 131072 (128 KiB). Максимум ограничен только
размером логического адресного пространства (2^32 - 1 или 2^64 – 1).

 Не рекомендуется задавать значение этого параметра больше 5 MiB.

 Значение по умолчанию: 131072 (0x20000).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.SetAttrFolderRules
$ #far:config System.SetAttrFolderRules#
 Этот логический (Boolean) параметр определяет значение по умолчанию
опции #Обрабатывать вложенные папки# диалога ~Атрибутов~@FileAttrDlg@
файлов при изменении атрибутов одной папки.

 False - ^<wrap>Опция #Обрабатывать вложенные папки# включена; поля даты
и времени очищены.
 True  - Опция #Обрабатывать вложенные папки# выключена; поля даты
и времени заполнены актуальными значениями.

 Значение по умолчанию: True (не обрабатывать вложенные папки).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.CopyBufferSize
$ #far:config System.CopyBufferSize#
 Этот числовой параметр определяет размер буфера, используемого
внутренней процедурой копирования файлов (см. опцию
#Использовать системную функцию копирования# диалога настройки
~Системных параметров~@SystemSettings@).

 Если значение этого параметра равно нулю, то используется размер буфера
по умолчанию, 32768 байт.

 Значение по умолчанию: 0 (размер буфера 32768 байт).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.SubstNameRule
$ #far:config System.SubstNameRule#
 Этот числовой параметр задаёт типы физических носителей, которые будут
опрашиваться, когда Far Manager определяет, какие диски были назначены
командой #SUBST#.

 Far Manager пытается определить, является ли диск назначенным, чтобы
показать соответствующую информацию в ~Меню выбора диска~@DriveDlg@
и ~Панели информации~@InfoPanel@, а также в некоторых других случаях.

 Номера битов:
 0 - Опрашивать съёмные носители;
 1 - Опрашивать диски всех остальных типов.

 Значение по умолчанию: 2 (опрашивать все диски кроме съёмных).
Например, если диск связан с путём на CD-ROM’е, он не будет определён,
как назначенный.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.SubstPluginPrefix
$ #far:config System.SubstPluginPrefix#
 Этот логический (Boolean) параметр управляет тем, добавляет ли Far
Manager префикс плагина к пути до объекта на панели плагина при вставке
этого пути в командную строку (#Ctrl+F#, #Ctrl+[#, и т.д.) или
копировании его в буфер обмена (#Alt+Shift+Ins#, #Ctrl+Alt+Ins#).

 False - ^<wrap>Не вставлять префикс плагина перед путём к объекту
на панели плагина.
 True  - Вставлять префикс плагина, кроме случаев, когда плагин
манипулирует реальными файлами, как это делает #Временная панель#.

 Значение по умолчанию: False (не вставлять префикс плагина).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.CopySecurityOptions
$ #far:config System.CopySecurityOptions#
 Этот числовой параметр управляет начальным состоянием опции
#Права доступа# в диалоге ~копирования / переноса~@CopyFiles@.

 Опция #Права доступа# определяет права доступа, присваиваемые вновь
создаваемым файлам и папкам, и может принимать одно из трёх значений:

 #По умолчанию# - ^<wrap>Права доступа устанавливаются операционной системой;
 #Копировать#   - Копируются права доступа исходных объектов;
 #Наследовать#  - Наследуются права доступа родительской папки.

 Начальное состояние опции #Права доступа# при открытии диалога
управляется тремя битами параметра #System.CopySecurityOptions#. Биты
0, 1 и 2 управляют состоянием опции в диалоге переноса, а биты 3, 4,
и 5 -- в диалоге копирования.

@=
 Диалог     Диалог        ^<wrap>Состояние опции #права доступа#
 переноса   копирования   при открытии диалога
@=
 Бит 0      Бит 3         0 - ^<wrap>#По умолчанию# (значение бита 1 / 4 игнорируется)
                          1 - Управляется битом 1 / 4

 Бит 1      Бит 4         0 - ^<wrap>#Копировать# (если бит 0 / 3 установлен в 1)
                          1 - #Наследовать# (если бит 0 / 3 установлен в 1)

 Бит 2      Бит 5         0 - ^<wrap>Определяется битами 0 и 1 / 3 и 4 этого параметра
                          1 - Последнее установленное пользователем
значение (в пределах текущего сеанса работы Far Manager)

 Значение по умолчанию: 0 (при открытии диалога опция #Права доступа#
всегда устанавливается в значение #По умолчанию#; значения, задаваемые
пользователем, не запоминаются).

 Примеры:

 #0x21# (двоичное 100'001)

 - ^<wrap>В диалоге переноса опция #Права доступа# всегда
устанавливается в значение #Копировать#.
 - В диалоге копирования опция первоначально устанавливается в значение
#По умолчанию#. Далее, в пределах текущего сеанса работы Far Manager,
запоминаются значения, задаваемые пользователем.

 #0x1C# (двоичное 011'100)

 - ^<wrap>В диалоге переноса опция #Права доступа# первоначально
устанавливается в значение #По умолчанию#. Далее, в пределах текущего
сеанса работы Far Manager, запоминаются значения, задаваемые
пользователем.
 - В диалоге копирования опция всегда устанавливать в значение
#Наследовать#.

 Примечание: Параметр #System.CopySecurityOptions# не влияет на создание
ссылок (#Alt+F6#). В этом случае права всегда копируются.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Interface.CursorSize
$ #far:config Interface.CursorSizeX#
 Эти числовые параметры управляют размером курсора в окне консоли Far
Manager. Размер курсора может быть установлен отдельно для режима
вставки и режима замены, а также для оконного и полноэкранного режимов.

@-
 ┌─────────╥───────────────────────┬───────────────────────┐
 │ Режим   ║ Оконный               │ Полноэкранный         │
 ╞═════════╬═══════════════════════╪═══════════════════════╡
 │ Вставка ║ Interface.CursorSize1 │ Interface.CursorSize2 │
 ├─────────╫───────────────────────┼───────────────────────┤
 │ Замена  ║ Interface.CursorSize3 │ Interface.CursorSize4 │
 └─────────╨───────────────────────┴───────────────────────┘
@+

 Эти параметры определяют, какую часть символьной ячейки, в процентах,
занимает курсор. Значения параметров могут изменяться от 1 до 100, что
соответствует изменению курсора от одной горизонтальной линии внизу
ячейки до прямоугольника, заполняющего целую ячейку. Если значение
параметра равно нулю, используется системная настройка консоли.

 Значения по умолчанию:
 Interface.CursorSize1: 15
 Interface.CursorSize2: 10
 Interface.CursorSize3: 99
 Interface.CursorSize4: 99

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.WordDiv
$ #far:config System.WordDiv#
 Этот строковый параметр определяет дополнительные разделители слов,
кроме #пробела# и #табуляции#.

 Значение по умолчанию: #~~!%^&*()+|{}:"<>?`-=\\[];',./#

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@XLat.WordDivForXlat
$ #far:config XLat.WordDivForXlat#
 Этот строковый параметр определяет разделители слов для транслитерации
(функция #XLat#) текущего слова без выделения его.

 Значение по умолчанию: #пробел#, #табуляция# и символы
#!##$%^&*()+|=\\/@?#.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Editor.ReadOnlyLock
$ #far:config Editor.ReadOnlyLock#
 Этот числовой параметр управляет поведением встроенного редактора при
открытии файлов с атрибутами #Read-only#, #Hidden# или #System#.

 Номера битов:
 0 - ^<wrap>Блокировать редактирование файла с атрибутом Read-only;
 1 - Предупреждать при открытии файла с атрибутом Read-only;
 2 - Не используется;
 3 - Не используется;
 4 - Не используется;
 5 - Распространять поведение, заданное битами 0 и 1, на файлы
с атрибутом Hidden;
 6 - Распространять поведение, заданное битами 0 и 1, на файлы
с атрибутом System.

 Значение по умолчанию: 0 (позволять редактировать любые файлы без
предупреждений).

 Например, если значение этого параметра #0x43# (двоичное 0100'0011),
при открытии файлов с атрибутами Read-only и System будет показано
предупреждение; редактирование таких файлов будет заблокировано.

 Изменить этот параметр можно через ~far:config~@FarConfig@. Биты 0 и
1 также управляются опциями #Блокировать редактирование файлов
с атрибутом R/O# и #Предупреждать при открытии файлов с атрибутом R/O#
диалога ~настроек редактора~@EditorSettings@.


@Editor.FileSizeLimit
$ #far:config Editor.FileSizeLimit#
 Этот числовой параметр определят предельный размер файла, при
превышении которого перед открытием файла в редакторе будет показано
предупреждающее сообщение.

 Если значение этого параметра ноль, то предупреждение отключено.
Предельный размер определён в байтах.

 Значение по умолчанию: 0 (размер файла не проверяется, и сообщение
никогда не показывается).

 Примечание: Когда файл открывается в редакторе, содержимое файла
целиком загружается в память, поэтому открывать слишком большие файлы
может быть нежелательно. Предупреждение, включаемое этим параметром,
помогает избежать случайного открытия больших файлов.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.MsWheelDelta
$ #far:config System.MsWheelDelta* & System.MsHWheelDelta*#
 Эти числовые параметры определяют скорость прокрутки при вращении или
наклоне колеса мыши. Скорость прокрутки можно задать по отдельности для
разных направлений и разных областей.

 Поворот колёсика на один щелчок прокручивает на установленное
количество строк по вертикали:

 System.MsWheelDeltaView  - ^<wrap>в программе просмотра
 System.MsWheelDeltaEdit  - во встроенном редакторе
 System.MsWheelDeltaHelp  - на страницах помощи
 System.MsWheelDelta      - в прочих областях

 Наклон колёсика в сторону прокручивает на установленное количество
знаков по горизонтали (Windows Vista и выше):

 System.MsHWheelDeltaView - ^<wrap>в программе просмотра
 System.MsHWheelDeltaEdit - во встроенном редакторе
 System.MsHWheelDelta     - в прочих областях

 Значение по умолчанию для всех параметров: 0 (использовать системные настройки).

 Примечание: Поворот или наклон колёсика при нажатой клавише #Alt#
всегда прокручивает на одну строку или один знак.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@System.CopyTimeRule
$ #far:config System.CopyTimeRule#
 Этот числовой параметр определяет, будет ли отображаться прогресс
(скорость, время и ожидаемое время до окончания) при операции
копирования файлов.

 Номера битов:
 0 - ^<wrap>Если установлен, показывать прогресс при копировании в NUL;
 1 - Если установлен, показывать прогресс при обычных операциях
копирования.

 Значение по умолчанию: 3 (всегда показывать прогресс).

 Примечание: Так как эта функция требует времени для сбора статистики,
то возможно, что при копировании небольших файлов, и если опция
#Показывать общий индикатор копирования# в
~Настройках интерфейса~@InterfSettings@ выключена, прогресс не будет
отображаться вовсе.

 Изменить этот параметр можно через ~far:config~@FarConfig@ или опцией
#Показывать информацию о времени копирования# в ~Настройках
интерфейса~@InterfSettings@. Однако при помощи этой опции можно
установить только значения 0 или 3.


@Policies.ShowHiddenDrives
$ #far:config Policies.ShowHiddenDrives#
 Этот логический (Boolean) параметр определяет, будет ли Far Manager
учитывать групповую политику Windows
#Скрыть выбранные диски из окна «Мой компьютер»#.

 False - ^<wrap>Far Manager показывает только диски, видимые (не
скрытые) в Проводнике Windows;
 True  - Far Manager показывает все диски (игнорирует групповую
политику).

 Значение по умолчанию: True (показывать все диски).

 Примечание: Состояние этой групповой политики сохраняется в значении
#NoDrives# раздела
#\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer# в обоих
кустах #HKLM# и #HKCU# реестра Windows. Если параметр NoDrives в кусте
HKLM установлен в ноль (на локальной машине нет скрытых дисков),
значение в кусте HKCU игнорируется.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Editor.KeepEditorEOL
$ #far:config Editor.KeepEditorEOL#
 Этот логический (Boolean) параметр управляет тем, как переводы строк
в тексте из буфера обмена вставляются в редактируемый файл.

 False - ^<wrap>Переводы строк вставляются без изменений. После операции
вставки переводы строк в редактируемом файле могут иметь разные стили.
 True  - Если файл не пуст, переводы строк во вставленном тексте будут
соответствовать стилю переводов строк редактируемого файла. Если файл
пуст, этот параметр ни на что не влияет, и переводы строк не меняются.

 Значение по умолчанию: True (использовать стиль переводов строк
редактируемого файла).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Editor.AddUnicodeBOM
$ #far:config Editor.AddUnicodeBOM#
 Этот логический (Boolean) параметр определяет, добавляется ли метка
порядка байтов (Byte Order Mark, BOM) в начало файлов, созданных
встроенным редактором и сохранённых в кодировке Юникод (UTF-8, UTF-16LE,
UTF-16BE).

 False - ^<wrap>BOM не добавляется.
 True  - BOM добавляется.

 Значение по умолчанию: True (BOM добавляется).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Editor.NewFileUnixEOL
$ #far:config Editor.NewFileUnixEOL#
 Этот логический (Boolean) параметр определяет стиль переводов строк
в файлах, создаваемых встроенным редактором.

 False - ^<wrap>Файлы создаются с переводами строк стиля Windows (CR LF).
 True  - Файлы создаются с переводами строк стиля Unix (LF).

 Значение по умолчанию: False (переводы строк стиля Windows).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Panel.ShortcutAlwaysChdir
$ #far:config Panel.ShortcutAlwaysChdir#
 Этот логический (Boolean) параметр управляет поведением
~ссылок на папки~@FolderShortcuts@ (комбинации клавиш #ПравыйCtrl+0…9#)
при скрытых панелях.

 False - ^<wrap>Ссылки на папки вставляют путь, связанный со ссылкой,
в командную строку.
 True  - Ссылки на папки меняют текущую папку, даже если панели скрыты.

 Значение по умолчанию: False (вставлять путь, связанный со ссылкой).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Macros.ShowPlayIndicator
$ #far:config Macros.ShowPlayIndicator#
 Этот логический (Boolean) параметр включает или выключает индикатор
воспроизведения макропоследовательности (символ «\2FP\-» в левом
верхнем углу экрана).

 False - ^<wrap>Индикатор выключен.
 True  - Индикатор включён.

 Значение по умолчанию: True (индикатор включён).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Viewer.SearchWrapStop
$ #far:config Viewer.SearchWrapStop#
 Этот параметр с тремя состояниями управляет поведением комбинаций
клавиш продолжения поиска во внутренней программе просмотра
(#Shift+F7#, #Space#, #Alt+F7#) при переходе через начало или конец
файла или точку начала поиска.

 False - ^<wrap>Продолжать поиск при переходе через начало или конец
файла или точку начала поиска, не показывая сообщения.
 True  - Показывать сообщение при переходе через начало или конец файла.
 Other - Показывать сообщение при переходе через точку начала поиска.

 Значение по умолчанию: True (Продолжать поиск, не показывая сообщения).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@XLat.Layouts
$ #far:config XLat.Layouts#
 Этот строковый параметр определят языки ввода (раскладки клавиатуры),
которые Far Manager будет переключать по кругу. Если этот параметр
задан, системные языки ввода будут игнорироваться.

 Этот параметр содержит список шестнадцатеричных идентификаторов языков
ввода, разделённых точкой с запятой (#;#). Например, значение
#0409;0419# (или #04090409;04190419#) используется для переключения
между языками ввода «en-US» и «ru-RU».

 Если указано меньше двух языков ввода, Far Manager будет использовать
языки ввода, установленные в системе.

 Используются только первые 10 языков ввода, остаток списка игнорируется.

 Значение по умолчанию: пустая строка (использовать системные языки ввода).

 См. также Addons\XLat\Russian\Qwerty.farconfig.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@XLat.Flags
$ #far:config XLat.Flags#
 Этот числовой параметр управляет поведением Far Manager API функции
XLat (перекодировка строк в зависимости от раскладки клавиатуры).

 Номера битов:
 0  - ^<wrap>Автоматически переключать раскладку клавиатуры после
операции перекодировки. Far Manager переключает по кругу все системные
раскладки или раскладки, заданные параметром
~XLat.Layouts~@XLat.Layouts@.
 1  - Выдавать звуковой сигнал при переключении раскладки.
 2  - Когда символ не удалось перекодировать по ~таблице~@XLat.Tables@,
Far Manager пытается использовать специальные ~правила~@XLat.Rules@.
Если этот бит установлен, и существует именованное правило,
соответствующее текущей раскладке клавиатуры, то используется это
правило; в противном случае используется одно из трёх нумерованных
правил.
 16 - Перекодировать всю командную строку, если в ней ничего не выделено.

 Значение по умолчанию: 0x00010001 (переключить раскладку клавиатуры
и перекодировать всю командную строку при отсутствии выделенного
блока).

 См. также Addons\XLat\Russian\Qwerty.farconfig.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@XLat.Tables
$ #far:config XLat.Tables#
 Эти строковые параметры задают двунаправленную таблицу перекодировки,
используемую Far Manager API функцией XLat (перекодировка строк
в зависимости от раскладки клавиатуры).

 #XLat.Table1# ^<wrap>определяет список символов национального алфавита,
которые будут заменены на соответствующие латинские символы,
определённые списком #XLat.Table2#.
 #XLat.Table2# определяет список латинских символов, которые будут
заменены на соответствующие символы национального алфавита,
определённые списком #XLat.Table1#.

 Значение по умолчанию: пустая строка (таблица перекодировки не задана).

 Если символ не удаётся перекодировать, используя таблицу, Far Manager
попытается применить специальные ~правила~@XLat.Rules@.

 См. также Addons\XLat\Russian\Qwerty.farconfig.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@XLat.Rules
$ #far:config XLat.Rules#
 Эти строковые параметры задают специальные правила перекодировки,
используемые Far Manager API функцией XLat (перекодировка строк
в зависимости от раскладки клавиатуры).

 Far Manager пытается применить специальные правила, если символ
не удалось перекодировать по ~таблице~@XLat.Tables@.

 Каждое правило состоит из последовательности пар символов. Если символ
в перекодируемой строке совпадает с первым символом пары, он будет
заменён на второй символ пары.

 Если бит 2 (0x04) во ~флагах перекодировки~@XLat.Flags@ равен нулю или
нет именованного правила, соответствующего текущей раскладке
клавиатуры, то будет использоваться одно из трёх нумерованных правил.

 #XLat.Rules1# ^<wrap>применяется, если предыдущий символ
в перекодируемой строке является символом национального алфавита.
 #XLat.Rules2# применяется, если предыдущий символ в перекодируемой
строке является латинским символом.
 #XLat.Rules3# применяется, если предыдущий символ в перекодируемой
строке не является ни символом национального алфавита, ни латинским
символом.

 Именованное правило применяется, если бит 2 (0x04) во
~флагах перекодировки~@XLat.Flags@ равен единице. Чтобы найти
соответствующее правило, Far Manager использует шестнадцатеричное
значение идентификатора текущего языка ввода (раскладки клавиатуры).
Например, если текущая раскладка клавиатуры «en-US», Far Manager поищет
правило с именем #XLat.00000409# и использует его, если оно существует.
В противном случае Far Manager применит нумерованные правила.

 Значение по умолчанию: пустая строка для всех правил (специальные
правила не заданы).

 См. также Addons\XLat\Russian\Qwerty.farconfig.

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Interface.DelHighlightSelected
$ #far:config Interface.DelHighlightSelected#
 Этот логический (Boolean) параметр управляет тем, как удаляемые
элементы показываются в диалоге подтверждения #удаления# файлов
/ папок.

 False - ^<wrap>Удаляемые элементы всегда показываются обычным текстом,
без выделения.
 True  - Если удаляется более одного элемента или удаляемый элемент
не совпадает с элементом под курсором, то удаляемые элементы в диалоге
будут выделены цветом.

 Значение по умолчанию: True (выделять список, если он не совпадает
с элементом под курсором).

 Примечание: Этот параметр не влияет на то, какие элементы будут
удалены, он только управляет тем, как удаляемые элементы будут
отображены в диалоге.

 Изменить эти параметры можно только через ~far:config~@FarConfig@.


@Interface.DelShowSelected
$ #far:config Interface.DelShowSelected#
 Этот числовой параметр управляет количеством элементов, которые
показываются в диалоге подтверждения #удаления# файлов / папок.

 Максимальное количество показываемых элементов равно меньшему
из значения этого параметра и половины высоты окна Far Manager.
Минимальное количество элементов -- один.

 Значение по умолчанию: 10.

 Изменить эти параметры можно только через ~far:config~@FarConfig@.


@History.Config
$ #far:config History.*#
 Эти параметры ограничивают количество и время жизни элементов историй,
перечисленных ниже:

 - история ~команд~@History@ командной строки:
   #History.CommandHistory.Count#
   #History.CommandHistory.Lifetime#

 - история ввода в полях редактирования диалогов:
   #History.DialogHistory.Count#
   #History.DialogHistory.Lifetime#

 - история ~посещения папок~@HistoryFolders@:
   #History.FolderHistory.Count#
   #History.FolderHistory.Lifetime#

 - история ~просмотра и редактирования~@HistoryViews@ файлов:
   #History.ViewEditHistory.Count#
   #History.ViewEditHistory.Lifetime#

 По умолчанию:
 - максимальный размер истории (*.Count): 1000 элементов
 - время жизни элемента (*.Lifetime): 90 дней

 Изменить эти параметры можно только через ~far:config~@FarConfig@.


@Editor.F8CPs
$ #far:config Editor.F8CPs#
$ #far:config Viewer.F8CPs#
 Эти строковые параметры определяют кодовые страницы, которые будут
переключаться по кругу при нажатии кнопки #F8# в ~редакторе~@Editor@
или ~программе просмотра~@Viewer@.

 Значение каждого из этих параметров -- это список кодовых страниц или
символических имён, перечисленных ниже. В символических именах регистр
не учитывается. Повторяющиеся кодовые страницы, а также
не поддерживаемые кодовые страницы, игнорируются.

 - #ANSI#    ^<wrap>варианты #ACP#, #WIN#
 - #OEM#     варианты #OEMCP#, #DOS#
 - #UTF8#    вариант #UTF-8#
 - #DEFAULT# обозначает кодовую страницу по умолчанию, определённую
в диалоге настроек ~редактора~@EditorSettings@ или
~программы просмотра~@ViewerSettings@.

 Если строка пуста или не содержит ни одной поддерживаемой кодовой
страницы, используются кодовые страницы ANSI и OEM.

 Специальное значение параметра #-1# обозначает #ANSI;OEM;Default#.

 Пример: #ANSI,OEM,65001#.

 Значение по умолчанию: пустая строка (кодовые страницы ANSI и OEM).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Panel.Tree.TurnOffCompletely
$ #far:config Panel.Tree.TurnOffCompletely#
 Этот логический (Boolean) параметр включает или отключает все операции
работы с деревом каталогов:

 - ^<wrap>Режим ~дерева папок~@TreePanel@ в
~меню левой и правой панелей~@LeftRightMenu@;
 - Горячую клавишу включения и выключения дерева папок (#Ctrl+T#);
 - Команду ~поиска папки~@FindFolder@ на панелях (#Alt+F10#);
 - Операции работы с деревом каталогов в диалоге
~копирования, переноса и переименования~@CopyFiles@ (#F10#, #Alt+F10#
и #Shift+F10#).

 False - ^<wrap>Операции работы с деревом каталогов #включены#.
 True  - Все операции работы с деревом каталогов #отключены#.

 Примечание: Если операции работы с деревом каталогов отключены, файлы
кэша дерева каталогов, даже если они уже существуют, не обновляются при
создании, удалении или переименовании каталогов.

 Значение по умолчанию: True (все операции работы с деревом каталогов отключены).

 Изменить этот параметр можно только через ~far:config~@FarConfig@.


@Index
$ #Индекс файла помощи#
<%INDEX%>
