m4_include(`farversion.m4')m4_dnl
.Language=Russian,Russian (Русский)
.Options CtrlColorChar=\
.Options CtrlStartPosChar=^<wrap>

@CodepagesSettings=CodepagesMenu
@ConfirmationsSettings=ConfirmDlg
@DescriptionsSettings=FileDiz
@Editor.WordDiv=System.WordDiv
@History.CommandHistory.Count=History.Config
@History.CommandHistory.Lifetime=History.Config
@History.DialogHistory.Count=History.Config
@History.DialogHistory.Lifetime=History.Config
@History.FolderHistory.Count=History.Config
@History.FolderHistory.Lifetime=History.Config
@History.ViewEditHistory.Count=History.Config
@History.ViewEditHistory.Lifetime=History.Config
@Interface.CompletionSettings=AutoCompleteSettings
@Interface.CursorSize1=Interface.CursorSize
@Interface.CursorSize2=Interface.CursorSize
@Interface.CursorSize3=Interface.CursorSize
@Interface.CursorSize4=Interface.CursorSize
@Interface.DelShowSelected=Interface.DelHighlightSelected
@Interface.EditorTitleFormat=TitleFormat
@Interface.ViewerTitleFormat=TitleFormat
@InterfaceSettings=InterfSettings
@Panel.InfoSettings=InfoPanel
@Panel.Layout.DoubleGlobalColumnSeparator=PanelSettings
@Panel.Left=PanelCmdSort
@Panel.Right=PanelCmdSort
@Panel.Tree.AutoChangeFolder=TreeSettings
@Panel.Tree.MinTreeCount=TreeSettings
@ScreenSettings=InterfSettings
@System.MsHWheelDelta=System.MsWheelDelta
@System.MsHWheelDeltaEdit=System.MsWheelDelta
@System.MsHWheelDeltaView=System.MsWheelDelta
@System.MsWheelDeltaEdit=System.MsWheelDelta
@System.MsWheelDeltaHelp=System.MsWheelDelta
@System.MsWheelDeltaView=System.MsWheelDelta
@Viewer.F8CPs=Editor.F8CPs
@XLat.Rules1=XLat.Tables
@XLat.Rules2=XLat.Tables
@XLat.Rules3=XLat.Tables
@XLat.Table1=XLat.Tables
@XLat.Table2=XLat.Tables

@Contents
$^#Программа управления файлами и архивами#
`$^#'FULLVERSIONNOBRACES`#'
$^#Copyright © 1996-2000 Eugene Roshal#
`$^#Copyright © 2000-'COPYRIGHTYEAR` Far Group#'
   ~Индекс файла помощи~@Index@
   ~Как пользоваться помощью~@Help@

   ~Что такое Far~@About@
   ~Лицензия~@License@

   ~Параметры командной строки~@CmdLine@
   ~Клавиатурные команды~@KeyRef@
   ~Поддержка плагинов~@Plugins@
   ~Обзор возможностей плагинов~@PluginsReviews@

   ~Панели:~@Panels@  ~Панель файлов~@FilePanel@
            ~Дерево папок~@TreePanel@
            ~Панель информации~@InfoPanel@
            ~Панель быстрого просмотра~@QViewPanel@
            ~Перетаскивание файлов~@DragAndDrop@
            ~Настройка режимов просмотра панели файлов~@PanelViewModes@
            ~Пометка файлов~@SelectFiles@

   ~Меню:~@Menus@    ~Меню левой и правой панелей~@LeftRightMenu@
            ~Меню файлов~@FilesMenu@
            ~Меню команд~@CmdMenu@
            ~Меню параметров~@OptMenu@

   ~Поиск файла~@FindFile@
   ~История команд~@History@
   ~Поиск папки~@FindFolder@
   ~Сравнение папок~@CompFolders@
   ~Меню пользователя~@UserMenu@
   ~Меню выбора диска~@DriveDlg@

   ~Ассоциации файлов~@FileAssoc@
   ~Команды операционной системы~@OSCommands@
   ~Ссылки на папки~@FolderShortcuts@
   ~Меню фильтров~@FiltersMenu@
   ~Переключение между экранами~@ScrSwitch@
   ~Список задач~@TaskList@
   ~Список устройств~@HotPlugList@

   ~Системные параметры~@SystemSettings@
   ~Настройки панели~@PanelSettings@
   ~Настройки интерфейса~@InterfSettings@
   ~Настройки дерева папок~@TreeSettings@
   ~Настройки диалогов~@DialogSettings@
   ~Настройки меню~@VMenuSettings@
   ~Настройки командной строки~@CmdlineSettings@

   ~Раскраска файлов и группы сортировки~@Highlight@
   ~Описания файлов~@FileDiz@
   ~Настройки программы просмотра~@ViewerSettings@
   ~Настройки редактора~@EditorSettings@

   ~Копирование, перенос, переименование и создание ссылок~@CopyFiles@

   ~Встроенная программа просмотра~@Viewer@
   ~Встроенный редактор~@Editor@

   ~Маски файлов~@FileMasks@
   ~Клавиатурные макрокоманды~@KeyMacro@


@Help
$ # Far: как пользоваться помощью#
    В оглавлении справочной системы имеются ссылки (они функционируют примерно
так же, как и гиперссылки, знакомые каждому пользователю Интернет), которые
указывают на разделы с более подробной информацией. Дополнительно на главной
странице находится "~Индекс файла помощи~@Index@", он показывает оглавления
всех страничек (топиков) имеющихся в файле помощи и, в ряде случаев, позволяет
быстрее найти необходимую информацию.

    Для перемещения между ссылками вы можете использовать #Tab# и #Shift+Tab#.
Нажатие #Enter# вызовет страницу, соответствующую выбранной ссылке. Этот же
результат можно получить нажав кнопку "мыши" на требуемой ссылке.

    Если текст помещается в окне помощи не полностью, то появляется полоса
прокрутки. В этом случае текст можно перемещать вверх и вниз с помощью #клавиш#
#управления курсором#.

    Нажатие #Alt+F1# или #BS# приводит к переходу на предыдущую страницу.
#Shift+F1# вызывает содержание помощи.

    Нажмите #Shift+F2#, чтобы получить помощь по ~плагинам~@Plugins@.

    Нажмите #F7#, чтобы найти подстроку в текущем файле помощи. Результаты
поиска будут выведены в виде ссылок на темы.

    По умолчанию "#Помощь#" показывается в свёрнутом окне, развернуть его можно
при помощи клавиши #F5# "#Размер#", повторное нажатие #F5# вернёт размер окна в
первоначальное состояние.


@About
$ # Far: что это такое#
    #Far# - это работающая в текстовом режиме программа управления файлами для
Windows, которая обеспечивает обработку файлов с #длинными именами# и имеет
обширный набор дополнительных функций.

    #Far# является #freeware# и #open source# программой, распространяемой
под модифицированной BSD ~лицензией~@License@.

    #Far# позволяет работать с #архивами#. При этом файлы в архивах
обрабатываются аналогично файлам в папках. #Far# сам преобразует ваши команды в
соответствующие вызовы внешних архиваторов.

    #Far# также обеспечивает значительное количество сервисных функций.


@License
$ # Far: Лицензия#

 Copyright © 1996 Eugene Roshal
 Copyright © 2000 Far Group
 All rights reserved.

 Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
 1. ^<wrap>Redistributions of source code must retain the above copyright
notice, this list of conditions and the following disclaimer.
 2. Redistributions in binary form must reproduce the above copyright
notice, this list of conditions and the following disclaimer in the
documentation and/or other materials provided with the distribution.
 3. The name of the authors may not be used to endorse or promote products
derived from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.


@CmdLine
$ #Far: параметры командной строки#
  В командной строке могут быть использованы следующие параметры:

  #/e[<строка>[:<позиция>]] <filename>#
  Редактирование указанного файла. После /e можно дополнительно указать строку
и позицию в строке, устанавливаемые после запуска редактора.
  Например: far /e70:2 readme.

  #/p[<path>]#
  Искать плагины в папке, указанной в <path>.
  Можно указать несколько путей поиска, разделённых символом ';'. При указании
пути поиска можно использовать переменные среды.

  Например: #far /p%USERPROFILE%\\Far\\Plugins#

  #/co#
  Заставляет Far загружать плагины только из кэша. Загрузка при этом происходит
быстрее, но новые или изменённые плагины не обнаруживаются. Имеет смысл применять
ТОЛЬКО при стабильном списке плагинов. После добавления, замены или удаления плагинов
надо загрузить Far без этого параметра. Если кэша нет, то плагины загружаться не будут.

  Замечания относительно ключей /p и /co:

  - ^<wrap>если указан пустой /p, то Far запустится без плагинов;
  - ^<wrap>если указан /p<path>, то загрузятся только плагины из <path>;
  - ^<wrap>если указан только ключ /co и кэш плагинов не пуст, то
загружаются плагины из кэша;
  - ^<wrap>ключ /co игнорируется, если также указан /p;
  - ^<wrap>если не указаны ключи /p и /co, то загрузятся плагины из папки
'Plugins', находящейся одной папке с Far.exe и из папки 'Plugins', находящейся
в профиле пользователя (по умолчанию #%APPDATA%\\Far Manager\\Profile#).

  #/m#
  При старте Far не будет загружать макрокоманды.

  #/ma#
  При старте Far не будет выполнять макрокоманды с опцией "Выполнять после запуска Far".

  #/s <profilepath> [<localprofilepath>]#
  Конфигурационные файлы искать в каталоге <profilepath> [<localprofilepath>]
  (перекрывает значение UserProfileDir [UserLocalProfileDir] из Far.exe.ini).

  #/u <username>#
  Позволяет использовать раздельные настройки для различных пользователей (влияет только на плагины от Far Manager 1.x)
  Например: far /u guest

  Far Manager установит ~переменную среды~@FAREnv@ "FARUSER" в значение, равное <username>.

  #/v <filename>#
  Просмотр указанного файла. Если в качестве <filename> использовано `#-#', данные
будут читаться из stdin (стандартного входного потока).

  Например, "dir|far /v -" выведет результат работы команды dir.

  Если при использовании '-' входной поток пуст (например, вы не указали команду dir
в указанном примере), то Far будет ждать завершения входного потока пока вы не нажмёте Ctrl+Break.

  #/w[-]#
  Подстраиваться под размер консольного окна вместо консольного буфера или наоборот.

  #/t templateprofile#
  Задаёт файл в котором располагаются умолчательные настройки, которые применяются,
если какой-либо из конфигурационных файлов не существует. Параметр templateprofile
перекрывает значение TemplateProfile из Far.exe.ini.

  #/title[:<title>]#
  Если строка <title> присутствует, использовать её как заголовок окна;
иначе наследовать заголовок окна консоли. Макрос #%Default# в заданной
строке заголовка будет заменяться на стандартный, зависящий от контекста
заголовок окна Far.

  #/clearcache [profilepath [localprofilepath]]#
  Очистить кэш плагинов и завершить работу.
  Необязательный параметр profilepath задаёт полный путь к конфигурационным файлам.
Параметр profilepath перекрывает значение UserProfileDir из Far.exe.ini.
Параметр localprofilepath перекрывает значение UserLocalProfileDir из Far.exe.ini.

  #/export <out.farconfig> [profilepath [localprofilepath]]#
  Экспортировать все настройки в файл out.farconfig и завершить работу.
  Необязательный параметр profilepath задаёт полный путь к конфигурационным файлам.
Параметр profilepath перекрывает значение UserProfileDir из Far.exe.ini.
Параметр localprofilepath перекрывает значение UserLocalProfileDir из Far.exe.ini.

  #/import <in.farconfig> [profilepath [localprofilepath]]#
  Импортировать все настройки из файла in.farconfig и завершить работу.
  Необязательный параметр profilepath задаёт полный путь к конфигурационным файлам.
Параметр profilepath перекрывает значение UserProfileDir из Far.exe.ini.
Параметр localprofilepath перекрывает значение UserLocalProfileDir из Far.exe.ini.

  #/ro#
  Работа без сохранения изменений в базах настроек. Этот режим позволяет работать
с настройками доступными только для чтения, в том числе на защищённых от записи носителях.
Опция перекрывает значение ReadOnlyConfig из Far.exe.ini.

  #/ro-#
  Нормальный (Read-Write) режим работы с БД настроек.
Опция перекрывает значение ReadOnlyConfig из Far.exe.ini.

  #/set:<parameter>=<value>#
  Override the configuration parameter, see ~far:config~@FarConfig@ for details.

  В командной строке можно указать не более двух путей (к каталогам, файлам, архивам)
или двух команд с префиксом плагина. Первый путь для активной панели, второй - для пассивной:
  - ^<wrap>для каталогов и архивов Far покажет их содержимое;
  - ^<wrap>для файлов - произойдёт переход в каталог с файлом и позиционирование на указанный файл, если он существует;
  - ^<wrap>при указании префиксов плагинов (допускается смешанное использование с обычными путями) сначала выполняется
команда для пассивной панели (пассивная панель при этом временно активируется).
Односимвольные префиксы A-Z, или совпадающие с именем активного диска игнорируются.
  Пример: far arc:c:\\Far20.7z "lua:msgbox('Far Manager','Successfully started')"


@KeyRef
$ #Клавиатурные команды#

 ~Команды управления панелями~@PanelCmd@

 ~Командная строка~@CmdLineCmd@

 ~Управление файлами и сервисные команды~@FuncCmd@

 ~Мышь: поддержка колеса~@MsWheel@

 ~Команды управления меню~@MenuCmd@

 ~Общие команды~@MiscCmd@

 ~Специальные команды~@SpecCmd@


@MenuCmd
$ #Команды управления меню#
 #Общие команды для меню и выпадающих списков#

  Фильтровать элементы меню или списка               #Ctrl+Alt+F,RAlt#
  Зафиксировать фильтр                                    #Ctrl+Alt+L#

  См. также список ~макроклавиш~@KeyMacroMenuList@, доступных в меню.


@PanelCmd
$ #Команды управления панелями#
 #Общие команды#

  Изменить активную панель                                       #Tab#
  Поменять панели местами                                     #Ctrl+U#
  Перечитать содержимое панели                                #Ctrl+R#
  Убрать/показать информационную панель                       #Ctrl+L#
  Убрать/показать ~панель быстрого просмотра~@QViewPanel@                   #Ctrl+Q#
  Убрать/показать ~дерево папок~@TreePanel@                                #Ctrl+T#
  Убрать/показать обе панели                                  #Ctrl+O#
  Временно убрать обе панели                          #Ctrl+Alt+Shift#
   (работает до тех пор, пока удерживаем эти клавиши)
  Убрать/показать неактивную панель                           #Ctrl+P#
  Убрать/показать левую панель                               #Ctrl+F1#
  Убрать/показать правую панель                              #Ctrl+F2#
  Изменить высоту панелей                          #Ctrl+Up,Ctrl+Down#
  Изменить высоту текущей панели       #Ctrl+Shift+Up,Ctrl+Shift+Down#
  Изменить ширину (при пустой командной строке) #Ctrl+Left,Ctrl+Right#
  Восстановить ширину панелей по умолчанию              #Ctrl+Numpad5#
  Восстановить высоту панелей по умолчанию          #Ctrl+Alt+Numpad5#
  Спрятать/Показать линейку функциональных клавиш             #Ctrl+B#
  Переключение режима показа общего размера файлов и    #Ctrl+Shift+S#
   свободного места в байтах (если можно) или с суффиксами К/М/Г/Т

 #Команды файловой панели#

  ~Пометить/снять пометку файла~@SelectFiles@            #Ins, Shift+Клавиши курсора#
                                          #Щелчок правой кнопкой мыши#
  Пометить группу                                             #Gray +#
  Снять пометку с группы                                      #Gray -#
  Инвертировать пометку                                       #Gray *#
  Пометить файлы с расширением как у текущего файла    #Ctrl+<Gray +>#
  Снять пометку с файлов с расширением, как у текущего #Ctrl+<Gray ->#
  Инвертировать пометку, включая папки                 #Ctrl+<Gray *>#
   (без учёта состояния командной строки)
  Пометить файлы с именем, как у текущего файла         #Alt+<Gray +>#
  Снять пометку с файлов с именем, как у текущего файла #Alt+<Gray ->#
  Пометить все файлы                                  #Shift+<Gray +>#
  Снять пометку со всех файлов                        #Shift+<Gray ->#
  Восстановить предыдущую пометку                             #Ctrl+M#

  Прокрутка длинных имён и описаний               #Alt+Left,Alt+Right#
                                                    #Alt+Home,Alt+End#

  Установить краткий режим просмотра                     #ЛевыйCtrl+1#
  Установить средний режим просмотра                     #ЛевыйCtrl+2#
  Установить полный режим просмотра                      #ЛевыйCtrl+3#
  Установить широкий режим просмотра                     #ЛевыйCtrl+4#
  Установить детальный режим просмотра                   #ЛевыйCtrl+5#
  Установить режим просмотра описаний                    #ЛевыйCtrl+6#
  Установить режим просмотра длинных описаний            #ЛевыйCtrl+7#
  Установить режим просмотра владельцев файлов           #ЛевыйCtrl+8#
  Установить режим просмотра ссылок файлов               #ЛевыйCtrl+9#
  Установить альтернативный полный режим просмотра       #ЛевыйCtrl+0#

  Убрать/показать файлы с атрибутом "Скрытый" и "Системный"   #Ctrl+H#
  Переключить отображение длинных/коротких имён файлов        #Ctrl+N#

  Спрятать/Показать левую панель                             #Ctrl+F1#
  Спрятать/Показать правую панель                            #Ctrl+F2#

  Сортировать файлы активной панели по имени                 #Ctrl+F3#
  Сортировать файлы активной панели по расширению            #Ctrl+F4#
  Сортировать файлы активной панели по времени записи        #Ctrl+F5#
  Сортировать файлы активной панели по размеру               #Ctrl+F6#
  Не сортировать файлы активной панели                       #Ctrl+F7#
  Сортировать файлы активной панели по времени создания      #Ctrl+F8#
  Сортировать файлы активной панели по времени доступа       #Ctrl+F9#
  Сортировать файлы активной панели по описаниям            #Ctrl+F10#
  Сортировать файлы активной панели по владельцу            #Ctrl+F11#
  Вывести меню ~режимов сортировки~@PanelCmdSort@                           #Ctrl+F12#
  Использовать сортировку по группам                       #Shift+F11#
  Показывать помеченные файлы первыми                      #Shift+F12#

  Создать ~ссылку на папку~@FolderShortcuts@               #Ctrl+Shift+0# .. #Ctrl+Shift+9#
  Перейти по ссылке на папку            #ПравыйCtrl+0# .. #ПравыйCtrl+9#

    Если активная панель является ~панелью быстрого просмотра~@QViewPanel@,
    ~деревом каталогов~@TreePanel@ или ~информационной панелью~@InfoPanel@, то каталог
    меняется не на активной, а на пассивной панели.

  Поместить помеченные имена в Буфер Обмена                 #Ctrl+Ins#
   (при пустой командной строке)
  Поместить помеченные файлы в Буфер Обмена          #Ctrl+C, RCtrl+C#
   (без учёта состояния командной строки)
   ^<wrap>При копировании имён файлов с панели в буфер обмена скопированные файлы 
могут быть вставлены в других приложениях (Проводник и т.п.).
  Поместить помеченные имена в Буфер Обмена           #Ctrl+Shift+Ins#
   (без учёта состояния командной строки)
  Поместить помеченные полные имена в Буфер Обмена     #Alt+Shift+Ins#
   (без учёта состояния командной строки)
  Поместить сетевые (UNC) имена помеченных файлов       #Ctrl+Alt+Ins#
   в Буфер Обмена (без учёта состояния командной
   строки)

  См. также список ~макроклавиш~@KeyMacroShellList@, доступных в панелях.

  Примечания:

  1. ^<wrap>Если включена опция "Разрешить обратную сортировку" в диалоге
~Настроек панели~@PanelSettings@, то повторное нажатие одной и той же клавиши
сортировки файлов приводит к смене направления сортировки с возрастающей на убывающую и наоборот;

  2. ^<wrap>Комбинации Alt+Left and Alt+Right, используемые для прокрутки
длинных имён и описаний, не работают с клавишами Left и Right, расположенными
на цифровой клавиатуре, потому что эти клавиши используются для ввода символов
через их десятичные коды.

  3. ^<wrap>Комбинация клавиш #Ctrl+Alt+Ins# работает по следующим правилам:
       ^<wrap>*для сетевых дисков - сетевое (UNC) имя файлового объекта;
       ^<wrap>*для локальных дисков - полное имя с учётом ~символических~@HardSymLink@ ссылок.

  4. ^<wrap>Комбинации клавиш #Ctrl+Ins#, #Alt+Shift+Ins# и #Ctrl+Alt+Ins# обрабатывают
имя "#..#" как имя текущей папки.

@PanelCmdSort
$ #Режимы сортировки#
    Меню режимов сортировки вызывается комбинацией #Ctrl+F12# и применяется для
активной в данный момент панели. Доступны следующие режимы сортировки панели:

  Сортировать файлы по имени                                 #Ctrl+F3#
  Сортировать файлы по расширению                            #Ctrl+F4#
  Сортировать файлы по времени записи                        #Ctrl+F5#
  Сортировать файлы по размеру                               #Ctrl+F6#
  Не сортировать файлы                                       #Ctrl+F7#
  Сортировать файлы по времени создания                      #Ctrl+F8#
  Сортировать файлы по времени доступа                       #Ctrl+F9#
  Сортировать файлы по описаниям                            #Ctrl+F10#
  Сортировать файлы по владельцу                            #Ctrl+F11#

  Клавиша #+# устанавливает прямую сортировку.
  Клавиша #-# устанавливает обратную сортировку.
  Клавиша #*# меняет сортировку на обратную.

  Использовать сортировку по группам                       #Shift+F11#
  Показывать помеченные файлы первыми                      #Shift+F12#

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@FastFind
$ #Быстрый поиск в панелях#
    Для позиционирования на файл можно воспользоваться операцией #быстрого#
#поиска# по первым буквам имени. Для этого, удерживая клавишу #Alt# (или
#Alt+Shift#), набирайте имя требуемого файла, пока на него не переместится
курсор.

    С помощью #Ctrl+Enter# можно циклически перемещаться по элементам панели в
соответствии с введённой в строке файловой маской. #Ctrl+Shift+Enter# позволяет
перемещаться по элементам в обратном направлении.

    Кроме обычных символов в имени файла также можно использовать символы '#*#'
и '#?#'.

    Вставка содержимого буфера обмена (клавишами #Ctrl+V# или #Shift+Ins#) в
окно быстрого поиска производится до тех пор, пока есть совпадение.

    В процессе набора имени можно применять функцию транслитерации при
ошибочной раскладке клавиатуры. В этом случае Far перекодирует набранный текст
и пытается найти первое совпадение нового имени. Подробнее о назначении клавиш
для транслитерации см. ~XLat.Flags~@XLat.Flags@.

   См. также список ~макроклавиш~@KeyMacroSearchList@, доступных в быстром поиске файла.


@CmdLineCmd
$ #Командная строка#
    #Общие команды#

  Символ влево                                           #Left,Ctrl+S#
  Символ вправо                                         #Right,Ctrl+D#
  Слово влево                                              #Ctrl+Left#
  Слово вправо                                            #Ctrl+Right#
  В начало строки                                          #Ctrl+Home#
  В конец строки                                            #Ctrl+End#
  Удалить символ                                                 #Del#
  Удалить символ слева                                            #BS#
  Удалить до конца строки                                     #Ctrl+K#
  Удалить слово слева                                        #Ctrl+BS#
  Удалить слово справа                                      #Ctrl+Del#
  Рассматривать следующую комбинацию клавиш как код           #Ctrl+Q#
  Копировать в Буфер Обмена                                 #Ctrl+Ins#
  Вставить из Буфера Обмена                                #Shift+Ins#
  Предыдущая команда                                          #Ctrl+E#
  Следующая команда                                           #Ctrl+X#
  Очистить командную строку                                   #Ctrl+Y#

    #Команды вставки#

  Вставить имя файла из активной панели            #Ctrl+J,Ctrl+Enter#

     В режиме ~быстрого поиска~@FastFind@ #Ctrl+Enter# не вставляет имя
     файла, а производит циклический обход по элементам
     файловой панели.

  Вставить имя файла из пассивной панели            #Ctrl+Shift+Enter#
  Вставить полное имя файла из активной панели                #Ctrl+F#
  Вставить полное имя файла из пассивной панели               #Ctrl+;#
  Вставить сетевое (UNC) имя файла из активной панели     #Ctrl+Alt+F#
  Вставить сетевое (UNC) имя файла из пассивной панели    #Ctrl+Alt+;#

  Вставить путь из левой панели                               #Ctrl+[#
  Вставить путь из правой панели                              #Ctrl+]#
  Вставить сетевой (UNC) путь из левой панели             #Ctrl+Alt+[#
  Вставить сетевой (UNC) путь из правой панели            #Ctrl+Alt+]#

  Вставить путь из активной панели                      #Ctrl+Shift+[#
  Вставить путь из пассивной панели                     #Ctrl+Shift+]#
  Вставить сетевой (UNC) путь из активной панели         #Alt+Shift+[#
  Вставить сетевой (UNC) путь из пассивной панели        #Alt+Shift+]#

  Примечания:

  1. ^<wrap>Если командная строка пуста, #Ctrl+Ins# будет копировать имена
выбранных в панели файлов в Буфер Обмена так же, как и #Ctrl+Shift+Ins#
(см. ~Команды управления панелями~@PanelCmd@);

  2. ^<wrap>#Ctrl+End#, нажатая в конце командной строки, заменяет её текущее
содержимое командой из ~истории команд~@History@, начинающейся с уже введённых
букв, если такая команда существует. Чтобы перейти к следующей такой команде,
вы можете нажать #Ctrl+End# повторно.

  3. ^<wrap>Большинство из описанных выше команд действительно для всех строк
редактирования, включая строки в диалогах и встроенный редактор.

  4. ^<wrap>#Alt+Shift+Left#, #Alt+Shift+Right#, #Alt+Shift+Home# и #Alt+Shift+End#
выделяют блок в командной строке независимо от состояния панелей.

  5. ^<wrap>Комбинации клавиш, позволяющие получить сетевое (UNC) имя файлового
объекта, работают по следующим правилам:
       ^<wrap>* для сетевых дисков - сетевое (UNC) имя файлового объекта;
       ^<wrap>* для локальных дисков - полное имя с учётом ~символических~@HardSymLink@ ссылок.


@FuncCmd
$ #Команды управления панелями - сервисные команды#
  Помощь                                                          #F1#

  Вызвать ~пользовательское меню~@UserMenu@                                   #F2#

  Просмотр                                #Ctrl+Shift+F3, Numpad5, F3#

    Если #Numpad5# или #F3# нажаты на файле, они вызывают
~встроенную~@Viewer@, внешнюю или ~ассоциированную~@FileAssoc@ программу
просмотра, в зависимости от типа файла и ~настроек программы просмотра~@ViewerSettings@.
    #Ctrl+Shift+F3# всегда вызывает встроенную программу просмотра, вне
зависимости от файловых ассоциаций.
    При нажатии любой из этих клавиш на папке вычисляются и показываются
размеры выбранных папок.

  Редактирование, Распаковка                       #Ctrl+Shift+F4, F4#

    #F4# вызывает ~встроенный~@Editor@, внешний или ~ассоциированный~@FileAssoc@
редактор, в зависимости от типа файла и ~настроек редактора~@EditorSettings@.
    #Ctrl+Shift+F4# всегда вызывает встроенный редактор, вне зависимости от
файловых ассоциаций.
    #F4# и #Ctrl+Shift+F4# для папок вызывают диалог смены файловых ~атрибутов~@FileAttrDlg@.

  ~Копирование~@CopyFiles@                                                     #F5#

    Копирует файлы и папки. Если вы хотите создать папку назначения перед
копированием, добавьте к её имени обратную черту (\\).

  ~Переименование или перенос~@CopyFiles@                                      #F6#

    Переименование или перенос файлов и папок. Если вы хотите создать папку
назначения перед переносом, добавьте к её имени обратную черту (\\).

  ~Создание новой папки~@MakeFolder@                                            #F7#

  ~Удаление файлов и папок~@DeleteFile@                    #Shift+Del, Shift+F8, F8#

  ~Уничтожение файлов и папок~@DeleteFile@                                 #Alt+Del#

  Показать горизонтальное ~меню~@Menus@                                    #F9#

  Завершить работу с Far                                         #F10#

  Показать команды ~плагинов~@Plugins@                          #F11#

  Изменить текущий диск в левой панели                        #Alt+F1#

  Изменить текущий диск в правой панели                       #Alt+F2#

  Встроенная/внешняя программа просмотра                      #Alt+F3#

  Вызывает в зависимости от типа файла
~ассоциированную программу просмотра~@FileAssoc@ или внешнюю программу
просмотра, указанную в ~настройках программы просмотра~@ViewerSettings@,
если по умолчанию используется внутренняя, или внутреннюю,
если по умолчанию используется внешняя.

  Встроенный/внешний редактор                                 #Alt+F4#

    Вызывает в зависимости от типа файла ~ассоциированный редактор~@FileAssoc@
или внешний редактор, указанный в ~настройках~@EditorSettings@, если по
умолчанию используется внутренний, и внутренний, если по умолчанию используется
внешний.

  Печать файлов                                               #Alt+F5#

    Если установлен плагин "Print Manager", то печать выделенных файлов
осуществляется через него, иначе - средствами Far.

  Создание ~ссылок~@HardSymLink@ файлов и папок                              #Alt+F6#

    Используя жёсткие ссылки файлов, вы можете иметь несколько различных имён
файлов, ссылающихся на одни и те же данные.

  Произвести ~поиск файла~@FindFile@                                      #Alt+F7#

  Показать ~историю команд~@History@                                     #Alt+F8#

  Изменение размеров окна Far Manager                         #Alt+F9#

    В оконном режиме переключение происходит с нормального до максимально
допустимого размера консольного окна и обратно. В полноэкранном режиме #Alt+F9#
переключает экран с 25 линий на 50 и обратно. Подробнее см. параметр ~Interface.AltF9~@Interface.AltF9@.

  Настройка параметров ~плагинов~@Plugins@                         #Alt+Shift+F9#

  Произвести ~поиск папки~@FindFolder@                                     #Alt+F10#

  Показать ~историю просмотра и редактирования~@HistoryViews@                #Alt+F11#

  Показать ~историю папок~@HistoryFolders@                                     #Alt+F12#

  Добавить файлы к архиву                                   #Shift+F1#
  Извлечь файлы из архива                                   #Shift+F2#
  Выполнить команды управления архивом                      #Shift+F3#
  Редактировать ~новый файл~@FileOpenCreate@                                  #Shift+F4#

    При создании нового файла используется кодовая страница, выбранная в
последнем открытом редакторе. Если редактор открывается впервые в текущей
сессии Far, используется кодовая страница по умолчанию.

  Копирование файла под курсором                            #Shift+F5#
  Переименование или перенос файла под курсором             #Shift+F6#

    Для папки: если заданный относительный или абсолютный путь соответствует
существующей папке, то происходит перемещение в эту папку.

    Например, при перемещении #c:\folder1\# в #d:\folder2\#:
  - если #d:\folder2\# существует, то содержимое #c:\folder1\# переместится в
#d:\folder2\folder1\#;
  - в противном случае содержимое #c:\folder1\# переместится во
вновь созданную папку #d:\folder2\#.

  ~Удаление файла~@DeleteFile@ под курсором                               #Shift+F8#
  Сохранить конфигурацию                                    #Shift+F9#
  Выбрать последний выполненный пункт меню                 #Shift+F10#

  Запуск, смена папки, вход в архив                            #Enter#
  Запуск в отдельном окне                                #Shift+Enter#
  Запуск от имени администратора                      #Ctrl+Alt+Enter#

    #Shift+Enter# для папки вызывает Проводник с показом содержимого выбранной
папки. Для того, чтобы в Проводнике показать корневую папку, нужно нажать
#Shift+Enter# на требуемом диске в ~Меню выбора диска~@DriveDlg@.
#Shift+Enter# на папке с именем "#..#" открывает в Проводнике текущую папку.

  Сменить папку на корневую                                   #Ctrl+\\#

  Смена папки, вход в архив                        #Ctrl+[Shift+]PgDn#
  (включая в SFX архив)

    Если курсор указывает на папку, то производится смена текущей папки на
указываемую. Если курсор указывает на файл, то, в зависимости от типа файла,
выполняется ~ассоциированная команда~@FileAssoc@, или происходит вход в архив.
    #Ctrl+Shift+PgDn# всегда инициирует вход в архив, вне зависимости от
файловых ассоциаций.


  Перейти в папку уровнем выше                             #Ctrl+PgUp#

  На #Ctrl+PgUp# в корневой папке влияет опция
"~Использовать Ctrl+PgUp для выбора диска~@InterfSettings@".

  Создать ссылку на текущую папку                    #Ctrl+Shift+0..9#
  Использовать ссылку на папку                       #ПравыйCtrl+0..9#

  Установить ~файловые атрибуты~@FileAttrDlg@                                #Ctrl+A#
  ~Применить команду~@ApplyCmd@ к помеченным файлам                       #Ctrl+G#
  Добавить ~описания~@FileDiz@ к помеченным файлам                       #Ctrl+Z#


@DeleteFile
$ #Удаление и уничтожение файлов и папок#
    Для удаления или уничтожения файлов и папок применяются следующие сочетания
клавиш:

    #F8#         - если на панели выбраны какие-либо файлы или
                 каталоги, то удаляется выбранная группа, иначе
                 удаляется текущий объект под курсором.

    #Shift+F8#   - удаление файла или папки только под курсором
                 (независимо от выбранных объектов на панели);

    #Shift+Del#  - удаление выбранных объектов минуя Корзину

    #Alt+Del#    - уничтожение файлов и папок.


    Примечания:

    1. ^<wrap>В зависимости от настроек в меню ~Системные параметры~@SystemSettings@
комбинации клавиш #F8# и #Shift+F8# перемещают или нет удаляемые файлы в
Корзину (Recycle Bin). Комбинация клавиш #Shift+Del# всегда удаляет файлы,
минуя Корзину.

    2. ^<wrap>В процессе уничтожения, файл перезаписывается нулями (можно задать
другой символ-заполнитель, см. ~System.WipeSymbol~@System.WipeSymbol@), усекается до нулевой длины,
переименовывается во временное имя и удаляется.

@ErrCannotExecute
$ #Ошибка: Ошибка выполнения#
    Запускаемая команда не является внутренней или внешней
командой, исполняемой программой или пакетным файлом.

    При запуске содержимого командной строки Far ищет исполняемый
модуль по следующей логике (попеременно подставляя расширения, перечисленные в
переменной окружения %PATHEXT%):

  1. Текущий каталог
  2. Каталоги, которые перечислены в переменной окружения %PATH%
  3. Ключ "App Paths" в реестре.

@MiscCmd
$ #Общие команды#
 #Копирование текста с экрана#

  Копирование текста с экрана                                #Alt+Ins#

  Эта команда позволяет выбрать и поместить в Буфер Обмена любую область
экрана.
  Для переключения между потоковым и блочным режимом выделения используйте #Space#.
  Для перемещения курсора используйте #клавиши управления курсором# или
нажмите #левую кнопку мыши#.
  Для выбора текста используйте #клавиши управления курсором# при нажатой #Shift#
или нажатую #левую кнопку мыши#.
  #Alt+Shift+клавиши управления курсором# уменьшают/увеличивают выделеннyю область.
  #Alt+клавиши управления курсором# перемещают выделеннyю область.
  #Enter#, #Ctrl+Ins#, #правая кнопка мыши# или двойное нажатие #левой кнопки мыши#
копируют выбранный текст в Буфер Обмена, #Ctrl+<Gray +># добавляет его к
текущему содержанию Буфера Обмена, #Esc# отменяет пометку и завершает операцию.
  Комбинация #Ctrl+A# выделяет всю экранную область.
  Комбинация #Ctrl+U# снимает выделение.
  #Ctrl+Shift+Left# и #Ctrl+Shift+Right# - перемещение с выделением на 10 позиций по горизонтали,
  #Ctrl+Shift+Up# и #Ctrl+Shift+Down# - перемещение с выделением на 5 позиций по вертикали.

 #Клавиатурные Макрокоманды#

  Записать ~клавиатурную макрокоманду~@KeyMacro@                        #Ctrl+<.>#

 #Меню и выпадающие списки#

  Включить/выключить режим фильтрации               #RAlt, Ctrl+Alt+F#
  Заблокировать/разблокировать фильтр                     #Ctrl+Alt+L#

  Режим фильтрации динамически изменяет список меню по мере ввода символов.
Сочетание #Ctrl+Alt+L# позволяет не сбрасывая фильтра использовать
горячие клавиши.

 #Диалоги#

  История в строках редактирования диалогов       #Ctrl+Up, Ctrl+Down#

  В истории строк редактирования диалогов вы можете использовать #Enter# для
копирования текущего элемента в строку редактирования или #Ins# для отметки
элемента. Отмеченные элементы не вытесняются из истории новыми элементами, так
что вы можете отметить часто используемые строки, чтобы всё время держать их в
истории.

  Очистка истории в строках редактирования диалогов              #Del#

  Удаление текущего неотмеченного пункта истории
  в строках редактирования диалогов                        #Shift+Del#

  Поместить курсор в диалогах на элемент по умолчанию           #PgDn#

  Следующие комбинации клавиш могут быть использованы во всех строках
редактирования кроме командной строки, включая диалоги и
~встроенный редактор~@Editor@.

  Вставить в диалог имя файла под курсором               #Shift+Enter#

  Вставить в диалог имя файла пассивной панели      #Ctrl+Shift+Enter#

  #Ctrl+Enter# в диалогах вызывает действие по умолчанию (нажатие на кнопку
по умолчанию или подобное по смыслу действие).

  В диалогах, когда текущим элементом управления является контрольный
переключатель (кнопка с независимой фиксацией или Check Box):

  - включить (#[x]#)                                          #Gray +#
  - выключить (#[ ]#)                                         #Gray -#
  - изменить состояние на неопределённое (#[?]#)              #Gray *#
    (если переключатель имеет трёхпозиционное состояние)

  Переместить диалог можно мышью или комбинацией #Ctrl+F5#.

 #Мышь#

  Щелчок #левой клавишей мыши# за пределами диалога аналогичен нажатию
клавиши #Esc#.

  Щелчок #правой клавишей мыши# за пределами диалога аналогичен нажатию
клавиши #Enter#.

  Щелчок #средней клавишей мыши# с соответствующими модификаторами (#Ctrl#,
#Alt#, #Shift#) в ~панелях~@PanelCmd@ аналогичен нажатию клавиши #Enter#. Для
непустой ~командной строки~@CmdLineCmd@ будет исполнено её содержимое.

  Far Manager также умеет обрабатывать ~колесо мыши~@MsWheel@.

@SpecCmd
$ #Специальные команды#

  ~Информация о версиях~@FarAbout@
  ~Редактор конфигурации~@FarConfig@


@MsWheel
$ #Мышь: поддержка колеса#

   #Панели#          Прокрутка списка при неизменной позиции курсора
                   на экране. Нажатие #средней кнопки# аналогично
                   нажатию #Enter#.

   #Редактор#        Прокрутка текста с постоянным позиционированием
                   курсора (аналогично #Ctrl+Up#/#Ctrl+Down#).

   #Встроенная#      Прокрутка всего текста.
   #программа#
   #просмотра#

   #Система помощи#  Прокрутка всего текста.


   #Меню#            Прокрутка колеса аналогична действию клавиш
                   #Up#/#Down#. Нажатие средней кнопки аналогично
                   нажатию #Enter#. Можно выбирать пункты, не двигая
                   курсор.

   #Диалоги#         В диалогах при прокрутке колеса для строки
                   редактирования с историей и комбинированного
                   списка раскрывается список. Внутри списка
                   прокрутка работает так же, как для меню.

    Вы можете задать количество строк для прокрутки в панелях, редакторе и во
встроенной программе просмотра (см. ~System.MsWheelDelta~@System.MsWheelDelta@).


@Plugins
$ #Поддержка плагинов#
    Плагины могут быть использованы для создания новых команд Far и поддержки
виртуальных файловых систем. Например, работа с архивами, FTP-клиент, временная
панель и просмотр сети реализованы с помощью эмулирующих файловые системы плагинов.

    Все плагины хранятся в отдельных папках, размещённых в папке 'Plugins', находящейся
в одной папке с Far.exe и в папке 'Plugins', находящейся в профиле пользователя
(по умолчанию #%APPDATA%\\Far Manager\\Profile#).
    При обнаружении нового плагина Far сохраняет информацию о нём и впоследствии
загружает его только при необходимости, в результате чего неиспользуемые плагины не требуют
дополнительной памяти. Тем не менее, если вы уверены, что какие-либо плагины вам
не нужны, вы можете удалить их, чтобы сохранить место на диске.

    Плагины могут быть вызваны либо из ~Меню выбора диска~@DriveDlg@, либо из
меню ~Команды плагинов~@PluginCommands@, активизируемого с помощью #F11# или
соответствующего пункта ~Меню команд~@CmdMenu@. #F4# в меню "Команды плагинов"
позволяет назначить горячие клавиши для пунктов этого меню, что
упрощает их последующий вызов с помощью ~клавиатурных макрокоманд~@KeyMacro@.
Это меню доступно из файловых панелей, диалогов и из встроенной программы
просмотра и редактора. При вызове из диалогов, программы просмотра или редактора
будут показаны не все плагины, а только те, которые специально созданы для работы
в этом режиме.

    Вы можете настроить параметры плагинов, используя команду
~Параметры плагинов~@PluginsConfig@ из ~Меню параметров~@OptMenu@ либо
комбинацию клавиш #Alt+Shift+F9#.
    Операции обработки файлов (копирование, перенос, удаление,
редактирование, ~Поиска файла~@FindFile@ и т. п.) могут работать с плагинами,
эмулирующими файловые системы, если эти плагины обеспечивают соответствующую
функциональность.

    Плагины имеют собственные файлы сообщений и помощи. Вы можете получить
список доступной помощи по плагинам, нажав:

    #Shift+F2# - в основной помощи Far
    #Shift+F1# - в списке плагинов (контекстно-зависимая помощь).

    Если плагин не имеет файла помощи, то помощь вызываться не будет.

    Если активная панель отображает файловую систему, эмулируемую плагином,
то команда "CD" в командной строке может быть использована для смены
текущей папки этой файловой системы. В отличие от "CD" команда "CHDIR" всегда
воспринимает указанный параметр как имя реальной папки, вне зависимости от типа
файловой панели.


@PluginCommands
$ #Команды плагинов#
    Данное меню - один из способов использования функциональности, которую
предоставляют плагины (о других способах см. ~"Поддержка плагинов"~@Plugins@).
Содержимое этого меню и действия, выполняемые при выборе пункта меню,
определяются плагинами.

    Меню может быть вызвано следующими способами:

  - нажатие #F11# в файловых панелях или выбор пункта #Команды плагинов#
    ~меню команд~@CmdMenu@, при этом показываются команды, предназначенные для
    вызова из файловых панелей;
  - нажатие #F11# в окне просмотра, редактора или диалоге, при этом показываются
только команды, предназначенные для текущей области вызова.

    Каждому пункту меню по #F4# может быть назначена горячая клавиша, отображаемая
слева от него. Данная возможность широко используется при создании
~клавиатурных макрокоманд~@KeyMacro@ вызова функций плагинов. Символ #A#
в крайней левой колонке меню означает, что соответствующий плагин разработан
для Far 1.x и не поддерживает всех возможностей текущей версии Far (в частности, символов
Unicode в именах файлов и в редакторе).

    Горячие клавиши меню #Команды плагинов#:

    #Shift+F1#    - помощь по использованию выделенного пункта меню.
                  Текст помощи предоставляется плагином, которому
                  принадлежит выделенный пункт меню.
    #F4#          - назначить горячую клавишу выделенному пункту меню.
                  Если ввести пробел, Far установит горячую клавишу
                  автоматически.
    #F3#          - показать техническую информацию по плагину.
    #Shift+F9#    - параметры выбранного плагина.
    #Alt+Shift+F9# - открыть меню ~"Конфигурация плагинов"~@PluginsConfig@.

    См. также: 
      
      ~Поддержка плагинов~@Plugins@.
      Клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@PluginsConfig
$ #Параметры плагинов#
    Вы можете настроить параметры ~плагинов~@Plugins@,
используя команду #"Параметры плагинов"# из ~"Меню параметров"~@OptMenu@
или нажав комбинацию клавиш #Alt+Shift+F9# в ~Меню выбора диска~@DriveDlg@
и меню команд плагинов.

    Вы можете получить информацию о конкретном плагине, нажав #Shift+F1#
(контекстно-зависимая помощь по настройке плагина). Если плагин не имеет файла
помощи, то помощь вызываться не будет.

    При вызове контекстной помощи Far попытается показать тему с именем
#Config#. Если такой темы в файле помощи плагина нет, будет показана основная
тема помощи по данному плагину.

    Каждому пункту меню по #F4# может быть назначена горячая клавиша, отображаемая
слева от него; данная возможность широко используется при создании
~клавиатурных макрокоманд~@KeyMacro@ вызова функций плагинов. Символ #A#
в крайней левой колонке меню означает, что соответствующий плагин разработан
для Far 1.x и не поддерживает всех возможностей текущей версии Far (в частности, символов
Unicode в именах файлов и в редакторе).

    Клавиша #F3# позволяет посмотреть техническую информацию по плагину.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@PluginsReviews
$ #Обзор возможностей плагинов#
    Оболочка Far Manager настолько тесно слилась со своими плагинами, что
говорить о ней и не говорить о плагинах просто бессмысленно. Плагины неимоверно
расширяют возможности Far Manager, дополняя их и модифицируя.

    Не вдаваясь в подробности и персоналии, можно отметить только некоторые из
этих возможностей:

  * управление принтерами, как подключёнными к ПК, так и сетевыми
  * подсветка синтаксиса в исходных текстах программ
  * работа с FTP-серверами (с поддержкой доступа через различные
    типы прокси, автоматической докачкой и прочее)
  * поиск и замена символов одновременно во множестве файлов с
    применением регулярных выражений.
  * средства переименования групп файлов с возможностью использования
    сложных составных масок из символов подстановки и шаблонов
  * NNTP/SMTP/POP3/IMAP4 клиенты и отправка сообщений на пейджер
  * перекодировка текстов с учётом национальных кодовых страниц
  * манипуляции с содержимым корзины
  * управление приоритетами процессов на локальном или на сетевом ПК
  * автозавершение слов в редакторе и работа с шаблонами
  * редактирование системного реестра Windows
  * создание и изменение ярлыков Windows
  * всевозможные манипуляции с файлами и текстом, делающие комфортной
    работу с FIDO
  * кодирование и декодирование файлов в формате UUE
  * управление программой WinAmp и модификация комментариев
    MP3-файлов
  * обработка Quake PAK файлов
  * Работа с различными серверами через ODBC + работа с серверами
    ORACLE через OCI.
  * управление службой RAS
  * запуск внешних программ (компиляторов, конверторов и проч.) при
    редактировании текстов в редакторе Far
  * отображение содержимого файлов справки Windows (.hlp и .chm)
  * калькуляторы с разными возможностями
  * различные игры :-)
  * функции проверки орфографии при обработке текста в редакторе Far
  * подготовка каталога сменных накопителей и многое другое…

    В качестве источников информации, которые можно использовать для поиска
конкретных плагинов, можно порекомендовать:

  - Официальный сайт Far Manager
    ~https://www.farmanager.com/~@https://www.farmanager.com@
  - форум
    ~https://forum.farmanager.com~@https://forum.farmanager.com@
  - Регистрация и обработка проблем
    ~https://bugs.farmanager.com~@https://bugs.farmanager.com@
  - сайт PlugRinG
    ~https://plugring.farmanager.com~@https://plugring.farmanager.com@
  - листы рассылки
    ~https://groups.google.com/group/fardev/~@https://groups.google.com/group/fardev@
  - конференции USENET
    ~news:fido7.far.support~@news:fido7.far.support@
    ~news:fido7.far.development~@news:fido7.far.development@
  - конференции FidoNet
    far.support
    far.development


@Panels
$ #Панели#
    Обычно Far показывает две панели (левое и правое окна) с различной
информацией. Если вы хотите изменить тип отображаемой в панели информации,
используйте ~меню панелей~@LeftRightMenu@ или соответствующие
~клавиатурные команды~@KeyRef@.

    Для получения дополнительной информации о панелях прочитайте перечисленные
ниже темы:

     ~Панель файлов~@FilePanel@                ~Дерево папок~@TreePanel@
     ~Панель информации~@InfoPanel@            ~Панель быстрого просмотра~@QViewPanel@

     ~Перетаскивание файлов~@DragAndDrop@
     ~Пометка файлов~@SelectFiles@
     ~Настройка режимов просмотра панели файлов~@PanelViewModes@


@FilePanel
$ #Панель файлов#
    Панель файлов отображает содержимое текущей папки. Вы можете выбирать файлы
и папки, выполнять различные файловые и архивные операции. Команды управления
панелями описаны в теме ~Список команд~@KeyRef@.

    По умолчанию в панели файлов используются следующие режимы просмотра:

 #Краткий#        Имена файлов выводятся в три колонки.

 #Средний#        Имена файлов выводятся в две колонки.

 #Полный#         Выводятся имя, размер, дата и время файла.

 #Широкий#        Выводятся имя и размер файла.

 #Детальный#      Выводятся имена, размеры, выделенные размеры,
                время последней записи, создания, доступа
                и атрибуты файла. Полноэкранный режим.

 #Описания#       Имена и ~описания файлов~@FileDiz@

 #Длинные#        Имена, размеры и описания файлов.
 #описания#       Полноэкранный режим.

 #Владельцы#      Имена, размеры и владельцы файлов.
 #файлов#

 #Ссылки файлов#   Имена, размеры и количество жёстких ссылок файлов.

 #Альтернативный# Имя, размер (форматированный с помощью запятых)
 #полный#         и дата файла.

    Вы можете сами настроить ~режимы просмотра панели файлов~@PanelViewModes@.

    Владельцы и количество жёстких ссылок файлов применимы только к разделам NTFS.
Некоторые файловые системы могут не поддерживать время создания и время доступа к файлу.

    Если вы хотите изменить режим просмотра панели, выберите желаемый из
~меню панелей~@LeftRightMenu@. После смены режима просмотра или текущего
диска тип любой панели автоматически меняется на панель файлов.

    Для позиционирования на файл можно воспользоваться операцией
~быстрого поиска~@FastFind@ по первым буквам имени.

    См. также список ~макроклавиш~@KeyMacroShellList@, доступных в панелях.

@TreePanel
$ #Дерево папок#
    Панель дерева папок отображает структуру папок текущего диска в виде
дерева. Это позволяет быстро сменить текущую папку, а также выполнять операции
над папками.

    Far запоминает информацию о структуре папок в файле #tree3.far#,
расположенном в корневой папке каждого диска. Если запись на диск невозможна,
то эта информация сохранятся в скрытой папке Tree.Cache, находящейся в той же
папке, что и Far.exe.
    По умолчанию файл tree3.tar отсутствует, для его создания нужно хотя бы один
раз воспользоваться командой #Поиск папки# или режимом панели #Дерево папок#.
Если такой файл есть, то при изменении каталогов (удаление, создание,
переименование, копирование) Far отслеживает и обновляет его
внутреннюю структуру. Если изменения были сделаны не в Far Manager обновить
содержимое файла tree3.far можно сочетанием клавиша #Ctrl+R#.

    Для позиционирования на папку можно использовать операцию #быстрого#
#поиска#. Для этого, удерживая клавишу #Alt#, набирайте имя требуемой папки,
пока на неё не переместится курсор. С помощью #Ctrl+Enter#/#Ctrl+Shift+Enter#
можно переместиться на следующее/предыдущее имя, соответствующее введённой строке.

    #Gray +# и #Gray -# используются для быстрого перемещения вверх или вниз
по папкам одного уровня.

    См. также список ~макроклавиш~@KeyMacroTreeList@, доступных в панели дерева папок.

@InfoPanel
$ #Панель информации#
    Панель информации содержит следующие секции:

 1. ^<wrap>#сетевые# имена компьютера и пользователя (представления изменяются в ~настройках~@InfoPanelSettings@).

 2. Информаци о текущем диске
    ^<wrap>Имя и тип диска, тип его файловой системы, сетевое имя, общий и свободный размеры, метку тома и серийный номер.

    ^<wrap>Для приводов компакт-дисков Far умеет определять тип привода. Различаются
следующие типы: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW и DVD-RAM. Функция
определения типа привода требует или административных прав, или разрешения доступа
к локальным приводам компакт-дисков с помощью политик безопасности (для этого надо запустить из командной
строки утилиту #secpol.msc# и установить настройку '#Локальные политики/Параметры#
#безопасности/Устройства: Разрешить доступ к дисководам компакт-дисков только#
#локальным пользователям#' в значение '#Разрешить#'). 

    Для виртуальных устройств (SUBST-дисков) указываются параметры
основного диска.

    ^<wrap>#Ctrl+Shift+S# меняет режим отображения размеров: плавающий с суффиксами или байты.
Это влияет также на отображение информации о состоянии памяти, показ размеров в ~панели быстрого просмотра~@QViewPanel@
и в статусной строке ~файловой панели~@FilePanel@.
Текущий режим - far:config #Panel.ShowBytes# (default=false).

 3. Информацию о состоянии памяти
    ^<wrap>Уровень загрузки памяти (100% означает, что использована вся память),
размер установленной памяти (в Vista и выше), общий и свободный размеры физической памяти
(доступной для Windows), виртуальной памяти и файла подкачки.

 4. Описание папки
    ^<wrap>Отображается содержимое файла #описания папки#.

    ^<wrap>Вы можете просмотреть содержимое этого файла в полноэкранном режиме, нажав
#F3# или #левую кнопку мыши#. Для редактирования или создания этого файла нажмите
#F4# или #правую кнопку мыши#. Вы также можете использовать многие команды
~встроенной программы просмотра~@Viewer@ (поиск, выбор кодовой страницы и т.д.) для
просмотра файла описания.

    ^<wrap>Список возможных имён файлов описания папок может быть задан с помощью
команды "Файлы описания папок" в ~Меню параметров~@OptMenu@.

 5. Плагиновая панель
    ^<wrap>Содержит информацию о противоположной плагиновой панели, если плагин предоставил такую информацию.

 6. Состояние системы питания.
    - ^<wrap>подключения к сети (отсутствует, подключено, не определено);
    - ^<wrap>значение заряда батареи (в процентах);
    - ^<wrap>статус заряда ("Высокий" - более 66%, "Низкий" - менее 33%, "Критичный" - критически низкий уровень, "Зарядка", "Батареи нет", "Не определено");
    - ^<wrap>время до разряда;
    - ^<wrap>полное время работы от батареи (система оценивает это время исходя из времени до разряда и значения заряда батареи;
без наличия умных подсистем батареи это значение не актуально и обычно указано как "Не определено").
    
    ^<wrap>Состояние подключения к сети обновляется автоматически.
    ^<wrap>В Windows Vista и выше работает автообновление "значения заряда батареи".
    ^<wrap>Секция, содержащая информацию о системе питания включается в ~настройках~@InfoPanelSettings@.


    Секции (кроме имени компьютера и пользователя) можно скрывать или
показывать (см. ~Режимы отображения информационной панели~@InfoPanelShowMode@).

    См. также список ~макроклавиш~@KeyMacroInfoList@, доступных в панели информации.

@InfoPanelShowMode
$ #Режимы отображения информационной панели#
    Меню режимов отображения ~информационной панели~@InfoPanel@ вызывается комбинацией #Ctrl+F12#
и применяется для активной в данный момент информационной панели. Доступны следующие режимы
отображения:

  информация о диске
  информация о памяти
  содержимое файла-описателя
  информации плагиновой панели
  информации о состоянии системы питания

  Клавиша #+# включает показ информации.
  Клавиша #-# скрывает секцию.
  Клавиша #*# меняет режим отображения секции на обратную.

  Информация о состоянии системы питания включается в ~настройках~@InfoPanelSettings@ информационной панели.

@InfoPanelSettings
$ #Настройка информационной панели#
  #Показывать состояние питания#

    Если опция включена, то в ~информационной панели~@InfoPanel@ будет выводиться
секция, описывающая состояние системы питания.

  #Показывать параметры компакт-дисков#

    Если опция включена, то Far будет пытаться определить тип CD-привода. 
Различаются следующие приводы: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW и DVD-RAM. 

  #Формат вывода имени компьютера#

  Задаёт формат вывода имени компьютера. Может быть одним из:

    #Physical NetBIOS#
      ^<wrap>NetBIOS имя локального компьютера.

    #Physical DNS hostname#
      ^<wrap>DNS имя локального компьютера.

    #Physical DNS domain#
      ^<wrap>DNS имя домена, которому принадлежит компьютер.

    #Physical DNS fully-qualified#
      ^<wrap>Полное доменное имя, которое однозначно идентифицирует этот компьютер. Имя представляет собой комбинацию DNS имени хоста и DNS имени домена (формат HostName.DomainName).

    #NetBIOS#
      ^<wrap>NetBIOS имя локального компьютера. Если компьютер является узлом кластера, то выводится NetBIOS имя кластера виртуального сервера.

    #DNS hostname#
      ^<wrap>DNS имя локального компьютера. Если компьютер является узлом кластера, то выводится DNS имя кластера виртуального сервера.

    #DNS domain#
      ^<wrap>DNS имя домена, которому принадлежит компьютер. Если компьютер является узлом кластера, то выводится DNS имя домена кластера виртуального сервера.

    #DNS fully-qualified#
      ^<wrap>Полное доменное имя, которое однозначно идентифицирует этот компьютер. Имя представляет собой комбинацию DNS имени хоста и DNS имени домена (формат HostName.DomainName). Если компьютер является узлом кластера, то выводится полное DNS имя кластера виртуального сервера.

    Формат вывода зависит от наличия доменной структуры, групповых политик, настроек DNS.

  #Формат вывода имени пользователя#

  Задаёт формат вывода имени пользователя. Может быть одним из:

    #По умолчанию#
      Логин пользователя, например, JohnDoe
    #Полностью определённое имя домена#
      ^<wrap>FQDN (Fully Qualified Domain Name) - включает наименования всех уровней иерархии, начиная от имени конечного узла и заканчивая корневой точкой (логином), например,
      CN=JohnDoe, OU=Software, OU=Engineering, O=Widget, C=US
    #Sam Compatible#
      Engineering\JohnDoe
    #Display#
      Probably "John Doe" but could be something else.  I.e. The display name is not necessarily the defining RDN.
    #Уникальный идентификатор#
      ^<wrap>Уникальный идентификатор имени пользователя (GUID), например,
      {4fa050f0-f561-11cf-bdd9-00aa003a77b6}
    #Канонический вид#
      ^<wrap>ADCN (Active Directory Canonical Name) - данный формат является путём в иерархической структуре к объекту (логину), например,
      engineering.widget.com/software/JohnDoe
    #Основное имя пользователя#
      ^<wrap>UPN (User Principial Name) - известен также как адрес электронной почты, например,
      someone@example.com
    #Service Principal#
      www/srv.engineering.com/engineering.com
    #Dns Domain#
      engineering.widget.com\JohnDoe

    Формат вывода зависит от наличия доменной структуры.

@QViewPanel
$ #Панель быстрого просмотра#
    Панель быстрого просмотра используется для получения информации о выбранном
элементе ~панели файлов~@FilePanel@ или ~дерева папок~@TreePanel@.

    Если выбранный элемент - файл, то отображается его содержимое. Для файла,
отображаемого в панели доступны многие команды встроенной программы
~просмотра~@Viewer@. Для известных Windows типов файлов также выводится
название типа.

    Для папок в панели быстрого просмотра сообщается общий размер, общий
выделенный размер, количество файлов и вложенных папок, размер кластера
текущего диска, реальный размер файлов, включая неиспользуемые фрагменты
кластеров.

    Для ~символических ссылок~@HardSymLink@ отображается путь к исходным
объектам.

    Для папок общие размеры могут не соответствовать реальным значениям:

    1. ^<wrap>Если среди вложенных папок имеются символические ссылки и включена опция
"Сканировать символические ссылки" (диалог настройки ~системных параметров~@SystemSettings@).

    2. ^<wrap>Если внутри папки есть несколько жёстких ссылок на один и тот же файл.

    ^<wrap>#Ctrl+Shift+S# меняет режим отображения размеров: плавающий с суффиксами или байты.
Это влияет также на отображение размеров в ~информационной панели~@InfoPanel@ и статусной строке ~файловой панели~@FilePanel@.
Текущий режим - far:config #Panel.ShowBytes# (default=false).

    См. также список ~макроклавиш~@KeyMacroQViewList@, доступных в панели быстрого просмотра.

@DragAndDrop
$ #Копирование: перетаскивание файлов#
    Операции #копирования# и #переноса# файлов могут быть выполнены с помощью
#перетаскивания#. Нажмите #левую кнопку мыши# на исходном файле или папке,
перетащите его на другую панель и отпустите кнопку мыши.

    Если вы хотите обработать группу файлов или папок, пометьте их перед
перетаскиванием, нажмите #левую кнопку мыши# на исходной панели и перетащите
файлы на другую панель.

    Вы можете переключаться между копированием и переносом, нажимая #правую#
#кнопку мыши# во время перетаскивания. Для переноса файлов вы также можете
удерживать клавишу #Shift# в момент нажатия #левой кнопки мыши#.


@Menus
$ #Меню #
    Для активизации меню вы можете использовать #F9# или нажать #левую кнопку#
#мыши# на верхней строке экрана.

    При активизации по клавише #F9# автоматически выбирается меню,
соответствующее активной панели. При активном меню клавиша #Tab# позволяет
переключаться между меню левой и правой панелей. Если выбрано меню "Файлы",
"Команды" или "Параметры", клавиша #Tab# переключает на меню пассивной панели.

    Комбинация #Shift+F10# позволяет выбрать последний использованный пункт
меню.

    Описания конкретных меню можно прочесть в следующих темах:

     ~Меню левой и правой панелей~@LeftRightMenu@          ~Меню файлов~@FilesMenu@

     ~Меню команд~@CmdMenu@                          ~Меню параметров~@OptMenu@

    См. также список ~макроклавиш~@KeyMacroMainMenuList@, доступных в главном меню.

@LeftRightMenu
$ #Меню левой и правой панелей#
    Меню #Левая# и #Правая# позволяют изменить параметры левой и правой панели
соответственно. Эти меню включают следующие пункты:

   #Краткий#              Показывать файлы в три колонки.

   #Средний#              Показывать файлы в две колонки.

   #Полный#               Показывать имя, размер, дату и время файла.

   #Широкий#              Показывать имя и размер файла.

   #Детальный#            Показывать имя, размер, выделенный размер,
                        время записи, создания и доступа
                        и атрибуты файла. Полноэкранный режим.

   #Описания#             Имя и ~описание~@FileDiz@ файла.

   #Длинные описания#     Имя, размер и описание файла.
                        Полноэкранный режим.

   #Владельцы файлов#     Имя, размер и владелец файла.

   #Ссылки файлов#        Имя, размер и количество жёстких ссылок
                        файлов.

   #Альтернативный#       Имя, размер (форматированный с использованием
   #полный#               запятых) и дата файла.

   #Панель информации#    Сменить панель на ~панель информации~@InfoPanel@.

   #Дерево папок#         Сменить панель на ~дерево папок~@TreePanel@.

   #Быстрый просмотр#     Сменить панель на ~панель быстрого просмотра~@QViewPanel@.

   #Режимы сортировки#    Показать доступные режимы сортировки.

   #Показывать длинные#   Показывать длинные/короткие имена.
   #имена#

   #Панель Вкл/Выкл#      Показать/спрятать панель.

   #Перечитать#           Перечитать содержимое панели.

   #Сменить диск#         Сменить текущий диск.


    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@FilesMenu
$ #Меню файлов#
   #Просмотр#             ~Просмотр файлов~@Viewer@, подсчёт размеров папок.

   #Редактирование#       ~Редактирование~@Editor@ файлов.

   #Копирование#          ~Копирование~@CopyFiles@ файлов и папок.

   #Перенос#              ~Переименование или перенос~@CopyFiles@ файлов и папок.

   #Ссылка#               ~Создание ссылок~@HardSymLink@ на файлы и папки.

   #Создание папки#       ~Создание~@MakeFolder@ новой папки.

   #Удаление#             Удаление файлов и папок.

   #Уничтожение#          Уничтожает файлы и папки. Перед удалением
                        файл перезаписывается нулями, усекается
                        до нулевой длины и переименовывается во
                        временное имя.

   #Архивировать#         Добавить выбранные файлы к архиву.

   #Распаковать#          Распаковать выбранные файлы из архива.

   #Атрибуты файлов#      ~Изменить атрибуты~@FileAttrDlg@ и время файла.

   #Применить команду#    ~Применить команду~@ApplyCmd@ к выбранным файлам.

   #Описание файлов#      Добавить ~описания~@FileDiz@ к выбранным файлам.

   #Пометить группу#      Пометить заданную маской группу файлов.

   #Снять пометку#        Снять пометку с соответствующей заданной
                        маске группы файлов.

   #Инверсия пометки#     Инвертировать текущую пометку файлов.

   #Восстановить пометку# Восстановить предыдущую пометку после
                        обработки файлов или операции пометки группы.

    Некоторые команды из этого меню также описаны в теме
~Управление файлами и сервисные команды~@FuncCmd@.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@CmdMenu
$ #Меню команд#
   #Поиск файла#          Поиск файлов, удовлетворяющих заданной маске.
                        Эта команда описана подробнее
                        в теме ~Поиск файла~@FindFile@.

   #История команд#       Показать предыдущие команды. Эта команда
                        описана подробнее в теме ~История команд~@History@.

   #Видеорежим#           Выбрать количество строк на экране.

   #Поиск папки#          Поиск папки в дереве папок.
                        Дополнительная информация об этой команде
                        содержится в теме ~Поиск папки~@FindFolder@.

   #История просмотра#    Показать ~историю просмотра и редактирования~@HistoryViews@
                        файлов.

   #История папок#        Показать ~историю смены папок~@HistoryFolders@.

                        Элементы истории просмотра и истории смены
                        папок после выбора передвигаются в конец
                        списка. Вы можете использовать #Shift+Enter#,
                        чтобы выбрать элемент без смены его позиции.

   #Поменять панели#      Поменять левую и правую панели местами.

   #Панели Вкл/Выкл#      Показать/спрятать обе панели.

   #Сравнение папок#      Сравнить содержимое папок.
                        Дополнительная информация об этой команде
                        содержится в теме ~Сравнение папок~@CompFolders@.

   #Меню пользователя#    Позволяет редактировать главное или местное
                        ~меню пользователя~@UserMenu@. Для вставки пункта
                        используется #Ins#, для удаления - #Del#,
                        для редактирования - #F4#.

   #Ассоциации файлов#    Показывает список ~ассоциаций файлов~@FileAssoc@.
                        Для вставки новой ассоциации может
                        использоваться #Ins#, для удаления - #Del#,
                        для редактирования - #F4#.

   #Ссылки на папки#      Показывает текущие ~ссылки на папки~@FolderShortcuts@.

   #Фильтр панели#        Позволяет управлять содержимым панели файлов.
   #файлов#               Дополнительная информация об этой команде
                        содержится в теме ~меню фильтров~@FiltersMenu@.

   #Команды#              Показывает список доступных
   #плагинов#            ~плагинов~@Plugins@.

   #Список экранов#       Показывает ~список открытых экранов~@ScrSwitch@.

   #Список задач#         Показывает ~список активных задач~@TaskList@.

   #Список устройств#     Показывает ~список подключённых устройств~@HotPlugList@.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@OptMenu
$ #Меню параметров#
   #Системные параметры#  Вызывает диалог ~системных параметров~@SystemSettings@.

   #Настройки панели#     Вызывает диалог ~настроек панели~@PanelSettings@.

   #Настройки дерева#     Вызывает диалог ~настроек дерева папок~@TreeSettings@.
   #папок#                Доступно только если параметр ~Panel.Tree.TurnOffCompletely~@Panel.Tree.TurnOffCompletely@
                        в ~far:config~@FarConfig@ установлен в значение «false».

   #Настройки интерфейса# Вызывает диалог ~настроек интерфейса~@InterfSettings@.

   #Языки#                Выбор основного языка и языка помощи.
                        Используйте команду "Сохранить параметры",
                        чтобы сохранить выбранные языки.

   #Параметры плагинов#   Вызывает диалог ~настроек плагинов~@PluginsConfig@.

   #Параметры менеджера#  Вызывает диалог ~менеджера плагинов~@PluginsManagerSettings@.
   #плагинов#
   
   #Настройки диалогов#   Вызывает диалог ~настроек диалогов~@DialogSettings@.

   #Настройки меню#       Вызывает диалог ~настроек меню~@VMenuSettings@.

   #Настройки командной#  Вызывает диалог ~настроек командной строки~@CmdlineSettings@.
   #строки#

   #Настройки#            Вызывает диалог ~настроек автозавершения~@AutoCompleteSettings@.
   #автозавершения#
   
   #Настройки#            Вызывает диалог 
   #информационной#       ~настроек информационной панели~@InfoPanelSettings@.
   #панели#

   #Группы масок файлов#  Управление ~группами масок файлов~@MaskGroupsSettings@.

   #Подтверждения#        Вызывает диалог включения или выключения
                        ~подтверждений~@ConfirmDlg@ для некоторых операций.

   #Режимы панели#        ~Настройка режимов просмотра~@PanelViewModes@ панели файлов.
   #файлов#

   #Описания файлов#      Режимы обновления и имена ~описаний файлов~@FileDiz@.

   #Файлы описания#       Управление ~описаниями папок~@FolderDiz@.
   #папок#                

   #Настройки программы#  ~Настройки программы просмотра~@ViewerSettings@ (внешней и встроенной).
   #просмотра#

   #Настройки редактора#  ~Настройки редактора~@EditorSettings@ (внешнего и встроенного).

   #Кодовые страницы#     Управление ~кодовыми страницами~@CodePagesMenu@.

   #Цвета#                Изменение цвета различных элементов
                        интерфейса или изменение всей палитры цветов
                        либо на чёрно-белую, либо на предлагаемую
                        по умолчанию.

   #Раскраска файлов#     Редактирование
   #и группы сортировки#  ~раскраски файлов и групп сортировки~@Highlight@.

   #Сохранить параметры#  Сохранение текущей конфигурации, цветов
                        и внешнего вида экрана.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@ConfirmDlg
$ #Подтверждения#
    В диалоге #Подтверждения# вы можете разрешить или запретить
подтверждения для следующих операций:

    - перезаписывание файлов во время копирования;

    - перезаписывание файлов во время переноса;

    - перезаписывание и удаление файлов с атрибутом "только для чтения";

    - ~перетаскивание~@DragAndDrop@ файлов;

    - удаление файлов/папок;

    - удаление непустых папок;

    - прерывание операций (нажали клавишу #Esc#);

    - ~отсоединение сетевого диска~@DisconnectDrive@ из меню дисков;

    - удаление SUBST-диска из меню дисков;

    - отсоединение виртуального диска;

    - отключение запоминающих устройств для USB из меню дисков;

    - ~повторное открытие~@EditorReload@ файла в редакторе;

    - очистка списка историй редактирования/просмотра, переходов и
      выполненных команд;

    - выход из Far.


@MaskGroupsSettings
$ #Группы масок файлов#
    Произвольное количество ~масок файлов~@FileMasks@ можно объединить в группу и присвоить ей имя.
  
    В дальнейшем имя группы, заключённое в угловые скобки (#<#имя#>#), может использоваться везде, где используются сами маски.

    Группы могут содержать другие группы.

    Например, группа #<arc># содержит маски "*.rar,*.zip,*.[zj],*.[bg7]z,*.[bg]zip,*.tar".
Для ~раскраски~@Highlight@ всех архивов, кроме "*.rar", необходимо указать последовательность #<arc>|*.rar#.

    Клавиши управление списком.

    #Ctrl+R#      - ^<wrap>восстановить исходное значение для предопределённых групп ("arc", "temp" и "exec").

    #Ins#         - добавить новую группу

    #Del#         - удалить существующую группу

    #Enter#/#F4#    - изменить параметры группы

    #F7#          - найти группы, содержащие маску
    
    См. также: ~Меню параметров~@OptMenu@ и клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@ChoosePluginMenu
$ #Меню выбора плагина#
    Позволяет выбрать плагин-обработчик, если хост-файл (например, архив) 
могут обработать несколько плагинов.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@MakeFolder
$ #Создание папки#
    Эта функция служит для создания папок. Вы можете использовать переменные
окружения в строке ввода, которые перед созданием папки преобразуются в
содержащееся в ней значение. Также существует возможность создавать несколько
вложенных папок за один раз: для этого отделите имена папок друг от друга
символом "\\". Например:

    #%USERDOMAIN%\\%USERNAME%\\Папка3#

    Опция "#Тип ссылки#" позволяет создавать одну из ~ссылок~@HardSymLink@ на папки 
("#связь каталогов#" или "#символическая ссылка#"). В этом случае необходимо в поле "#Цель#" 
указать папку, на которую будет ссылаться вновь созданная папка.

    Если включена опция "#Обрабатывать несколько имён папок#", то можно
создавать несколько папок за один раз. В этом случае имена папок должны быть
разделены символом-разделителем "#;#" или "#,#". Если эта опция включена и имя
папки содержит в себе символ "#;#" (или "#,#"), то оно должно быть взято в
кавычки. Например, если будет введено #C:\\Foo1;"E:\\foo,2;";D:\\foo3#, то
будут созданы папки с именами: "#C:\\Foo1#", "#E:\\foo,2;#" и "#D:\\foo3#".

@FindFile
$ #Поиск файла#
    Эта команда предназначена для поиска одного или нескольких файлов и папок в
дереве папок, в соответствии с одной или несколькими разделёнными запятыми или
точкой с запятой ~масками~@FileMasks@. Также она может быть использована с
файловыми системами, эмулируемыми ~плагинами~@Plugins@.

    Дополнительно может быть указан текст, который должен содержаться в
искомых файлах. В этом случае параметр #Учитывать регистр# может быть
использован для проведения регистрозависимого поиска.

    Параметр #Только целые слова# позволит искать только текст, который отделён
от остального текста пробелом, знаком табуляции, возврата каретки, перевода
строки или стандартными разделителями:
#!%^&*()+|{}:"<>?`-=\\[];',./#.

    Установка параметра #Искать 16-ричный код# позволяет искать файлы,
содержащие шестнадцатеричную последовательность введённых байт. В этом случае
параметры #Учитывать регистр#, #Только целые слова#, #Используя кодовую страницу#
и #Искать папки# блокируются и их значения на процесс поиска не
влияют.

    Параметр #не содержащих# позволяет искать файлы, #не# содержащие указанный текст или код.

    Выпадающий список #Используя кодовую страницу# позволяет выбрать конкретную
кодовую страницу, применяемую для поиска текста. Если в выпадающем списке выбрать
пункт #Все стандартные кодовые страницы#, то Far будет использовать для поиска все стандартные
(ANSI, OEM, UTF-8, UTF-16, UTF-16 BE) и #Избранные# кодовые страницы (список #избранных#
кодовых страниц можно настроить в меню ~кодовых страниц~@CodepagesMenu@ настроек, редактора или
программы просмотра). При необходимости поиска по собственному набору кодовых страниц, отметьте
их в списке при помощи клавиш #Ins# или #Space# и выберите пункт #Отмеченные кодовые страницы#.

    Для поиска файлов и в архивах нужно установить опцию #Искать в архивах#. В
то же время, это существенно замедляет выполнение операции.
    Поиск во вложенных архивах не производится.

    Параметр #Искать папки# позволяет включать в список поиска папки,
совпадающие с маской поиска. При этом счётчик найденных файлов учитывает также
и найденные папки.

    Параметр #Искать в символических ссылках# позволяет искать файлы в
~символических ссылках~@HardSymLink@ наравне с обычными подкаталогами.

    Параметр #Искать в альтернативных потоках# - помимо основного потока данных
(представляющего собой непосредственно содержимое файла)
производить поиск также в альтернативных именованных потоках, поддерживаемых некоторыми
файловыми системами (например, #NTFS#).


    Поиск может выполняться:

    - на всех дисках, кроме сменных;

    - на всех локальных дисках, кроме сменных и сетевых;

    - во всех папках, перечисленных в переменной окружения %PATH%
      (без вложенных папок);

    - во всех папках, начиная с корневой, в диалоге поиска
      можно выбрать диск поиска (кнопка "Диск");

    - во всех папках, начиная с текущей папки;

    - только в текущей папке;

    - в отмеченных папках.

    Параметры поиска сохраняется в конфигурации.

    Для поиска файлов, попадающих под определённые условия, используйте переключатель
#Использовать фильтр#. Настройка условий ~фильтра~@FiltersMenu@ осуществляется
кнопкой #Фильтр#.

    С помощью кнопки #Дополнительно# вызывается диалог настройки
~дополнительных параметров поиска~@FindFileAdvanced@, которые используются для
настройки расширенного набора свойств поиска.

@FindFileAdvanced
$ #Дополнительные параметры поиска#
    #Искать только в первых:# - Введённая в поле #Содержащих текст#
(или в поле #Содержащих 16-ричный код#) строка может разыскиваться
не только во всём файле, но также в начале файла заданной длины.
Если файл длиннее указанного значения, то остаток файла будет
игнорироваться, даже если искомая последовательность там есть.

    При задании размера можно использовать следующие суффиксы:
    B - для байтов (также без суффикса);
    K - для килобайтов;
    M - для мегабайтов;
    G - для гигабайтов;
    T - для терабайтов;
    P - для петабайтов;
    E - для эксабайтов.

    #Типы колонок# - позволяет задавать формат вывода результатов поиска.
Типы колонок кодируются с помощью одной или нескольких букв, разделённых запятыми.
Допускаются следующие типы колонок:

    S[C,T,F,E] - размер файла
    P[C,T,F,E] - выделенный размер файла
    G[C,T,F,E] - размер потоков файла
                 где: C - форматировать размер файла;
                      T - использовать 1000 вместо 1024 как делитель;
                      F - показывать размер в виде десятичной дроби, используя
                          наиболее подходящую единицу измерения, например
                          0,97 К, 1,44 М, 53,2 Г;
                      E - компактный режим, не показывать пробел
                          перед суффиксом размера файла
                          (например, 0.97KB).

    D          - дата последней записи в файл
    T          - время последней записи в файл

    DM[B,M]    - дата и время последней записи в файл
    DC[B,M]    - дата и время создания файла
    DA[B,M]    - дата и время последнего доступа к файлу
    DE[B,M]    - дата и время изменения файла
                 где: B - краткий (Unix-стиль) формат времени файла;
                      M - использование текстовых имён месяцев.

    A          - атрибуты файла
    Z          - описание файла

    O[L]       - владелец файла
                 где: L - показывать имя домена.

    LN         - количество жёстких ссылок

    F          - количество потоков


    Атрибуты файла имеют следующие обозначения:

       #R#         - Только для чтения
       #A#         - Архивный
       #H#         - Скрытый
       #S#         - Системный
       #C#         - Сжатый
       #E#         - Зашифрованный
       #I#         - Неиндексируемый
       #D#         - Каталог
       #$#         - Разрежённый
       #T#         - Временный
       #O#         - Автономный
       #L#         - Точка повторной обработки
       #V#         - Виртуальный
       #G#         - Поток целостности
       #N#         - Нет данных очистки

    #Ширина колонок# - позволяет изменить ширину колонок результатов поиска.
Если ширина равна 0, то используется значение по умолчанию.

    Для использования 12-часового формата времени надо увеличить
на единицу стандартную ширину колонки времени файла или колонки
времени и даты файла. После дальнейшего увеличения в этих колонках
также будут показаны секунды и миллисекунды.

    Для показа года в 4-х символьном формате нужно увеличить ширину
колонки даты на 2.

    В отличие от режимов панелей, результат поиска может содержать только
одну колонку. Имя файла присутствует всегда - добавляется последней колонкой
автоматически.

    При указании колонок, отвечающих за показ ссылок и потоков (G, LN, и F) время
поиска увеличивается.

    Чтобы в результатах поиска отображать только имена файловых объектов без
дополнительных атрибутов, оставьте поле "Типы колонок" пустым.

    По умолчанию значения полей равны:
    "Типы колонок"   - D,S,A
    "Ширина колонок" - 14,13,0

@FindFileResult
$ #Поиск файла: клавиши управления#
    Во время или после завершения ~поиска~@FindFile@ вы можете использовать
клавиши управления курсором для передвижения по списку файлов и кнопки для
выполнения требуемых действий.

    Во время или после завершения поиска доступны следующие кнопки:

   #Новый поиск#     Начать новую операцию поиска.

   #Перейти#         Прервать поиск, сменить текущую папку и поместить
                   курсор на выбранный файл.

   #Смотреть#        Просмотр выбранного файла без прерывания поиска.

   #Панель#          Создать временную панель и заполнить её найденными
                   файлами.

   #Стоп#            Прервать поиск. Доступна во время поиска.

   #Отмена#          Прервать поиск и закрыть диалог.

    Во время поиска поддерживается просмотр и редактирование найденных файлов.

   Просмотр                                #Ctrl+Shift+F3, Numpad5, F3, Alt+F3#

    #Numpad5#, #F3# или #Alt+F3# используются для вызова ~встроенной~@Viewer@, внешней 
или ~ассоциированной~@FileAssoc@ программы просмотра, в зависимости от типа файла и 
~настроек программы просмотра~@ViewerSettings@.
    #Ctrl+Shift+F3# всегда вызывает встроенную программу просмотра, вне
зависимости от файловых ассоциаций.
    
   Редактирование                                    #Ctrl+Shift+F4, F4, Alt+F4#

    #F4# или #Alt+F4# вызывает ~встроенный~@Editor@, внешний или ~ассоциированный~@FileAssoc@
редактор, в зависимости от типа файла и ~настроек редактора~@EditorSettings@.
    #Ctrl+Shift+F4# всегда вызывает встроенный редактор, вне зависимости от
файловых ассоциаций.

    Редактирование и просмотр поддерживаются также для файловых систем
плагинов. Заметьте, что сохранение изменений в редакторе по клавише
#F2# для файловых систем плагинов будет вызывать операцию
#Сохранить в# вместо обычного #Сохранить#.


@FindFolder
$ #Поиск папки#
    Эта команда предназначена для быстрого поиска нужной папки в дереве папок.

    Для выбора папки вы можете использовать клавиши управления курсором или
набрать несколько начальных символов имени папки.

    Нажмите #Enter# для перехода в выбранную папку.

    #Ctrl+R# и #F2# позволяют перечитать дерево папок.

    #Gray +# и #Gray -# используются для быстрого перемещения вверх или вниз
по папкам одного уровня.

    #F5# позволяет развернуть окно на весь экран, повторное нажатие #F5# вернёт
размер окна в первоначальное состояние.

    С помощью #Ctrl+Enter# можно циклически перемещаться по элементам дерева в
соответствии с введённой в строке файловой маской. #Ctrl+Shift+Enter# позволяет
перемещаться по элементам в обратном направлении.

    См. также список ~макроклавиш~@KeyMacroFindFolderList@, доступных в поиске папок.

@Filter
$ #Фильтр#
    Фильтр служит для обработки определённых групп файлов по заданным
пользователем параметрам, при соблюдении которых файл будет обработан
использующей его операцией. Фильтр может настраиваться по разным типам
параметров.

    Диалог фильтра состоит из следующих элементов:

   #Имя фильтра#     Название, которое будет отображаться в списке
                   фильтров. Вы можете оставить это поле пустым.

                   Данный элемент отсутствует, если фильтр вызван
                   из команды ~Раскраска файлов и группы сортировки~@Highlight@.


   #Маска#           Одна или несколько ~масок файлов~@FileMasks@.

                   Файл попадает в условия фильтра, если включён
                   анализ масок файла и его имя соответствует хотя бы
                   одной маске. Если анализ масок отключён, то имя
                   файла не имеет значения.


   #Размер#          Минимальный и максимальный размер файла.
                   При задании размера можно использовать следующие суффиксы:
                   B или без суффикса - для байтов;
                   K - для килобайтов;
                   M - для мегабайтов;
                   G - для гигабайтов;
                   T - для терабайтов;
                   P - для петабайтов;
                   E - для эксабайтов.

                   Файл попадает в условия фильтра, если включён
                   анализ размера файла и он входит в введённый
                   диапазон. Если в качестве одной или обеих границ
                   диапазона ничего не введено (пустая строка), тогда
                   размер по этому условию не ограничивается.

                   Например:
                   >= 1K - выбрать файлы больше или равные 1 килобайт
                   <= 1M - до меньше или равные 1 мегабайт


   #Дата/время#      Дата/время начала и окончания действия фильтра.
                   Можно указать дату последней #записи#, дату
                   #создания# файла, дату последнего #доступа# или
                   дату #изменения#.

                   Кнопка #Текущая# позволяет заполнить поля времени
                   файла текущим временем, после чего вы можете
                   поменять отдельную составляющую даты и времени,
                   например только месяц или только минуты.
                   #Сброс#, чтобы очистить поля с датами и временем.

                   Файл попадает в условия фильтра, если включён
                   анализ даты файла и она попадает в введённый
                   диапазон и соответствует установленному типу.
                   Если одно или оба поля с датами пусто, тогда дата
                   по этому полю не ограничивается.

                   Например:
                   <= 31.01.2010 - выбрать файлы в период до 31 числа
                   >= 01.01.2010 - но после 1 января 2010 года

                   Опция #Относительная# позволяет переключиться
                   на работу с датой в относительном времени.
                   Логика работы при данной опции аналогична
                   арифметике с отрицательными числами.

                   Например:
                   <= 0  - выбрать файлы в период от "сегодня"
                   >= 30 - и до 30-ти дней назад включительно

   #Атрибуты#        Атрибуты включения и атрибуты исключения.

                   Файл попадает в условия фильтра, если включён
                   анализ атрибутов файла и он имеет все атрибуты
                   включения и не имеет атрибутов исключения:
                   #[x]# - атрибут включения - файл должен иметь
                         указанный атрибут.
                   #[ ]# - атрибут исключения - файл не должен иметь
                         указанный атрибут.
                   #[?]# - указанный атрибут не влияет на фильтр.

                   Атрибуты #Сжатый#, #Зашифрованный#, #Неиндексируемый#,
                   #Разрежённый#, #Временный# и #Автономный# используются
                   только на дисках с файловой системой NTFS. Атрибут
                   #Виртуальный# не используется в Windows 2000/XP/2003.
                   Атрибуты #Поток целостности# и #Нет данных очистки#
                   поддерживаются только на ReFS томах, начиная с
                   Windows Server 2012.


    #Более одной жёсткой ссылки#

    Используется только на дисках с файловой системой NTFS. Условие истинно,
когда на элемент данных, на который ссылается текущий файл, ссылается хотя бы ещё один файл.
    #Внимание#: использование этой опции может #значительно# замедлить работу.
                   


    Для быстрого отключения одного или нескольких условий фильтра отключите
соответствующие опции. Клавиша #Очистить# сбросит все условия фильтра.

@History
$ #История команд#
    История команд показывает список выполненных ранее команд. Кроме клавиш
управления курсором доступны следующие клавиши:

  Повторно выполнить команду                                    #Enter#

  Повторно выполнить команду в отдельном окне             #Shift+Enter#

  Повторно выполнить команду от имени администратора   #Ctrl+Alt+Enter#

  Поместить команду в командную строку                     #Ctrl+Enter#

  Очистить историю команд                                         #Del#

  Установить/снять пометку блокировки пункта истории              #Ins#

  Очистка текущего пункта истории                           #Shift+Del#

  Копировать содержимое текущей позиции истории                #Ctrl+C#
  в Буфер Обмена, не закрывая списка                     или #Ctrl+Ins#


    Для перехода к предыдущей или следующей команде непосредственно из
командной строки, можно использовать клавиши #Ctrl+E# или #Ctrl+X#
соответственно.

    Для сохранения истории команд после выхода, используйте соответствующую
опцию из ~диалога системных параметров~@SystemSettings@.

    Отмеченные пункты не будут удаляться при очистке истории.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@HistoryViews
$ #История просмотра и редактирования#
    История просмотра и редактирования файлов показывает список просмотренных
или редактируемых ранее файлов. Кроме клавиш управления курсором доступны
следующие клавиши:

  Повторно открыть файл на просмотр                             #Enter#
  или редактирование

  Поместить имя файла в командную строку                   #Ctrl+Enter#

  Очистить список истории                                         #Del#

  Очистка текущего пункта истории                           #Shift+Del#

  Установить/снять пометку блокировки пункта истории              #Ins#

  Обновить список, удалив недоступные файлы                    #Ctrl+R#

  Копировать содержимое текущей позиции истории                #Ctrl+C#
  в Буфер Обмена, не закрывая списка                     или #Ctrl+Ins#

  Открыть файл в ~редакторе~@Editor@                                         #F4#

  Открыть файл в ~программе просмотра~@Viewer@                               #F3#
                                                        или  #Numpad5#

    Элементы истории просмотра и редактирования после выбора передвигаются в
конец списка. Вы можете использовать #Shift+Enter#, чтобы выбрать элемент без
смены его позиции.

    Для сохранения истории просмотра и редактирования файлов после
выхода, используйте соответствующие опции из диалога ~системных параметров~@SystemSettings@.

  Примечания:

  1. ^<wrap>Операция обновления списка (Ctrl+R) может занять значительное время,
если файл находился на недоступном в данный момент сетевом ресурсе.

  2. ^<wrap>Отмеченные пункты не будут удаляться при очистке или обновлении истории.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@HistoryFolders
$ #История смены папок#
    История смены папок показывает список ранее посещаемых папок. Кроме клавиш
управления курсором доступны следующие клавиши:

  Перейти в указанную папку                                     #Enter#

  Перейти в указанную папку на пассивной панели      #Ctrl+Shift+Enter#

  Поместить имя папки в командную строку                   #Ctrl+Enter#

  Очистить список истории                                         #Del#

  Очистка текущего пункта истории                           #Shift+Del#

  Установить/снять пометку блокировки пункта истории              #Ins#

  Обновить список, удалив недоступные папки                    #Ctrl+R#

  Копировать содержимое текущей позиции истории                #Ctrl+C#
  в Буфер Обмена, не закрывая списка                     или #Ctrl+Ins#


    Элементы истории смены папок после выбора передвигаются в конец списка. Вы
можете использовать #Shift+Enter#, чтобы выбрать элемент без смены его позиции.

    Для сохранения истории смены папок после выхода, используйте
соответствующую опцию из диалога ~системных параметров~@SystemSettings@.

  Примечания:

  1. ^<wrap>Операция обновления списка (Ctrl+R) может занять значительное время,
если каталог находился на недоступном в данный момент сетевом ресурсе.

  2. ^<wrap>Отмеченные пункты не будут удаляться при очистке или обновлении истории.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@TaskList
$ #Список задач#
    Список задач показывает активные на данный момент задачи. Каждая строка
списка содержит PID процесса и заголовок окна задачи или путь исполняемого модуля.

    Из списка задач можно переключится на окно задачи или удалить задачу,
используя клавишу #Del#. Будьте осторожны с удалением задач. Эта операция
выполняется немедленно и любая несохранённая информация данной задачи будет
потеряна. Поэтому удаление задач должно использоваться только при
необходимости, например, если программа перестала отвечать на запросы
пользователя.

    Список задач может быть вызван либо из ~Меню команд~@CmdMenu@, либо
используя #Ctrl+W#. В последнем случае список задач также может быть вызван из
программы просмотра или редактора.

    #Ctrl+R# позволяет обновить список задач.

    #F2# переключает отображение с заголовка окна задачи на путь к 
исполняемому модулю и обратно.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@HotPlugList
$ #Список Hotplug-устройств#
    Список Hotplug-устройств показывает платы PC Card и друге аналогичные
устройства, установленные и работающие на компьютере.

    Для удаления устройства необходимо выбрать устройство в списке и нажать
клавишу #Del#. После этого Windows подготавливает устройство к безопасному
извлечению. По окончанию операции пользователю выводится уведомление о
возможности извлечения устройства.

    #Ctrl+R# позволяет обновить список подключённых устройств.


    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@CompFolders
$ #Сравнение папок#
    Команду сравнения папок можно выполнять, только когда обе панели на экране
являются ~панелями файлов~@FilePanel@. Она сравнивает содержимое отображаемых в
этих панелях папок. Файлы, которые присутствуют только в одной панели, или
файлы с более поздней датой записи, чем у файлов с тем же именем в другой
панели, становятся помеченными.

    Вложенные папки не сравниваются. Для сравнения файлов используется их имя,
дата и время, но не содержимое.


@UserMenu
$ #Меню пользователя#
    Меню пользователя предназначено для упрощения выполнения часто используемых
операций. Оно содержит заданные пользователем команды и последовательности
команд, которые могут быть выполнены с использованием этого меню. Меню
пользователя может включать вложенные меню. Специальные
~метасимволы~@MetaSymbols@ поддерживаются и в командах, и в заголовках команд
меню. Обратите внимание, что символ !?<title>?<init>! может быть использован
для ввода дополнительных параметров непосредственно перед выполнением команды.

    Для редактирования или создания главного или местного меню пользователя
применяется команда #Меню пользователя# из ~Меню команд~@CmdMenu@. Главное меню
пользователя может быть только одно. Главное меню вызывается в том случае, если
для текущей папки отсутствует местное меню. Местное меню может быть расположено
в любой папке. Вы можете в любой момент переключиться между местным меню и
главным меню с помощью клавиш #Shift+F2#. Вы также можете вызвать местное меню
из родительской папки с помощью клавиши #Backspace#.

    Для добавления разделителя в пользовательское меню нужно
добавить новый пункт меню (команду), в котором в качестве "Горячей клавиши"
указать "--". Удалить такой разделитель можно только через #Alt+F4#.

    Пункты меню пользователя можно перемещать #Ctrl+Up# или #Ctrl+Down#.

    Для выполнения команды из меню пользователя нужно выбрать её с помощью
клавиш управления курсором и нажать #Enter#. Также можно использовать
назначенную для данного пункта меню #горячую клавишу#.

    Вы можете удалить вложенное меню или пункт меню, используя клавишу #Del#,
вставить новое вложенное меню или пункт меню с помощью #Ins# и редактировать
существующее вложенное меню или пункт меню с помощью #F4#. Нажмите #Alt+F4# для
редактирования меню в виде текстового файла.

    В качестве горячих клавиш для обращения к пунктам меню могут использоваться
цифры, буквы и функциональные клавиши (#F1#..#F24#). Если использованы #F1# и #F4#,
их первоначальные функции теряются. В этом случае для редактирования меню может
применяться #Shift+F4#.

    При редактировании или создании пункта меню нужно ввести заголовок пункта,
который будет отображаться в меню, последовательность команд, выполняющихся при
выбора данного пункта меню, и, при необходимости, горячую клавишу для быстрого
доступа к этому пункту.

    При редактировании или создании вложенного меню достаточно ввести заголовок
вложенного меню и, при необходимости, горячую клавишу.

    Меню пользователя размещается в текстовых файлах #FarMenu.Ini# и может быть трёх типов:
    - ^<wrap>"Пользовательское меню" располагается в профиле пользователя.
    - ^<wrap>"Глобальное меню" располагается в папке Far Manager и имеет приоритет над "Пользовательским меню".
    - ^<wrap>"Локальное меню" располагается в текущем каталоге и имеет приоритет над прочими меню.

    Вы можете закрыть меню на любом уровне вложенности нажав #Shift+F10#.

    См. также: 
    
      Список ~макроклавиш~@KeyMacroUserMenuList@, доступных в меню пользователя.
      Клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@FileAssoc
$ #Ассоциации файлов#
    Far Manager поддерживает ассоциации файлов, которые позволяют задавать
разнообразные действия для запуска, редактирования и просмотра файлов, заданных
~маской~@FileMasks@.

    Вы можете добавить новые ассоциации с помощью команды #Ассоциации файлов# в
~Меню команд~@CmdMenu@.

    Вы можете задать несколько ассоциаций для одного типа файлов и выбирать
желаемую ассоциацию из меню.

    В списке ассоциаций доступны следующие действия:

    #Ins#        - ~добавить~@FileAssocModify@ новую ассоциацию

    #F4#         - ~изменить~@FileAssocModify@ настройки текущей ассоциации

    #Del#        - удалить текущую ассоциацию

    #Ctrl+Up#    - передвинуть ассоциацию вверх

    #Ctrl+Down#  - передвинуть ассоциацию вниз

    Если для данного файла отсутствуют ассоциированные команды запуска и
установлен параметр #Использовать стандартные типы# в ~Системных параметрах~@SystemSettings@,
то Far пытается использовать ассоциации Windows для запуска этого типа
файлов.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@FileAssocModify
$ #Настройка ассоциации файлов#
    Far позволяет задать шесть команд, ассоциированных с определённым типом
файла, заданным ~маской~@FileMasks@:

   #Команда запуска по Enter#      Выполняется при нажатии #Enter#

   #Команда запуска по Ctrl+PgDn#  Выполняется при нажатии #Ctrl+PgDn#

   #Команда просмотра#             Выполняется при нажатии #F3#

   #Альтернативная команда#        Выполняется при нажатии #Alt+F3#
   #просмотра#

   #Команда редактирования#        Выполняется при нажатии #F4#

   #Альтернативная команда#        Выполняется при нажатии #Alt+F4#
   #редактирования#

    Ассоциацию можно описать в поле #Описание ассоциации#.

    В ассоциированных командах могут использоваться специальные
~метасимволы~@MetaSymbols@.

  Примечания:

  1. ^<wrap>Если для данного файла отсутствуют ассоциированные команды
запуска и установлен параметр #Использовать стандартные типы#
в ~Системных параметрах~@SystemSettings@, то Far пытается использовать
ассоциации Windows для запуска этого типа файлов.

  2. ^<wrap>~Команды~@OSCommands@ операционной системы "IF EXIST" и "IF DEFINED"
позволяют сделать ассоциации более "умными" - если вы назначили несколько
ассоциаций для одного типа файлов, то в меню попадут только те ассоциации,
у которых условия будут выполняться.

@MetaSymbols
$ #Метасимволы#
    В ~ассоциированных командах~@FileAssoc@, ~пользовательском меню~@UserMenu@
и команде ~"Применить команду"~@ApplyCmd@ могут использоваться специальные
метасимволы:

    #!!#       символ '!'
    #!#        Длинное имя файла без расширения
    #!~~#       Короткое имя файла без расширения
    #!`#       Длинное расширение файла без имени (ext)
    #!`~~#      Короткое расширение файла без имени (ext)
    #!.!#      Длинное имя файла с расширением
    #!-!#      Короткое имя файла с расширением
    #!+!#      Аналогично !-!, но если длинное имя файла утеряно
             после выполнения команды, Far восстановит его
    #!@@!#      Имя файла, содержащего имена помеченных файлов
    #!$!#      Имя файла, содержащего короткие имена помеченных файлов
    #!&#       Список помеченных файлов
    #!&~~#      Список помеченных файлов с короткими именами
    #!:#       Текущий диск в формате "C:"
             Для сетевых каталогов - "\\\\server\\share"
    #!\\#       Текущий путь
    #!/#       Короткое имя текущего пути
    #!=\\#      Текущий путь с учётом ~символических ссылок~@HardSymLink@.
    #!=/#      Короткое имя текущего пути с учётом ~символических ссылок~@HardSymLink@.
    #!?!#      Описание файла

    #!?<title>?<init>!#
             При выполнении команды этот символ заменяется
             данными, введёнными пользователем. <title> и
             <init> - заголовок и исходный текст строки
             редактирования.

             Допускается использование нескольких таких символов
             в одной строке, например:

             grep !?Search for:?! !?In:?*.*!|c:\\far\\Far.exe -v -

             В <title> можно указать имя истории для строки <init>.
             В этом случае команда имеет следующий формат:

             #!?$<history>$<title>?<init>!#

             например:

             grep !?#$GrepHist$#Search for:?! !?In:?*.*!|Far.exe -v -

             Для отключения истории оставьте имя пустым.

             В <title> и <init> допускается использование прочих
             метасимволов, заключив их в круглые операторные скобки,
             например:

             grep !?В (!.!) найти:?! |Far.exe -v -

    #!###       Префикс "!##", указанный перед символом ассоциации
             файла, заставляет его (и все последующие) ссылаться
             на пассивную панель (см. примечание 4).
             Например, !##!.! обозначает имя текущего файла на
             пассивной панели.

    #!^#       Префикс "!^", указанный перед символом ассоциации
             файла, заставляет его (и все последующие) ссылаться
             на активную панель (см. примечание 4).
             Например, !^!.! обозначает имя текущего файла на
             активной панели, а конструкция !##!\\!^!.! - файл на
             пассивной панели с таким же именем, как имя текущего
             файла на активной панели.

  Примечания:

    1. ^<wrap>Far при обработке метасимволов подставляется только то, что они означают
(имя файла, расширение и т.д.). Никаких дополнительных символов (например,
кавычек или фамилий разработчиков Far) не подставляется и вы должны это сделать
сами, если потребуется. Например, если используемая в ассоциациях программа
требует, чтобы имя файла было в кавычках, то вы должны писать
#program.exe "!.!"#, а не #program.exe !.!#.

    2. ^<wrap>Для ассоциаций !@@! и !$! допускаются следующие модификаторы:

    'Q' - заключать имена с пробелами в кавычки;
    'S' - использовать '/' вместо '\\' в путях файлов;
    'F' - использовать полный путь;
    'A' - использовать кодовую страницу ANSI;
    'U' - использовать кодовую страницу UTF-8;
    'W' - использовать кодовую страницу UTF-16 (Little endian).

    Например, ассоциация #!@@AFQ!# - имя файла, содержащего имена помеченных
файлов с полным путём в кодовой странице ANSI; имена файлов, содержащие пробелы будут
заключены в кавычки.

    3. ^<wrap>Метасимволы !@@! и !$! в меню выбора (когда задано несколько ассоциаций)
показываются как есть, преобразование происходит в момент исполнения команды.

    4. ^<wrap>Префиксы "!##" и "!^" работают как переключатели для ассоциаций.
Действие этих префиксов распространяется до следующего подобного префикса.
Например:

    if exist !##!\\!^!.! diff -c -p !##!\\!^!.! !\\!.!

    "Если на пассивной панели существует такой же файл, как и на
    активной под курсором, то показать расхождения между файлом
    на пассивной панели и файлом на активной панели, независимо
    от имени текущего файла на пассивной панели"

    5. ^<wrap>Если нужно передать программе имя с завершающей обратной чертой,
используйте кавычки - #"!"\#.
    Например, распаковать rar-архив в папку с таким же именем:

    winrar x "!.!" "!"\


@SystemSettings
$ #Системные параметры#
  #Удалять в Корзину#
  Разрешает удаление файлов с использованием Корзины (Recycle Bin). Операция удаления в
Корзину осуществляется только для локальных жёстких дисков.

  #Использовать системную функцию копирования#
  Использовать функции копирования файлов, предоставляемые операционной системой, вместо внутренней
реализации копирования файлов. Это может быть полезно на NTFS, так как системная функция (CopyFileEx)
копирует расширенные атрибуты файлов. В то же время, при включённой опции будет недоступна возможность
разрезать файлы на части при ~копировании~@CopyFiles@ или перемещении и "интеллектуальное" копирование
разрежённых файлов.

  #Копировать открытые для записи файлы#
  Позволяет копировать файлы, которые открыты для записи другими программами. Этот режим удобен, когда
нужно скопировать открытый в течение долгого времени файл, но он может быть опасным, если этот файл
модифицируется одновременно с копированием.

  #Сканировать символические ссылки#
  Обрабатывать ~символические ссылки~@HardSymLink@ наравне с обычными подкаталогами при построении дерева
каталогов и определении суммарного размера файлов в подкаталогах.

  #Обновление панелей только если Фар активен#
  Если эта опция выставлена, то мониторинг файловых панелей Фар будет выполняться только тогда когда Фар активен,
т.е. обновления панелей не будет до тех пор, пока Фар не получит фокус ввода. Это позволяет не блокировать каталоги текущих панелей.
Но синхронизация состояния панелей при получении фокуса #иногда не срабатывает#. Поэтому эта опция по-умолчанию отключена,
и мониторинг файловых панелей выполняется даже тогда, когда Фар работает в фоне.

  #Сохранять историю команд#
  Вызывает сохранение ~истории команд~@History@ перед завершением и её восстановление после запуска Far.

  #Сохранять историю папок#
  Вызывает сохранение ~истории папок~@HistoryFolders@ перед завершением и её восстановление после запуска Far.
Для просмотра содержимого истории папок нажмите #Alt+F12#.

  #Сохранять историю просмотра и редактора#
  Вызывает сохранение ~истории просмотра и редактирования~@HistoryViews@ перед завершением и её восстановление
после запуска Far. Для просмотра входящих в этот список файлов нажмите #Alt+F11#.

  #Использовать стандартные типы файлов#
  Если это опция включена, то при нажатии Enter на файле, тип которого известен Windows и отсутствует
в ~ассоциациях файлов~@FileAssoc@ Far, будет запущена программа Windows, предназначенная для обработки этого типа файлов.

  #Автоматически монтировать CDROM#
  При выборе компакт-диска в ~Меню выбора диска~@DriveDlg@ Far задвинет открытый лоток привода компакт-дисков. Отключите эту опцию,
если автоматическое монтирование приводов работает некорректно (это может происходить из-за ошибок в драйверах
некоторых приводов)

  #Автообновление переменных окружения#
  При глобальном изменении переменных среды Far Manager автоматические корректирует значения своего окружения.

  #Запрос прав администратора#
  Во время выполнения разнообразных операций с файловой системой у текущего
пользователя может не хватать прав. В этом случае Far Manager может повторить 
попытку от имени администратора (повысить права текущего пользователя).

  Доступны следующие опции:

    #для изменения#
    ^<wrap>разрешить выполнять от имени администратора операции, изменяющие состояние файловой системы (например, создание, изменение и удаление файлов)

    #для чтения#
    ^<wrap>разрешить выполнять от имени администратора операции, не изменяющие состояние файловой системы (например, чтение файлов и просмотр папок).

    #использовать дополнительные привилегии#
    ^<wrap>при выполнении действий от имени администратора будет предоставлен доступ ко всем файлам, независимо от их списков контроля доступа (ACL).
    Не используйте эту опцию без необходимости.

  #Сортировочное сравнение#
  Выбор и настройки сравнения, используемого в сортировке.

    #порядковое# - на основании порядкового номера символов в строке
    #инвариантное# - инвариантное сравнение
    #лингвистическое# - с учетом языка и региональных параметров

    #Рассматривать цифры как числа#
    ^<wrap>Если включено, идущие подряд группы цифр рассматриваются как числа. Следующий пример показывает, как сортируются файлы:

    Режим выключен              Режим включён

    Ie4_01                      Ie4_01
    Ie4_128                     Ie4_128
    Ie401sp2                    Ie5
    Ie5                         Ie6
    Ie501sp2                    Ie401sp2
    Ie6                         Ie501sp2
    11.txt                      5.txt
    5.txt                       11.txt
    88.txt                      88.txt

    ^<wrap>Примечание: трактовка цифр как чисел при лингвистическом сравнении доступна в Windows 7 и выше. В более старых ОС будет автоматически использоваться инвариантное сравнение.

    #Учитывать регистр#
    ^<wrap>Учитывать регистр символов в строке.

    ^<wrap>Примечание: как именно будет учитываться регистр символов в строке зависит от сортировочного сравнения.


  #Автозапись конфигурации#
  Если эта опция включена, Far будет автоматически сохранять конфигурацию.
Также будут сохраняться текущие папки обеих панелей.


@PanelSettings
$ #Настройка панели#
  #Показывать скрытые#      Разрешает показ файлов с атрибутами
  #и системные файлы#       Скрытый и Системный. Этот режим также
                          может быть переключён с помощью #Ctrl+H#.

  #Раскраска файлов#        Разрешает ~раскраску файлов~@Highlight@

  #Пометка папок#           Разрешает пометку папок с использованием
                          #Gray +# и #Gray *#. В противном случае эти
                          команды работают только с файлами.

  #Правый клик#             Если эта опция включена, #Щелчок правой#
  #помечает файлы#          #кнопкой мыши# помечает файлы, иначе он
                          открывает Контекстное меню Проводника.

  #Сортировать имена#       Применять режим сортировки по расширению
  #папок по расширению#     не только к файлам, но и к папкам. При
                          включённой опции сортировка по расширению
                          работает так же, как и в Far 1.65.
                          Если опция выключена, то в режиме
                          сортировки по расширению папки будут
                          сортироваться так же, как в режиме
                          сортировки по имени.

  #Разрешить обратную#      Если эта опция включена, и текущий режим
  #сортировку#              сортировки файловой панели выбран повторно,
                          то будет установлен режим обратной
                          сортировки.

  #Отключать#               Механизм автоматического обновления панели
  #автообновление#          при изменении состояния файловой системы
  #панелей…#                будет отключаться, если количество файловых
                          объектов превысит заданное значение.

    ^<wrap>Механизм автоматического слежения за файловой системой работает
только для файловых систем FAT/FAT32/NTFS. Значение параметра,
равное нулю соответствует состоянию "автоматическое обновление
включено всегда". Для принудительного обновления панели
используйте #Ctrl+R#.

  #Автообновление#          Опция включает механизм автоматического
  #сетевых дисков#          обновления панели при изменении состояния
                          файловой системы на сетевых дисках.
                          ^<wrap>Отключение этой опции полезно на медленных сетевых подключениях.

  #Показывать заголовки#    Разрешает показ заголовков колонок
  #колонок#                 ~панели файлов~@FilePanel@.

  #Показывать строку#       Разрешает показ строки статуса
  #статуса#                 в панели файлов.

  #Определять точки#        Различать обычные связи для папок
  #монтирования диска#      (Junction) и точки монтирования дисков
                          томов (Volume).
                          ^<wrap>Эта опция существенно замедляет отображение каталога на медленных сетевых подключениях.

  #Показывать суммарную#    Разрешает показ суммарной информации
  #информацию#              в нижней строке панели файлов.

  #Показывать свободное#    Разрешает показ свободного места
  #место#                   на текущем диске.

  #Показывать полосу#       Разрешает показ полосы прокрутки в панели
  #прокрутки в панелях#     файлов и ~панели дерева папок~@TreePanel@.

  #Показывать количество#   Разрешает показ количества ~фоновых экранов~@ScrSwitch@.
  #фоновых экранов#

  #Показывать букву#        Показывать текущий режим сортировки
  #режима сортировки#       в верхнем левом углу панели.

  #Показывать ".."#         Показывать элемент ".." в корневых каталогах.
  #в корневых каталогах#    Нажатие #Enter# на этом элементе открывает
                          ~Меню выбора диска~@DriveDlg@.

@TreeSettings
$ #Настройки дерева папок#
  #Автосмена папки#         Если эта опция включена, то передвижение курсора
                          по ~дереву папок~@TreePanel@ будет синхронно менять папку в другой панели.
                          Если эта опция выключена, то для смены папки из дерева папок
                          вы должны нажать #Enter#.

  #Минимальное#             Минимальное количество папок на диске, для которого
  #количество папок#        будет создаваться файл кэша дерева каталогов #tree3.far#.

@InterfSettings
$ #Настройка интерфейса#
  #Часы в панелях#
  Показывать часы в верхнем правом углу экрана.

  #Часы при редактировании и просмотре#
  Показывать часы при редактировании и просмотре файлов.

  #Мышь#
  Использовать мышь.

  #Показывать линейку клавиш#
  Показывать назначения функциональных клавиш в нижней строке экрана.
Эта опция также может переключаться по #Ctrl+B#.

  #Всегда показывать меню#
  Показывать меню вверху экрана, даже когда оно неактивно.

  #Сохранение экрана#
  Запуск программы сохранения экрана после заданного в минутах интервала
бездействия. Хранитель экрана также включается, если подвести указатель
мыши в правый верхний угол окна Far Manager (при выбранной опции).

  #Показывать общий индикатор копирования#
  Показывать общий индикатор во время выполнения операции копирования.
Это может потребовать дополнительного времени перед началом копирования
для подсчёта общего размера файлов.

  #Показывать информацию о времени копирования#
  Выводить информации о средней скорости копирования, времени копирования и
примерном времени до конца операции в диалоге копирования.
  Так как эта функция требует времени для сбора статистики, то на
небольших файлах при выключенном "общем индикаторе копирования"
вы можете ничего не увидеть.

  #Показывать общий индикатор удаления#
  Показывать общий индикатор во время выполнения операции удаления.
Это может потребовать дополнительного времени перед началом удаления
для подсчёта общего количества файлов и папок.

  #Использовать Ctrl+PgUp для выбора диска#
  Комбинация клавиш #Ctrl+PgUp# в корневой папке позволяет вызвать
меню выбора дисков.
  Если установлен плагин Network, то для сетевых папок (и сетевых дисков при
третьем состоянии переключателя) будет показан список общих ресурсов сервера.

  #Учитывать состояние ClearType#
  При использовании векторных шрифтов и ClearType-сглаживания в консоли 
иногда могут наблюдаться визуальные артефакты, вызванные недостатками 
системных алгоритмов сглаживания, как правило, в виде тонких вертикальных 
линий на границе символов.

  При включённой опции будет задействован альтернативный способ вывода 
символов, позволяющий устранить эти артефакты, но это может несколько снизить 
скорость вывода.

  #Выставлять иконку консоли#
  При активации этой опции Фар будет сам устанавливать иконку своего окна,
используя при этом встроенную иконку. Если эта опция не активна, то с помощью
свойств запуска Фара можно установить любую желаемую иконку.

  #Альтернативная для администратора#
  При активации этой опции Фар будет использовать красную иконку вместо синей
в том случае, если Фар запущен пользователем, имеющим права администратора.

  #Дополнительная информация для заголовка окна#
  Дополнительная информация, выводимая в заголовке окна консоли.
Может содержать любой текст, включая переменные окружения (например "%USERDOMAIN%\%USERNAME%") и следующие специальные переменные:
  - #%Ver# - версия Far;
  - #%Build# - номер сборки Far;
  - #%Platform# - архитектура Far;
  - #%Admin# - ^<wrap>слово "Администратор", если Far запущен от имени администратора, иначе пустая строка.
  - #%PID# - ИД текущего процесса Far;


@DialogSettings
$ #Настройка диалогов#
  #История в строках#       Сохранять историю в строках ввода
  #ввода диалогов#          некоторых диалогов Far. Список ранее
                          введённых строк может быть вызван с помощью
                          мыши или #Ctrl+Up# и #Ctrl+Down#. Если вы
                          не хотите вести такую историю, например,
                          по соображениям безопасности, выключите
                          эту опцию.

  #Постоянные блоки#        Не снимать выделение при перемещении
  #в строках ввода#         курсора в строках ввода.

  #Del удаляет блоки#       Клавиша Del удаляет выделенный блок
  #в строках ввода#         в строках ввода.

  #Автозавершение#          Разрешает использование функции
  #в строках ввода#         автозавершения в строках ввода, имеющих
                          историю или в комбинированных списках.
                          При отключённой опции для автозавершения
                          строк можно воспользоваться комбинацией
                          клавиш #Ctrl+End#. Операция автозавершения
                          не работает во время записи и исполнения
                          макроса.

  #Backspace удаляет#       Если опция включена, то нажатие клавиши
  #неизменённый текст#      BackSpace в неизменённой текстовой
                          строке удаляет всю строку, как если бы
                          нажали клавишу #Del#.

  #Клик мыши вне диалога#   Щелчок левой или правой клавишей мыши
  #закрывает диалог#        за пределами диалога закрывает диалог
                          (подробнее см. ~Общие команды~@MiscCmd@).
                          Эта опция позволяет отключать указанную
                          функциональность.

   См. также список ~макроклавиш~@KeyMacroDialogList@, доступных в диалогах.

@VMenuSettings
$ #Настройка меню#
  #Клик левой кнопки мыши вне меню#
  #Клик правой кнопки мыши вне меню#
  #Клик средней кнопки мыши вне меню#
  Вы можете выбрать действие кнопок мыши при клике вне поля меню:
    - #Закрыть с отменой#
    - #Выполнить текущий пункт# 
    - #Ничего не делать#.

@CmdlineSettings
$ #Настройка командной строки#
  #Постоянные блоки#
  Не снимать выделение при перемещении в командной строке.

  #Del удаляет блоки#
  Клавиша Del удаляет выделенный блок в командной строке.

  #Автозавершение#
  Разрешает использование функции автозавершения в командной строке.
  При отключённой опции для автозавершения можно воспользоваться комбинацией
клавиш #Ctrl+Space#. Операция автозавершения не работает во время записи и
исполнения макроса.

  #Установить формат командной строки#
  Эта опция позволяет изменить ~формат приглашения~@CommandPrompt@ командной строки.

  #Использовать домашний каталог#
  Эта опция позволяет задавать папку, куда произойдёт переход командой ~CD ~~~@OSCommands@.
  Пустое значение пути также отключает функцию.


@PluginsManagerSettings
$ #Менеджер плагинов#
  #Поддержка OEM-плагинов#
  Позволяет использовать OEM-плагины (для Far Manager 1.x)

  #Сканировать символические ссылки#
  Позволяет искать плагины в ~символических ссылках~@HardSymLink@ наравне с обычными подкаталогами.

  #Обработка файла#

  #Пункт вызова стандартной ассоциации#

  #Даже если найден всего один плагин#

  #Результаты поиска (SetFindList)#

  #Обработка префикса#

@AutoCompleteSettings
$ #Настройка автозавершения#
  #Показывать список#
  Показать варианты автозавершения в виде списка.

  #Модальный режим#
  Список будет модальным.

  #Подставлять первый подходящий вариант#
  По мере ввода строка будет дополняться первым подходящим значением.

  Cуществует несколько дополнительных параметров, определяющих, какие источники данных будут использованы для наполнения списка автозавершения:
    #Interface.Completion.UseFilesystem#
    #Interface.Completion.UseHistory#
    #Interface.Completion.UsePath#
    #Interface.Completion.UseEnvironment#
  Все параметры могут принимаеть 3 состояния - да, нет, только в ручном режиме (после #Ctrl+Space#).
Управлять этими параметрами можно через ~far:config~@FarConfig@


@CommandPrompt
$ #Формат командной строки#
   Far позволяет изменить формат приглашения командной строки.
Для этого в поле ввода #Установить формат командной строки# диалога
~Настроек командной строки~@CmdlineSettings@ необходимо ввести нужную
последовательность переменных и специальных кодов, которая позволит
показать дополнительную информацию в приглашении.

   Допускается использовать переменные окружения и следующие
специальные коды:

     $a - символ &
     $b - символ |
     $c - символ (
     $d - текущая дата (зависит от системных настроек)
     $f - символ )
     $g - символ >
     $h - удалить предыдущий символ
     $l - символ <
     $n - буква текущего диска
     $p - текущий диск и путь
     $m - ^<wrap>полное имя удалённого диска, связанного с именем текущего диска, или пустой строки, если текущий диск не является сетевым
     $w - ^<wrap>текущий рабочий каталог (без указания пути)
     $q - символ =
     $s - пробел
     $t - текущее время в формате HH:MM:SS
     $$ - символ $
     $+ - глубина стека каталогов
     $##nn - максимальная ширина строки приглашения в процентах от ширины окна

     $@@xx - ^<wrap>"Администратор", если Far Manager запущен от имени администратора.
Вместо 'xx' необходимо указать два символа, которые будут обрамлять слово "Администратор".
Например, #$@@{}$s$p$g# будет представлен как "{Администратор} C:\>"

   По умолчанию используется последовательность #$p$g# - текущий дисковод
и путь ("C:\>").

   Примеры.

   1. ^<wrap>Приглашение формата #[%COMPUTERNAME%]$S$P$G# будет
содержать имя компьютера, текущий диск и путь
(переменная окружения %COMPUTERNAME% должна быть определена)

   2. ^<wrap>Приглашение формата #[$T$H$H$H]$S$P$G# перед текущем путём
выведет время в формате HH:MM

   3. ^<wrap>Код "$+" отображает нужное число знаков плюс (+) в зависимости
от текущей глубины стека каталогов ~PUSHD~@OSCommands@, по одному знаку на
каждый сохранённый путь.

   Элементы приглашения можно выделять #цветом#.

   Формат:
   #([[T]FFFFFFFF][:[T]BBBBBBBB])#, где

   #FFFFFFFF#
   цвет текста в формате aarrggbb или индекс в 16-цветной палитре.

   #BBBBBBBB#
   цвет фона в формате aarrggbb или индекс в 16-цветной палитре.

   #T#
   признак "труколорности", если он отсутствует - цвет считается индексом в стандартной палитре (0-F):

   \00 \11 \22 \33 \44 \55 \66 \77 \88 \99 \AA \BB \CC \DD \EE \FF \-
   0123456789ABCDEF

   Если цвет текста или фона не указан, используется значение по умолчанию.

   Примеры:

   #(E)#               \0eярко-жёлтый текст на стандартном фоне\-
   #(:F)#              \f7стандартный текст на белом фоне\-
   #(B:C)#             \cbярко-голубой текст на ярко-красном фоне\-
   #()#                \07стандартный текст на стандартном фоне\-
   #(T00CCCC:TE34234)# \(T00CCCC:TE34234)яйца дрозда на киновари\-

   Указанный цвет окрашивает приглашение до конца либо до следующего вхождения цвета.

   Пример использования:

   #(a)%username%(f)@@(b)%computername%() $p$g# \0aadmin\0f@@\0bserver\07 C:\\>\-

@Viewer
$ #Программа просмотра: клавиши управления#
  Клавиши навигации

  Поведение клавиш навигации зависит от ~режима просмотра~@ViewerMode@.

  Клавиши, работающие во всех режимах:

    #Up#                 ^<wrap>Строка вверх
    #Down#               Строка вниз
    #PgUp#               Экран вверх
    #PgDn#               Экран вниз
    #Home, Ctrl+Home#    В начало файла
    #End, Ctrl+End#      В конец файла

  В режиме #текст без переноса строк# работают дополнительные клавиши:

    #Left#               ^<wrap>Одна колонка влево
    #Right#              Одна колонка вправо
    #Ctrl+Left#          20 колонок влево
    #Ctrl+Right#         20 колонок вправо
    #Ctrl+Shift+Left#    Показать самую левую колонку
    #Ctrl+Shift+Right#   Показать самую правую колонку из всех строк,
видимых на экране

  В ~режимах~@ViewerMode@ #код# и #дамп# комбинации клавиш #Ctrl+Left#
и #Ctrl+Right# сдвигают текст в окне на один байт в соответствующем
направлении.

  Команды программы просмотра

    #F1#                 ^<wrap>Помощь
    #F2#                 Переключить режим переноса строк в режиме
#текст# или изменить ~режим просмотра~@ViewerMode@
    #Shift+F2#           Переключить способ переноса строк (по буквам
или по словам) в ~режиме просмотра~@ViewerMode@ #текст#
    #F4#                 Переключить ~режим просмотра~@ViewerMode@
в #код# и обратно
    #Shift+F4#           Выбрать ~режим просмотра~@ViewerMode@: #текст#,
#код# или #дамп#
    #F6#                 Переключиться в ~редактор~@Editor@
    #F7#                 ~Поиск~@ViewerSearch@
    #Shift+F7, Space#    Продолжить поиск
    #Alt+F7#             Продолжить поиск в обратном направлении
    #F8#                 Переключить кодовую страницу между OEM и ANSI
    #Shift+F8#           Выбрать кодовую страницу из ~меню~@CodePagesMenu
    #Alt+F8#             ~Изменить текущую позицию~@ViewerGotoPos@
    #Alt+F9#             Максимизировать или восстановить размер окна Far Manager;
см. также ~Interface.AltF9~@Interface.AltF9@
    #Alt+Shift+F9#       Вызов диалога ~настройки программы просмотра~@ViewerSettings@
    #Numpad5,F3,F10,Esc# Выход
    #Ctrl+F10#           Перейти на текущий файл на активной файловой панели.
    #F11#                Показать меню ~Команд плагинов~@Plugins@
    #Alt+F11#            Показать ~историю просмотра и редактирования~@HistoryViews@
    #Gray +#             Просматривать следующий файл на активной файловой панели
    #Gray -#             Просматривать предыдущий файл на активной файловой панели
    #Ctrl+O#             Показать пользовательский экран
    #Ctrl+Alt+Shift#     Временно показать пользовательский экран (пока
эти клавиши нажаты)
    #Ctrl+B#             Спрятать/показать полосу функциональных клавиш внизу экрана
    #Ctrl+Shift+B#       Спрятать/показать статусную строку
    #Ctrl+S#             Спрятать/показать полосу прокрутки
    #Alt+BS, Ctrl+Z#     Вернуться к предыдущей позиции
    #ПравыйCtrl+0..9#    Установить закладку 0..9 в текущей позиции
    #Ctrl+Shift+0..9#    Установить закладку 0..9 в текущей позиции
    #ЛевыйCtrl+0..9#     Перейти к позиции закладки 0..9
    #Ctrl+Ins, Ctrl+C#   Скопировать выделенный текст в буфер обмена.
Текст может быть выделен вручную или в результате ~поиска~@ViewerSearch@.
    #Ctrl+U#             Сбросить выделение текста
    #Shift+Клик мыши#    Выделить текст вручную
                       Первый клик мыши задаёт начало выделенной
области, второй клик -- конец области. После первого клика можно
использовать любые клавиши навигации, чтобы сделать видимой конечную
позицию, которая может быть раньше или позже начальной по тексту.

  См. также список ~макро клавиш~@KeyMacroViewerList@,
доступных в программе просмотра.

  Примечания:

    1. ^<wrap>Начните вводить образец поиска, чтобы открыть диалог
~поиска~@ViewerSearch@.

    2. ^<wrap>Программа просмотра открывает файл в режиме, когда
разрешено его удаление. Если другой процесс попытается удалить файл,
пока он открыт в программе просмотра, то файл будет удалён после
закрытия программы просмотра. Все операции на файле, находящемся в таком
состоянии, будут заканчиваться неуспехом. Это свойство операционной
системы Windows.

    3. ^<wrap>Максимальное число колонок, показываемых в
~режиме просмотра~@ViewerMode@ #текст#, можно задать в диалоге
~настроек программы просмотра~@ViewerSettings@. Допустимые значения
от 100 до 100 000, умолчание 10 000. Строки длиннее максимума будут разбиты
на несколько строк, даже если режим переноса строк отключён.

    4. ^<wrap>Far начинает ~поиск~@ViewerSearch@ (#F7#) от начала
видимой в данный момент области.

    5. ^<wrap>Для авто-скроллинга файла, который непрерывно пополняется
другим процессом (ср. Linux «tail»), установите текущую позицию на конец
файла (нажмите клавишу #End#).

@ViewerMode
$ #Программа просмотра: режимы просмотра#
    Программа просмотра может отображать файл в трёх режимах: #Текст#,
#Код# и #Дамп#. Текущий режим обозначается одной буквой в первой
(статусной) строке окна, слева от текущей кодовой страницы:
      #t# - Текст,
      #h# - Код,
      #d# - Дамп.

    При открытии файла, если опция #Сохранять режим просмотра#
в ~настройках программы просмотра~@ViewerSettings@
включена и открываемый файл есть в
~истории просмотра и редактирования~@HistoryViews@,
выбирается последний использованный режим.

      Иначе, если опция #Автовыбор дамп-режима просмотра# в
~настройках программы просмотра~@ViewerSettings@ включена и Far считает
файл бинарным, выбирается режим #дамп#.

      Иначе выбирается режим #текст#.

    Режим просмотра можно изменить вручную следующими клавишами:

      #Shift+F4# ^<wrap>Открывает меню #режима просмотра#. Если выбрать
режим #текст# или #дамп#, этот режим становится #базовым# режимом. Выбор
режима #код# переключает текущий режим, но не меняет #базовый# режим.

      #F4#       ^<wrap>Переключает режимы #текст# и #дамп# в #код#,
а режим #код# в последний установленный в меню #режима просмотра#
базовый режим (#текст# или #дамп#).

      #F2#       ^<wrap>В режиме #текст# включает или выключает режим
переноса длинных строк, переключает режим #дамп# в #текст# и переключает
режим #код# в режим противоположный последнему установленному в меню
#режима просмотра# базовому режиму (#дамп# или #текст#). То есть, #F4#
и #F2# переключают режим #код# в разные режимы.

    Режим #текст#

    В режиме #текст# программа просмотра отображает содержимое файла,
интерпретируя последовательности байт как строки символов, используя
кодировку, определённую текущей кодовой страницей. (Обратите внимание,
что в некоторых кодировках символ может быть представлен двумя и более
байтами.) Последовательности байт, недопустимые в текущей кодировке,
и символы, для которых нет изображения в шрифте окна консоли,
изображаются вопросительным знаком, или пустым прямоугольником, или
маленьким вопросительным знаком в прямоугольнике, или пробелом.
Представление зависит от шрифта окна консоли.

    Строки переводятся по обычным разделителям строк: U+000A U+000D
(формат Dos/Windows), U+000A (формат Unix), или U+000D (формат Mac).

    Длинные строки, которые не помещаются в окно, отображаются
не полностью либо переносятся и занимают по несколько строк экрана.
Клавиша #F2# включает и выключает режим переноса. В режиме переноса
комбинация клавиш #Shift+F2# включает или выключает перенос по словам.

    В режиме без переноса строк текст в окне можно двигать
горизонтально. Клавиша #Right# сдвигает текст на одну колонку влево,
клавиша #Left# сдвигает на одну колонку вправо (представьте сдвиг окна
по тексту). Комбинации клавиш #Ctrl+Right# и #Ctrl+Left# сдвигают на 20
колонок. Если опция #Показывать стрелки сдвига# в
~настройках программы просмотра~@ViewerSettings@ включена, строки,
не поместившиеся на экране, обозначаются символами #«# и #»#
у соответствующего края окна. Эти символы отображаются другим цветом.

    Максимальная длина строк ограничена параметром #Максимальная ширина строки#
~настроек программы просмотра~@ViewerSettings@. Более длинные строки
переносятся и отображаются на нескольких строках экрана даже если режим
переноса выключен.

    Режим #дамп#

    В режиме #дамп# программа просмотра отображает содержимое файла
посимвольно, без учёта переводов строк и управляющих символов, которые
отображаются как обычные символы. Символы заполняют строки экрана слева
направо. При достижении конца строки следующий символ отображается
в левой позиции следующей строки.

      ПРИМЕЧАНИЕ: Строго говоря, текст отображается по кодовым единицам,
а не по символам. Размер кодовой единицы зависит от кодировки текущей
кодовой страницы; один байт для однобайтовых кодировок (например, все
кодовые страницы ANSI) и UTF-8, два байта для кодировок UTF-16 and
UTF-16BE. Например:

      Кодовая страница 1252 (ANSI - Latin I): каждый байт отображается
в своей позиции экрана.

      Кодовая страница 65001 (UTF-8): символ отображается в позиции,
соответствующей ведущему байту последовательности UTF-8, а позиции
байтов продолжения заполняются символом #›# (кодовая позиция U+203A).

      Кодовая страница 1200 (UTF-16): каждая позиция экрана представляет
два последовательных байта начиная с чётного смещения в файле.

    В режиме #дамп# нет понятия строки текста. Вместо горизонтального
сдвига строк (ср. режим #текст# без переноса) текст сдвигается по одному
символу. Комбинация клавиш #Ctrl+Right# сдвигает все символы влево;
первый символ строки экрана становится последним в предыдущей строке.
Комбинация клавиш #Ctrl+Left# сдвигает все символы вправо, делая
последний символ строки экрана первым символом в следующей строке. Текст
как бы «перетекает» со строки на строку. Клавиши #Right# и #Left#
игнорируются.

    Режим #код# (Hex, шестнадцатеричные коды)

    В режиме #код# программа просмотра отображает файл по 16 байт в строке
экрана, начиная с шестнадцатеричного смещения первого байта строки,
за которым следует шестнадцатеричное представление байтов и их
символьное изображение.

    Отображение зависит от кодировки, определённой текущей кодовой
страницей. Для однобайтовых кодировок (например, все кодовые страницы
ANSI) байты на каждой строке изображаются 16 двузначными
шестнадцатеричными значениями, за которыми следует 16 символов. Для
кодировки UTF-8 байты изображаются так же, а символы отображаются
в позициях ведущих байт UTF-8 последовательностей. Байты продолжения
заполняются символом #›# (кодовая позиция U+203A). Для кодировки
UTF-16(BE) восемь последовательных пар байт (кодовых единиц)
изображаются восемью четырёхзначными шестнадцатеричными значениями,
за которыми следует восемь символов. Например:

      Кодовая страница 1252 (ANSI - Latin I)

@-
0000000000: 54 68 65 20 71 75 69 63 │ 6B 20 62 72 6F 77 6E 20  The quick brown
0000000010: 66 6F 78 20 6A 75 6D 70 │ 73 20 6F 76 65 72 20 74  fox jumps over t
0000000020: 68 65 20 6C 61 7A 79 20 │ 64 6F 67 27 73 20 62 61  he lazy dog's ba
0000000030: 63 6B 2E 0D 0A          │                          ck.♪◙
@+

      Кодовая страница 65001 (UTF-8)

@-
0000000035: D0 92 20 D1 87 D0 B0 D1 │ 89 D0 B0 D1 85 20 D1 8E  В› ч›а›щ›а›х› ю›
0000000045: D0 B3 D0 B0 20 D0 B6 D0 │ B8 D0 BB 2D D0 B1 D1 8B  г›а› ж›и›л›-б›ы›
0000000055: D0 BB 20 D1 86 D0 B8 D1 │ 82 D1 80 D1 83 D1 81 2C  л› ц›и›т›р›у›с›,
@+

      Кодовая страница 1200 (UTF-16)

@-
00000000A2: 043D 043E 0020 0444 │ 0430 043B 044C 0448  но фальш
00000000B2: 0438 0432 044B 0439 │ 0020 044D 043A 0437  ивый экз
00000000C2: 0435 043C 043F 043B │ 044F 0440 002C 0020  емпляр,
00000000D2: 0434 0430 002E 000D │ 000A                 да.♪◙
@+

    Комбинация клавиш #Ctrl+Right# сдвигает все байты влево; первый байт
строки экрана становится последним в предыдущей строке. Комбинация
клавиш #Ctrl+Left# сдвигает все байты вправо, делая последний байт
строки экрана первым байтом в следующей строке. В отличие от режима
#дамп# содержимое сдвигается по одному байту, а не по символу. Клавиши
#Right# и #Left# игнорируются.


@ViewerSearch
$ #Программа просмотра: поиск#
    Для поиска в ~программе просмотра~@Viewer@ вам доступны следующие режимы и
опции:

    #Искать текст#

      Поиск произвольного теста, набранного в строке #Искать#.
      В этом режиме доступны следующие опции:

        #Учитывать регистр#    - ^<wrap>при поиске будет учитываться регистр введённых символов.

        #Только целые слова#   - ^<wrap>при поиске будет произведён поиск только целого слова.

        #Регулярные выражения# - ^<wrap>рассматривать строку поиска, как ~регулярное выражение~@RegExp@.
Поиск построчный, поэтому многострочные конструкции и переводы строк не будут найдены.

    #Искать 16-ричный код#

      ^<wrap>Поиск фрагмента, соответствующего шестнадцатеричным кодам, набранного в строке #Искать#.

    #Обратный поиск#

      Изменить поиск на обратный - искать от конца файла к началу.


@Editor
$ #Редактор#
    Для редактирования выделенного курсором файла следует нажать #F4#. Может
использоваться как встроенный редактор, так и любой иной указанный
пользователем, выбор редактора осуществляется в меню
~Настройки редактора~@EditorSettings@.

    #Создание файлов с помощью редактора#

    Если после нажатия комбинации клавиш #Shift+F4# ввести имя файла, не
имеющегося на диске, то при этом будет создан новый файл.

    Примечания:

    1. ^<wrap>Если при открытии нового файла вы указали имя несуществующей папки, то
появится предупреждение: "~Путь к редактируемому файлу не существует~@WarnEditorPath@".

    2. ^<wrap>При попытке повторного открытия на редактирование файла, Far выдаст
предупреждение: "~Повторное открытие файла~@EditorReload@".

    3. ^<wrap>Кодовую страницу, используемую при создании нового файла можно выбрать в меню
~Настройки редактора~@EditorSettings@.

    #Клавиши управления#

    Команды управления курсором

   #Left#                    Символ влево
   #Ctrl+S#                  ^<wrap>Символ влево, но курсор не будет переходить на предыдущую строку при достижении начала строки
   #Right#                   Символ вправо
   #Up#                      Строку вверх
   #Down#                    Строку вниз
   #Ctrl+Left#               Слово влево
   #Ctrl+Right#              Слово вправо
   #Ctrl+Up#                 Прокрутка экрана вверх
   #Ctrl+Down#               Прокрутка экрана вниз
   #PgUp#                    Страницу вверх
   #PgDn#                    Страницу вниз
   #Home#                    В начало строки
   #End#                     В конец строки
   #Ctrl+Home, Ctrl+PgUp#    В начало файла
   #Ctrl+End, Ctrl+PgDn#     В конец файла
   #Ctrl+N#                  В начало экрана
   #Ctrl+E#                  В конец экрана

  Удаление

   #Del#                     ^<wrap>Удалить символ (также может удалить блок, в зависимости от ~Настроек редактора~@EditorSettings@)
   #BS#                      Удалить символ слева
   #Ctrl+Y#                  Удалить строку
   #Ctrl+K, Alt+D#           Удалить до конца строки
   #Ctrl+BS#                 Удалить слово слева
   #Ctrl+T, Ctrl+Del#        Удалить слово справа

  Операции над блоками

   #Shift+Клавиши курсора#   Пометка блока
   #Ctrl+Shift+Клав.курсора# Пометка блока
   #Alt+серые клав.курсора#  Пометка вертикального блока
   #Alt+Shift+Клав.курсора#  Пометка вертикального блока
   #Ctrl+Alt+серые клавиши#  Пометка вертикального блока
   #Ctrl+A#                  Пометить весь текст
   #Ctrl+U#                  Снять пометку с блока
   #Shift+Ins, Ctrl+V#       Скопировать блок из Буфера Обмена
   #Shift+Del, Ctrl+X#       Переместить блок в Буфер Обмена
   #Ctrl+Ins, Ctrl+C#        Скопировать блок в Буфер Обмена
   #Ctrl+<Gray +>#           Добавить блок в Буфер Обмена
   #Ctrl+D#                  Удалить блок
   #Ctrl+P#                  ^<wrap>Копировать блок в текущую позицию курсора (только в режиме постоянных блоков, Буфер Обмена не изменяется)
   #Ctrl+M#                  ^<wrap>Перенести блок в текущую позицию курсора (только в режиме постоянных блоков, Буфер Обмена не изменяется)
   #Alt+U#                   Сдвинуть блок влево
   #Alt+I#                   Сдвинуть блок вправо

  Прочие операции

   #F1#                      Помощь
   #F2#                      Сохранить файл
   #Shift+F2#                ~Сохранить файл как…~@FileSaveAs@
   #Shift+F4#                Редактировать ~новый файл~@FileOpenCreate@
   #F6#                      Переключиться в ~программу просмотра~@Viewer@
   #F7#                      ~Поиск~@EditorSearch@
   #Ctrl+F7#                 ~Замена~@EditorSearch@
   #Shift+F7#                Продолжить поиск/замену
   #Alt+F7#                  Продолжить поиск/замену в обратном направлении
   #F8#                      Переключение OEM/ANSI кодовой страницы
   #Shift+F8#                Выбор кодовой страницы
   #Alt+F8#                  ~Перейти~@EditorGotoPos@ на указанную строку и позицию
   #Alt+F9#                  ^<wrap>Максимизировать или восстановить размер окна Far Manager; см. также ~Interface.AltF9~@Interface.AltF9@
   #Alt+Shift+F9#            Вызов диалога ~настроек редактора~@EditorSettings@
   #F10, F4, Esc#            Выход
   #Shift+F10#               Сохранение и выход
   #Ctrl+F10#                ^<wrap>Позиционировать на текущий файл без выхода.
   #F11#                     Вызвать меню "~Команды плагинов~@Plugins@"
   #Alt+F11#                 Показать ~историю просмотра и редактирования~@HistoryViews@
   #Alt+BS, Ctrl+Z#          Отмена действия (Undo)
   #Ctrl+Shift+Z#            Повтор действия (Redo)
   #Ctrl+L#                  ^<wrap>Запретить модификацию редактируемого текста
   #Ctrl+O#                  Показать пользовательский экран
   #Ctrl+Alt+Shift#          ^<wrap>Временно показать пользовательский экран (работает до тех пор, пока удерживаем эти клавиши)
   #Ctrl+Q#                  ^<wrap>Рассматривать следующую комбинацию клавиш как код символа
   #ПравыйCtrl+0..9#         Установить закладку 0..9 в текущей позиции
   #Ctrl+Shift+0..9#         Установить закладку 0..9 в текущей позиции
   #ЛевыйCtrl+0..9#          Перейти к позиции закладки 0..9
   #Shift+Enter#             ^<wrap>Вставить в позицию курсора имя текущего файла на панели.
   #Ctrl+Shift+Enter#        ^<wrap>Вставить в позицию курсора имя текущего файла на пассивной панели.
   #Ctrl+F#                  ^<wrap>Вставить в позицию курсора полное имя редактируемого файла.
   #Ctrl+B#                  ^<wrap>Спрятать/Показать линейку функциональных клавиш
   #Ctrl+Shift+B#            Спрятать/Показать статусную строку

   См. также список ~макроклавиш~@KeyMacroEditList@, доступных в редакторе.

   Примечания:

   1. #Alt+U#/#Alt+I# сдвигают текущую строку, если блок не выделен.

   2. ^<wrap>Alt+Код символа на дополнительной клавиатуре вставляет в
редактируемую строку символ с указанным кодом (0-65535).

   3. ^<wrap>Если блок не выделен, то #Ctrl+Ins#/#Ctrl+C# помечают текущую
строку как блок и копируют её в Буфер Обмена.

@EditorSearch
$ #Редактор: поиск и замена#
    Для поиска и замены в ~редакторе~@Editor@ вам доступны следующие режимы и опции:

      #Учитывать регистр#    - ^<wrap>при поиске будет учитываться регистр введённых символов.

      #Только целые слова#   - ^<wrap>при поиске будет произведён поиск только целого слова.

      #Обратный поиск#       - ^<wrap>изменить поиск на обратный - искать от конца файла к началу.

      #Регулярные выражения# - ^<wrap>использовать регулярные выражения для ~поиска~@RegExp@ и ~замены~@RegExpRepl@.
Поиск построчный, поэтому многострочные конструкции и переводы строк не будут найдены.

      ~Сохранять стиль~@PreserveStyle@      - ^<wrap>сохранять стиль (регистр и разделители в исходном коде программ) заменяемого образца.

    При нажатии кнопки #Всё# будет показано ~меню~@FindAllMenu@ результатов поиска всех вхождений.

@PreserveStyle
$ #Редактор: Режим замены - Сохранять стиль#
    Режим ~замены~@EditorSearch@ #«Сохранять стиль»# в ~редакторе~@Editor@
осуществляет замену с сохранением стиля (регистр, разделители)
заменяемого текста. Этот режим может быть удобен для работы с исходным
кодом программ. Вот несколько примеров. Обратите внимание, что в каждом
случае сохранён стиль заменяемых строк.

@-
    ┌───────────────────┬────────────────────┬──────────────────────┐
    │ Искать / Заменить │ До замены          │ После замены         │
    ├───────────────────┼────────────────────┼──────────────────────┤
    │ tu / to           │ #Tu# be or not #tu# be │ #To# be or not #to# be   │
    ├───────────────────┼────────────────────┼──────────────────────┤
    │ UserName          │ writerUserName     │ writerPersonLogin    │
    │  /                │ user.NAME          │ person.LOGIN         │
    │ PersonLogin       │ DEFAULT_USER_NAME  │ DEFAULT_PERSON_LOGIN │
    │                   │ default-User-name  │ default-Person-login │
    └───────────────────┴────────────────────┴──────────────────────┘
@+

    #Более формально.#

    Основная операция, используемая в алгоритме, это разбор строки
на токены. Токены разделяются одной литерой-разделителем или между
строчной и прописной буквами. Разделителем токенов может быть
#подчёркивание “_”#, #дефис “-”#, и #точка “.”#. Все токены должны быть
разделены одним и тем же разделителем. Если разбор неоднозначен, то вся
строка считается одним токеном. Например:

@-
    ┌──────────────────────┬──────────────────────┬─────────────────┐
    │ Образец поиска       │ Токены               │ Комментарий     │
    ├──────────────────────┼──────────────────────┼─────────────────┤
    │ testMe               │ test Me              │                 │
    │ WhatIsIt             │ What Is It           │                 │
    │ far-manager          │ far manager          │                 │
    │ Contact.Address.Type │ Contact Address Type │                 │
    │ USER_FIRST_NAME      │ USER FIRST NAME      │                 │
    ├──────────────────────┼──────────────────────┼─────────────────┤
    │ test_userName        │ test_userName        │ Неоднозначные   │
    │ one.two-three        │ one.two-three        │ разделители     │
    │ aBc.dEf.gHi          │ aBc.dEf.gHi          │                 │
    ├──────────────────────┼──────────────────────┼─────────────────┤
    │ A..B                 │ A..B                 │ Смежные         │
    │                      │                      │ разделители     │
    └──────────────────────┴──────────────────────┴─────────────────┘
@+

    В результате разбора также определяется общий тип разделителя и
стиль каждого токена. Токены бывают трёх стилей: #Title#case,
#lower#case, и #UPPER#case. Если в токене встречаются прописные
и строчные буквы или не-буквы, стиль такого токена не определён. Токен
состоящий из одной прописной буквы считается одновременно #Title#case
и #UPPER#case.

    #Для замены с сохранением стиля используется алгоритм, описанный ниже.#

    Образец поиска и строка замены разбираются по описанным выше
правилам. В тексте ищется строка, которая может быть разобрана на такие
же токены, как и образец поиска. Сравнение осуществляется в соответствии
с режимами поиска #«Учитывать регистр»# и #«Только целые слова»#.

    Если в найденной строке и в строке замены одинаковое количество
токенов, и у найденных токенов есть общий стиль (при этом #Title#case
предпочтительнее, чем #UPPER#case), токены замены преобразуются к этому
общему стилю. Если общий стиль не удаётся определить, то токены замены
преобразуются к стилю соответствующих им найденных токенов. После
преобразования токены замены соединяются через разделитель, полученный
при разборе найденной строки. Результат используется как строка замены.
Несколько примеров:

@-
    ┌───────────────────┬────────────────────┬──────────────────────┐
    │ Искать / Заменить │ До замены          │ После замены         │
    ├───────────────────┼────────────────────┼──────────────────────┤
    │ abc-def-ghi       │ AbcDefGhi          │ PqRstXyz             │
    │  /                │ ABC_DEF_GHI        │ PQ_RST_XYZ           │
    │ pq.RST.Xyz        │ abc.def.ghi        │ pq.rst.xyz           │
    │                   │ abcDefGhi          │ pqRstXyz             │
    │                   │ ABC_Def_Ghi        │ PQ_Rst_Xyz           │
    ├───────────────────┼────────────────────┼──────────────────────┤
    │ AA-B-C            │ Aa_B_C             │ Xxx_Yy_Zz            │
    │  /                │ aa-b-c             │ xxx-yy-zz            │
    │ xxx.Yy.ZZ         │ AA_B_C             │ XXX_YY_ZZ            │
    │                   │ aa.B.C             │ xxx.Yy.Zz            │
    │                   │ Aa.B.c             │ Xxx.Yy.zz            │
    └───────────────────┴────────────────────┴──────────────────────┘
@+

    Если в найденной строке и в строке замены количество токенов
не одинаково, первый токен и остальные токены обрабатываются
по отдельности. Первый токен замены наследует стиль первого найденного
токена. Остальные токены замены преобразуются к общему стилю остальных
найденных токенов. Если общий стиль не удаётся определить, то остальные
токены замены не изменяются. Как и в предыдущем случае, токены замены
соединяются через разделитель, полученный при разборе найденной строки,
и результат используется как строка замены. Примеры:

@-
    ┌───────────────────┬────────────────────┬──────────────────────┐
    │ Искать / Заменить │ До замены          │ После замены         │
    ├───────────────────┼────────────────────┼──────────────────────┤
    │ abc-def-ghi       │ Abc.def.ghi        │ Pq.rst.uvw.xyz       │
    │  /                │ ABC.Def.Ghi        │ PQ.Rst.Uvw.Xyz       │
    │ pq.RST.uvw.Xyz    │ abc.Def.ghi        │ pq.RST.uvw.Xyz       │
    │                   │ ABC.DEF.ghi        │ PQ.RST.uvw.Xyz       │
    ├───────────────────┼────────────────────┼──────────────────────┤
    │ A-B-C             │ A_B_C              │ Aa_Bb_Cc_Dd          │
    │  /                │ a-b-c              │ aa-bb-cc-dd          │
    │ aa.Bb.cc.DD       │ A.B.c              │ Aa.Bb.cc.DD          │
    └───────────────────┴────────────────────┴──────────────────────┘
@+

    В специальном случае, когда найденная строка состоит из одного
токена, а в строке замены несколько токенов, первый токен замены
наследует стиль найденного токена. Общий стиль остальных токенов замены
и тип разделителя выводятся их контекста найденной строки. Если сделать
это не удаётся, общим стилем считается стиль (единственного) найденного
токена, а разделителем -- пустая строка. Как и раньше, преобразованные
токены замены соединяются и используются как строка замены. Ещё
несколько примеров:

@-
    ┌───────────────────┬────────────────────┬──────────────────────┐
    │ Искать / Заменить │ До замены          │ После замены         │
    ├───────────────────┼────────────────────┼──────────────────────┤
    │ ijk               │ ijk.Zzz            │ mno.Pqr.Stu.Zzz      │
    │  /                │ AAA-ijk            │ AAA-mno-pqr-stu      │
    │ MnoPqrStu         │ aaa-ijk_ZZZ        │ aaa-mno_PQR_STU_ZZZ  │
    │                   │ AaaIjk             │ AaaMnoPqrStu         │
    │                   │ 0_ijk_9            │ 0_mno_Pqr_Stu_9      │
    │                   │ >ijk<              │ >mnopqrstu<          │
    └───────────────────┴────────────────────┴──────────────────────┘
@+

    Если образец поиска не удаётся найти по вышеописанным правилам,
но удаётся найти, как обычную строку, и найденная строка и строка замены
начинаются с буквы, то регистр первой буквы строки замены изменятся
на регистр первой буквы найденной строки. Например:

@-
    ┌───────────────────┬────────────────────┬──────────────────────┐
    │ Искать / Заменить │ До замены          │ После замены         │
    ├───────────────────┼────────────────────┼──────────────────────┤
    │ ab.cd / wx-yz     │ #A#b.cD              │ #W#x-yz                │
    └───────────────────┴────────────────────┴──────────────────────┘
@+


@FindAllMenu
$ #Редактор: Меню результатов поиска всех вхождений#
    В этом меню доступны следующие сочетания клавиш:

        #F5#                - Переключить размер меню.

        #Ctrl+Up#           - Прокручивать текст в редакторе.
        #Ctrl+Down#

        #Ctrl+Enter#        - Перейти к позиции найденного текста.
        #Ctrl+Щелчок левой#
          #кнопки мыши#

        #Gray +#            - ^<wrap>Добавить сеансовую закладку с текущей позицией.

        #ПравыйCtrl+0..9#   - Установить закладку 0..9 в текущей позиции.
        #Ctrl+Shift+0..9#

        #ЛевыйCtrl+0..9#    - Перейти к позиции закладки 0..9.

@FileOpenCreate
$ #Редактор: Открыть/создать файл#

    Комбинация клавиш #Shift+F4# открывает существующий или создаёт
новый файл.

    Если указанный файл не существует, будет создан новый файл. Кодовая
страница для нового файла задаётся в списке #Кодовых страниц#. Если
в списке выбрано #По умолчанию#, то используется кодовая страница,
определённая в ~настройках редактора~@EditorSettings@.

    Кодовая страница для существующего файла определяется в соответствии
c выбором в списке #Кодовых страниц#.

    #По умолчанию#   - ^<wrap>Если файл открывался ранее и для него уже
сохранена кодовая страница (зависит от состояния параметра #Сохранять#
#позицию файла# в ~настройках редактора~@EditorSettings@), используется
сохранённая кодовая страница. Иначе, если в файле присутствует Byte
Order Mark, используется соответствующая Юникодная кодовая страница
-- UTF-8, UTF-16 (Little endian) или UTF-16 (Big endian). Иначе кодовая
страница определяется ~автоматически~@CodePageAuto@.

    #Автоматическое# - Делается попытка ~автоматически~@CodePageAuto@ определить
    #определение#      кодовую страницу по содержимому файла.

    #Определённая#   - Используется выбранная кодовая страница.
    #кодовая#
    #страница#

@FileSaveAs
$ #Редактор: сохранить файл как…#
    Редактируемый файл можно сохранить под другим именем - нажать #Shift+F2# и
указать другое имя, кодовую страницу и формат представления символа перевода
строки.

    Если для сохраняемого файла выбрана одна из кодовых страниц: UTF-8,
UTF-16 (Little endian) или UTF-16 (Big endian), то при включённой опции #Добавить сигнатуру (BOM)#
в начало файла добавляется специальный маркер, позволяющий другим приложениям
однозначно идентифицировать этот файл.

    Вы можете также указать формат представления символа перевода строки:

    #Исходный формат#
    Не изменять символы перевода строк.

    #В формате DOS/Windows (CR LF)#
    В качестве последовательности перевода строк будут
    использоваться два символа - возврат каретки и перевод
    строки (CR LF), принятые в DOS/Windows.

    #В формате UNIX (LF)#
    В качестве последовательности перевода строк будет
    использоваться символ перевода строки (LF), принятый в
    UNIX.

    #В формате MAC (CR)#
    В качестве последовательности перевода строк будет
    использоваться символ возврата каретки (CR), принятый в
    MAC.


@EditorGotoPos
$ #Редактор: перейти на указанную позицию#
    Этот диалог позволяет сменить позицию в редакторе

    ^<wrap>Вы можете ввести абсолютное или относительное значение или процентное соотношение в десятичной или 16-ричной системе.
    ^<wrap>Для относительного добавьте #+# или #-# перед значением.
    ^<wrap>Для процентного добавьте #%# после значения.
    ^<wrap>Для десятичной добавьте #m# после значения или выключите #16-ричное значение#.
    ^<wrap>Для 16-ричной добавьте #0x# или #$# перед значением, или #h# после, или включите #16-ричное значение#.

    Первое значение будет интерпретировано как номер строки, второе - как номер символа.
Значения должны быть разделены пробелом или одним мз следующих символов: #,.;:#.
Если значение опущено, соответствующий параметр не будет изменен.


@EditorReload
$ #Редактор: повторное открытие файла#
    Far Manager отслеживает все попытки повторного открытия в редакторе уже
редактируемых файлов. Правила повторного открытия следующие:

    1. Если файл не был изменён, то при отключённой опции "Повторное открытие
файла в редакторе" в диалоге ~подтверждений~@ConfirmDlg@ происходит переход к
редактированию текущего файла без дополнительных запросов.

    2. Если файл был изменён или включена опция "Повторное открытие файла в
редакторе", то существует три варианта действий:

    #Текущий#     - Продолжить редактирование того же файла.

    #Новая копия# - Файл будет открыт для редактирования в новой
                  копии редактора. В этом случае будьте внимательны:
                  содержимое файла на диске будет соответствовать
                  тому, в какой из копий редактора последний раз
                  сохраняли этот файл.

    #Перегрузить# - Текущие изменения не сохраняются и в редактор
                  загружается прежнее содержимое файла (с момента
                  последнего сохранения).



@WarnEditorPath
$ #Предупреждение: Путь к редактируемому файлу не существует#
    При открытии нового файла в ~редакторе~@Editor@ вы указали имя
несуществующей папки. Перед сохранением файла Far создаст такую папку при
условии, что вами указан корректный путь (некорректным будет, например, путь,
начинающийся с несуществующей буквы диска) и что вы имеете достаточно
полномочий на создание папки.


@WarnEditorPluginName
$ #Предупреждение: Имя редактируемого файла не может быть пустым#
    Для создания нового файла на активной панели плагина необходимо указать
имя файла.


@WarnEditorSavedEx
$ #Предупреждение: Файл был изменён внешней программой#
    Дата/время записи или размер редактируемого файла на диске не
совпадают с теми, которые Far запомнил при последнем обращении к этому файлу.
Это означает, что другая программа, другой пользователь (или даже вы сами в
другом окне редактора) изменили содержимое файла на диске.

    Если вы нажмёте "Сохранить", файл будет перезаписан, и все изменения,
внесённые внешней программой, будут утеряны.


@CodePagesMenu
$ #Меню выбора кодовой страницы#
    Это меню позволяет выбрать кодовую страницу в редакторе и программе
просмотра.

    Меню разделено на несколько частей:

        #Автоматическое# - Far попытается ~автоматически~@CodePageAuto@ определить
        #определение#      кодовую страницу текста;

        #Системные#      - ^<wrap>основные однобайтные системные
кодовые страницы - ANSI и OEM;

        #Юникод#         - ^<wrap>Юникодные кодовые страницы;

        #Избранные#      - ^<wrap>кодовые страницы, выбранные
пользователем;

        #Прочие#         - ^<wrap>все остальные установленные в системе
кодовые страницы.

    В этом меню доступны следующие сочетания клавиш:

        #Ctrl+H# – ^<wrap>Показывает или скрывает раздел #Прочие#.

        #Ins#    - ^<wrap>Перемещает кодовую страницу из раздела
#Прочие# в раздел #Избранные#.

        #Del#    - ^<wrap>Перемещает кодовую страницу из раздела
#Избранные# обратно в раздел #Прочие#.

        #F4#     - ^<wrap>Открывает диалог
~Переименования кодовой страницы~@EditCodePageNameDlg@.
Переименованы могут быть только #Избранные# и #Прочие# кодовые страницы.
Переименованные кодовые страницы помечаются символом #*#.

    Смотри также общие ~клавиатурные команды меню~@MenuCmd@.

@EditCodePageNameDlg
$ #Переименование кодовой страницы#
    Этот диалог позволяет переименовать #Избранные# и #Прочие# кодовые
страницы. Far будет показывать новые имена кодовых страниц в меню
~кодовых страниц~@CodePagesMenu@.

    Кнопка #Сбросить# устанавливает имя кодовой страницы в заданное
системой значение по умолчанию. Имя также можно сбросить, оставив его
пустым и нажав кнопку #OK#.

@DriveDlg
$ #Меню выбора диска#
    Это меню позволяет сменить текущий диск панели или открыть новую панель ~плагина~@Plugins@.

    Выберите пункт меню с соответствующей буквой диска для смены текущего диска
или пункт с названием плагина, чтобы создать новую панель плагина. Если панель не
является ~панелью файлов~@FilePanel@, её тип будет изменён на панель файлов.

    Клавиши #Ctrl+A#, #F4# для дисков вызывают диалог ~файловых атрибутов~@FileAttrDlg@.

    Клавиши #Ctrl+A#, #F4# для плагинов позволяют назначить горячую клавишу.

    Клавиша #F3# показывает техническую информацию по плагину.

    Клавиша #Del# может использоваться для:

    - ~отсоединения~@DisconnectDrive@ сетевого диска;

    - удаления SUBST-диска;

    - отсоединения виртуального диска;

    - извлечения дисков из CD-ROM и сменных приводов. Для операции извлечения
      диска из ZIP-приводов требуются права администратора.
      Закрыть CD-ROM можно клавишей #Ins#.

    Комбинация #Shift+Del# используется для подготовки к безопасному
извлечению запоминающих устройств для USB. Если диск, для которого
применяется функция извлечения, является одной из flash-карт, вставленных
в картридер с поддержкой нескольких flash-карт, то будет отключён сам
картридер.

    #Ctrl+1# - #Ctrl+9# переключают отображение различной информации:

    #Ctrl+1# - ^<wrap>тип диска;
    #Ctrl+2# - ^<wrap>сетевое имя / путь, ассоциированный с SUBST-диском
/ имя файла, содержащего виртуальный диск;
    #Ctrl+3# - ^<wrap>метка диска;
    #Ctrl+4# - ^<wrap>тип файловой системы;
    #Ctrl+5# - ^<wrap>размер диска и количество свободного места (эта опция имеет
два режима, нажмите два раза чтоб увидеть);
    #Ctrl+6# - ^<wrap>параметры сменных дисков;
    #Ctrl+7# - ^<wrap>плагины;
    #Ctrl+8# - ^<wrap>параметры компакт-дисков;
    #Ctrl+9# - ^<wrap>параметры сетевых дисков.

    Настройки #меню выбора диска# сохраняются в конфигурации Far.

    #F9# показывает ~диалог~@ChangeDriveMode@ для настройки отображения
этой информации.

    При включённой опции "~Использовать Ctrl+PgUp для выбора диска~@InterfSettings@",
комбинация клавиш #Ctrl+PgUp# аналогична клавише #Esc# - отказаться от
выбора диска и закрыть меню.

    #Shift+Enter# вызывает Проводник с показом корня указанного диска (работает
только для дисков).

    #Ctrl+R# позволяет обновить меню выбора диска.

    Если включён показ параметров компакт-дисков (#Ctrl+8#), то Far будет
пытаться определить тип CD-привода. Различаются следующие приводы: CD-ROM,
CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW и DVD-RAM. Функция определения типа привода
требует или административных прав, или разрешения доступа к локальным СD-приводам
с помощью политик (для этого надо запустить из командной строки утилиту #secpol.msc#
и установить настройку '#Локальные политики/Параметры безопасности/Устройства:#
#Разрешить доступ к дисководам компакт-дисков только локальным пользователям#'
в значение '#Разрешить#').

    #Alt+Shift+F9# позволяет ~настроить параметры~@PluginsConfig@ плагинов
(работает, если включён показ имён плагинов).

    #Shift+F9# в области плагинов вызывает диалог настройки соответствующего плагина.

    #Shift+F1# в области плагинов показывает соответствующую
плагину контекстно-зависимую подсказку (если у плагина есть файл помощи).

    Символ #A# в крайней левой колонке меню означает, что соответствующий плагин
разработан для Far 1.7x и не поддерживает всех возможностей текущей версии Far (в частности,
символов Unicode в именах файлов и в редакторе).

    См. также:
   
    Список ~макроклавиш~@KeyMacroDisksList@, доступных в меню выбора диска.
    Клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@ChangeDriveMode
$ #Настройка меню выбора диска#
    Диалог позволяет управлять показом информации в
~меню выбора диска~@DriveDlg@.

    #Показывать тип диска#
    Показать тип диска: “жёсткий”, “сетевой” и т.п.
    Комбинация клавиш в меню: #Ctrl+1#.

    #Показывать метку диска#
    Показать метку диска (если есть).
    Комбинация клавиш в меню: #Ctrl+3#.

    #Использовать имя оболочки#
    Запрашивать имя диска у оболочки Windows.
    Комбинация клавиш в меню: #Ctrl+3# (повторное нажатие).

    #Показывать тип файловой системы#
    Показать тип файловой системы: “NTFS”, “FAT” и т.п.
    Комбинация клавиш в меню: #Ctrl+4#.

    #Показывать размер#
    Показать размер диска и количество свободного места на нём.
    Комбинация клавиш в меню: #Ctrl+5#.

    #Показывать размер в виде десятичной дроби#
    Показать размер диска и количество свободного места в виде
десятичной дроби с не более чем тремя цифрами до запятой. Если эта опция
включена, 1 GiB (2 в степени 30) будет показано как #1.00 Г#, иначе как
#1024 М#.
    Комбинация клавиш в меню: #Ctrl+5# (повторное нажатие).

    #Показывать сетевое имя / путь SUBST / имя VHD#
    Показать сетевое имя / путь, ассоциированный с SUBST-диском / имя
файла, содержащего виртуальный диск.
    Комбинация клавиш в меню: #Ctrl+2#.

    #Показывать плагины#
    Показать плагины.
    Комбинация клавиш в меню: #Ctrl+7#.

    #Сортировать плагины по горячей клавише#
    Если эта опция #выключена#, список плагинов сортируется по имени;
иначе по горячей клавише.

    #Показывать параметры сменных дисков#
    Показать параметры сменных дисков.
    Комбинация клавиш в меню: #Ctrl+6#.

    #Показывать параметры компакт-дисков#
    Если опция включена, то Far будет пытаться определить тип
CD-привода: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW, DVD-RAM,
HD DVD-ROM, HD DVD-RW, Blue-ray Disk-ROM, Blue-ray Disk-RW.
    Комбинация клавиш в меню: #Ctrl+8#.

    #Показывать параметры сетевых дисков#
    Показать размеры сетевых дисков и количество свободного места на них.
Формат отображения зависит от опции #Показывать размер#.
    Комбинация клавиш в меню: #Ctrl+9#.

@DisconnectDrive
$ #Отсоединение сетевого диска#
    Отсоединить сетевой диск можно из ~Меню выбора диска~@DriveDlg@
клавишей #Del#.

    Опция #[x] Восстанавливать при входе в систему# доступна для изменений
только для сетевых дисков, подключённых постоянно.

    Выдачу подтверждения можно отключить в диалоге ~"Подтверждения"~@ConfirmDlg@


@Highlight
$ #Раскраска файлов и группы сортировки#
    Для более удобного и наглядного представления файлов и папок на панелях в
Far Manager предусмотрена возможность цветовыделения файловых объектов.
Файловые объекты можно объединять по разным критериям (~маски файлов~@FileMasks@,
файловые атрибуты) в группы и назначать собственные цвета.

    Раскраску файлов можно включить или отключить в диалоге
~настройки панелей~@PanelSettings@ (пункт "Параметры|Раскраска файлов").

    ~Изменить~@HighlightEdit@ параметры любой группы раскраски можно из меню
"~Параметры~@OptMenu@" (пункт "Раскраска файлов и группы сортировки").


@HighlightList
$ #Раскраска файлов и группы сортировки: клавиши управления#
    Меню ~раскраски файлов и группы сортировки~@Highlight@ позволяет
манипулировать списком. Доступны следующие сочетания клавиш:

  #Ins#          - Добавить новую группу раскраски

  #F5#           - Дублировать текущую группу

  #Del#          - Удалить текущую группу

  #Enter# или #F4# - ~Изменить параметры~@HighlightEdit@ текущей группы раскраски

  #Ctrl+R#       - Восстановить предопределённые группы раскраски
                 файлов.

  #Ctrl+Up#      - Передвинуть группу вверх.

  #Ctrl+Down#    - Передвинуть группу вниз.

    Группы раскраски анализируются от начала к концу. Если обнаружено, что файл
принадлежит к какой-либо группе, то принадлежность к остальным группам не
проверяется.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@HighlightEdit
$ #Раскраска файлов и группы сортировки: редактирование#
    Диалог #Редактирование раскраски файлов# позволяет изменить ~параметры~@Filter@
группы раскраски файлов. Каждое определение группы включает:

     - одну или несколько ~масок файлов~@FileMasks@;

     - атрибуты включения и исключения:
       #[x]# - атрибут включения - файл должен иметь
             указанный атрибут.
       #[ ]# - атрибут исключения - файл не должен иметь
             указанный атрибут.
       #[?]# - указанный атрибут не влияет на фильтр;

     - цвета обычного имени, помеченного имени, имени под курсором
       и помеченного имени под курсором. Если вы хотите использовать
       цвет по умолчанию, установите цвет в "Чёрный на чёрном";

     - опционально может быть указан любой символ для обозначения
       принадлежащих к группе файлов. Он может быть использован
       как вместе с цветовым выделением, так и вместо него.

    Если вы выключите опцию "#Совпадение с маской (масками)#", то маски файлов
будут исключены из анализа, а сравнение будет проводиться только по атрибутам.

    Файл принадлежит к группе раскраски, если:

     - включён анализ масок и его имя соответствует хотя бы
       одной маске (если анализ масок отключён, то имя файла не
       имеет значения);

     - он имеет все атрибуты включения;

     - он не имеет атрибутов исключения.

    Атрибуты "Сжатый", "Зашифрованный", "Неиндексируемый", "Разрежённый",
"Временный", "Точка повторной обработки", "Автономный" и "Виртуальный" используются
только на дисках с файловой системой NTFS. Атрибут "Виртуальный" не используется
в Windows 2000/XP/2003. Атрибуты #Поток целостности# и #Нет данных очистки#
поддерживаются только на ReFS томах, начиная с Windows Server 2012.


@ViewerSettings
$ #Настройка программы просмотра#
    В этом диалоге можно изменить параметры внешней и встроенной
~программы просмотра~@Viewer@.

@=
^#Программа просмотра#
@=
  #Запускать внешнюю#       Запускать внешнюю программу просмотра по
  #программу просмотра#     клавише #F3#, а встроенную программу просмотра
  #по F3 вместо Alt+F3#     по комбинации клавиш #Alt+F3#.

  #Команда просмотра#       Команда для запуска внешней программы
                          просмотра. Для указания имени
                          просматриваемого файла используйте
                          ~специальные символы~@MetaSymbols@.

@=
^#Встроенная программа просмотра#
@=
  #Постоянное выделение#    Не удалять пометку блока при перемещении
                          курсора.

  #Авто-фокус#              В диалоге поиска автоматически делать активным
  #в диалоге поиска#        поле ввода искомого текста.

  #Размер табуляции#        Количество пробелов на одну позицию табуляции.

  #Показывать стрелки#      Показывать стрелки сдвига по краям окна программы
  #сдвига#                  просмотра, если текст не помещается по горизонтали.

  #Показывать '\0'#         Для символа '\0' показывать печатный символ
                          вместо пробела. Символ, который показывать, можно задать
                          в ~far:config~@FarConfig@ #Viewer.ZeroChar#.

  #Показывать полосу#       Показывать полосу прокрутки во внутренней
  #прокрутки#               программе просмотра. Эту опцию можно также
                          переключать нажатием #Ctrl+S# в окне
                          просмотра.
@=
  #Сохранять позицию#       Сохранять и восстанавливать позицию
  #файла#                   в недавно просмотренных файлах.
                          Эта опция также сохраненяет и восстанавливает
                          кодовую страницу (если она была выбрана вручную)
                          и ~режим просмотра~@ViewerMode@.

  #Сохранять кодовую#       Сохранять и восстанавливать выбранную кодировку файла.
  #страницу файла#          При включённой опции #Сохранять позицию файла# кодировка
                          также сохраняется, так как позиция в файле зависит от кодировки.

  #Сохранять закладки#      Сохранять и восстанавливать закладки в недавно просмотренных
                          файлах. (Закладки можно создать при помощи комбинаций
                          клавиш #ПравыйCtrl+0..9# или #Ctrl+Shift+0..9#.)

  #Максимальная ширина#     Максимальное число колонок для текстового режима просмотра.
  #строки#                  Минимум=100, Максимум=100 000, Умолчание=10 000.

  #Сохранять режим#         Сохранять и восстанавливать ~режимы просмотра~@ViewerMode@
  #просмотра#               для недавно просмотренных файлов.

  #Сохранять режим#         Сохранять и восстанавливать ~режимы~@ViewerMode@ #переноса#
  #переноса#                и #переноса по словам# для недавно просмотренных файлов.

  #Автовыбор дамп-#         Если опция включенаи и Far считает файл бинарным,
  #режима просмотра#        то при первом просмотре файла автоматически выбирается
                          ~режим~@ViewerMode@ #дамп#. Иначе выбирается режим #текст#.

  #Автоопределение#         ~Автоматическое определение~@CodePageAuto@ кодовой страницы
  #кодовой страницы#        просматриваемого файла.

  #Кодовая страница#        Позволяет выбрать кодовую страницу по умолчанию.
  #по умолчанию#
@=

    Если внешняя программа просмотра назначена на клавишу #F3#, она будет
запускаться только в том случае, если ~ассоциированная~@FileAssoc@ программа
просмотра для данного типа файлов отсутствует.

    Изменённые настроек не влияют на уже открытые окна встроенной программы
просмотра.

    Диалог настройки также можно вызвать из ~программы просмотра~@Viewer@,
нажав #Alt+Shift+F9#. Изменения вступят в силу немедленно, но действовать будут
только на текущий сеанс работы.


@EditorSettings
$ #Настройка редактора#
    В этом диалоге можно изменить используемые по умолчанию параметры
внешнего и ~встроенного редакторов~@Editor@.

    Внешний редактор

  #Запускать внешний#       Запускать внешний редактор по #F4# вместо
  #редактор по F4#          #Alt+F4#.

  #Команда#                 Команда для запуска внешнего редактора.
  #редактирования#          Для указания имени просматриваемого файла
                          используйте ~специальные символы~@MetaSymbols@.

    Встроенный редактор

  #Не преобразовывать#      При редактировании документа символ #Tab#
  #табуляцию#               не преобразовывать в пробелы.

  #Преобразовывать новые#   При редактировании документа нововведённый
  #символы табуляции в#     символ #Tab# заменять на соответствующее
  #пробелы#                 количество пробелов. Остальные символы
                          #Tab# не преобразовывать.

  #Преобразовывать все#     При открытии документа в редакторе все
  #символы табуляции в#     символы #Tab# заменить на соответствующее
  #пробелы#                 количество пробелов.

  #Постоянные блоки#        Не удалять пометку блока при перемещении
                          курсора.

  #Del удаляет блоки#       Если есть помеченный блок, #Del# будет
                          удалять этот блок, а не символ под
                          курсором.

  #Сохранять позицию#       Сохранять и восстанавливать позицию
  #файла#                   в недавно отредактированных файлах.
                          Эта опция также вызывает сохранение
                          кодовой страницы, использованной
                          при редактировании файла, если эта страница
                          была выбрана пользователем вручную.

  #Сохранять закладки#      Сохранять и восстанавливать закладки на
                          текущие позиции в недавно просмотренных
                          файлах, сохранённых с использованием
                          #ПравыйCtrl+0..9# или #Ctrl+Shift+0..9#.

  #Автоотступ#              Включает режим автоотступа при вводе
                          текста.

  #Курсор за пределами#     Разрешить перемещение курсора за пределы
  #строки#                  строки.

  #Размер табуляции#        Количество пробелов при показе символа
                          табуляции.

  #Показывать полосу#       Показывать полосу прокрутки
  #прокрутки#

  #Пробельные символы#      Показать пробельные символы (пробелы, 
                          табуляции, переводы строк и возвраты 
                          кареток).

  #Выделять найденное#      Найденные последовательности будут выделены.

  #Курсор в конце#          Установить курсор в конец фрагмента,
                          найденного в результате поиска. 

  #Автоопределение#         ~Автоматическое~@CodePageAuto@ определение кодовой страницы
  #кодовой страницы#        редактируемого файла.

  #Редактировать открытые#  Позволяет открывать в редакторе файлы,
  #для записи файлы#        которые открыты для записи другими
                          программами. Этот режим удобен, когда нужно
                          получить доступ к открытому в течение
                          долгого времени файлу, но он может быть
                          опасным, если этот файл модифицируется
                          одновременно с редактированием.

  #Блокировать#             При открытии на редактирование файла,
  #редактирование#          имеющего атрибут "только для чтения",
  #файла с атрибутом R/O#   редактор также переходит в режим запрета
                          модификации содержимого файла, как если
                          бы нажали #Ctrl+L#.

  #Предупреждать при#       Перед открытием на редактирование файла,
  #открытии файла с#        имеющего атрибут "только для чтения",
  #атрибутом R/O#           будет выдаваться предупреждающее сообщение.

  #Кодовая страница#        Выбираем кодовую страницу
  #по умолчанию#            по умолчанию.

    Если внешний редактор назначен на клавишу #F4#, он будет запускаться только
в том случае, если ~ассоциированный~@FileAssoc@ редактор для данного типа
файлов отсутствует.

    Изменённые настройки не влияют на ранее открытые окна редактора.

    Диалог настройки также можно вызвать из ~редактора~@Editor@, нажав
#Alt+Shift+F9#. Изменения вступят в силу немедленно, но действовать будут
только на текущий сеанс работы.


@CodePageAuto
$ #Автоопределение кодовой страницы#
    Far постарается выбрать правильную кодовую страницу для просмотра/редактирования
файла. Заметьте, что корректное определение не гарантируется, особенно для
маленьких или нетипичных текстовых файлов.

    См. также меню ~кодовых страниц~@CodePagesMenu@ и ~far:config Codepages.NoAutoDetectCP~@Codepages.NoAutoDetectCP@

@FileAttrDlg
$ #Файловые атрибуты#
    Эта команда позволяет изменить атрибуты и время как у отдельных файлов, так
и у групп файлов и папок. Если вам не нужно обрабатывать файлы во вложенных
папках, отмените параметр "Обрабатывать вложенные папки".

 #Файловые атрибуты#

    Для выделенных объектов (файлов и папок) контрольные переключатели имеют 3
состояния:

     #[x]# - атрибут установлен для всех объектов
           (установить у всех)

     #[ ]# - атрибут сброшен для всех объектов
           (сбросить у всех)

     #[?]# - атрибут не у всех объектов
           (не изменять этот атрибут)

    Если выделенные объекты имеют одинаковые атрибуты, то контрольные
переключатели будут 2-х позиционными - установить/сбросить. Исключение
составляет случай, когда среди выделенных объектов встречаются папки - в этом
случае все контрольные переключатели будут 3-х позиционными.

    Если состояние контрольных переключателей на момент исполнения команды
установки атрибутов не изменилось (по сравнению с начальным состоянием), то
указанный атрибут меняться не будет.

    Если среди выделенных объектов нет папок, то опция "Обрабатывать вложенные
папки" будет недоступна.

    Атрибуты #Сжатый#, #Зашифрованный#, #Неиндексируемый#, #Разрежённый#,
#Временный#, #Автономный#, #Точка повторной обработки# и #Виртуальный# доступны только на дисках с
файловой системой NTFS. Атрибут #Виртуальный# не используется в Windows
2000/XP/2003. Атрибуты #Сжатый# и #Зашифрованный# являются взаимоисключающими,
т.е. можно выставить только один из них. В Windows 2000/XP/2003 выставленный
атрибут #Разрежённый# сбросить нельзя. Атрибуты #Поток целостности# и #Нет данных очистки#
поддерживаются только на ReFS томах, начиная с Windows Server 2012.


    Для ~символических ссылок~@HardSymLink@ в диалоге отображается путь, на
который она ссылается. Если эта информация недоступна, то выводится
сообщение "#(нет данных)#".

 #Дата и время#

    Поддерживаются четыре различных времени файла:

    - время последней записи;

    - время создания файла;

    - время последнего доступа;

    - время изменения.

    Для дисков с файловой системой FAT часы, минуты и секунды времени
последнего доступа всегда равны нулю.

    Если вы не хотите изменять время файла, оставьте соответствующее поле
пустым. Вы можете нажать кнопку #Blank# (Сброс), чтобы очистить все поля с
датами и временем, после чего поменять отдельную составляющую даты и времени,
например только месяц или только минуты. Остальные значения полей остаются
неизменными.

    Кнопка #Current# (Текущее) позволяет заполнить поля времени файла текущим
временем.

    Кнопка #Original# (Исходное) заполняет поля времени файла оригинальными
значениями. Доступна для одиночного файлового объекта.


@FolderShortcuts
$ #Ссылки на папки#
    Ссылки на папки позволяют обеспечить быстрый доступ к часто используемым
папкам. Для создания ссылки на текущую папку нужно нажать #Ctrl+Shift+0..9#.
После этого, чтобы перейти в папку, записанную в ссылке, достаточно нажать
#ПравыйCtrl+0..9#. Если #ПравыйCtrl+0..9# нажат в строке редактирования, то
путь ссылки будет вставлен в эту строку.

    Пункт #Ссылки на папки# в ~Меню команд~@CmdMenu@ позволяет просматривать,
устанавливать, редактировать и удалять ссылки на папки.

    В режиме редактирования (#F4#) вы не можете сделать ссылку на плагиновую
панель.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@FiltersMenu
$ #Меню фильтров#
    С помощью #Меню фильтров# вы можете определить набор типов файлов, с
заданным вами параметрами, при соблюдении которых файл будет обработан
использующей его операцией.

    Меню состоит из двух частей. В верхней части расположены #Фильтры#
#пользователя#, в нижней части меню находятся маски всех файлов, содержащихся в
данный момент в текущей панели файлов (а также маски файлов выбранные в
текущей области меню даже если файлов подходящим к этим маскам нет в текущей
панели).

    Для #Фильтра пользователя# доступны следующие клавиши:

   #Ins#        Создать новый фильтр, откроется пустой диалог для
              задания параметров ~фильтра~@Filter@.

   #F4#         Изменить существующий ~фильтр~@Filter@.

   #F5#         Копировать ~фильтр~@Filter@.

   #Del#        Удалить фильтр.

   #Ctrl+Up#    Переместить фильтр на одну позицию вверх.

   #Ctrl+Down#  Переместить фильтр на одну позицию вниз.


    Управление, как #Фильтрами пользователя#, так и автоматически
сгенерированными фильтрами (маски файлов), осуществляется следующими клавишами:

   #Space#,              Элементы, выбранные с помощью #Space# или '#+#',
   #Plus#                помечаются символом '+'. Если такие элементы
                       присутствуют, то будут обработаны только
                       удовлетворяющие им файлы.

   #Minus#               Элементы, выбранные с помощью клавиши '#-#',
                       помечаются символом '-', и все удовлетворяющие
                       им файлы не будут обработаны.

   #I# и #X#               Подобны #Plus# и #Minus#, но имеют более
                       высокий приоритет при фильтрации.

   #Backspace#           Снять пометку с выбранного объекта.

   #Shift+Backspace#     Снять пометку со всех выбранных объектов.


    Пометка фильтров сохраняется в конфигурации.

    Когда фильтр используется в панели, это индицируется символом '*' после
буквы режима сортировки в верхнем левом углу панели.

    Меню фильтров используется в следующих областях:
     - ~Панель файлов~@FilePanel@;
     - ~Копирование, перенос, переименование и создание ссылок~@CopyFiles@;
     - ~Поиск файла~@FindFile@.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.


@FolderDiz
$ #Описания папок#
    Имена или ~маски файлов~@FileMasks@, отображаемых в ~панели информации~@InfoPanel@ 
в качестве описания папки.

@FileDiz
$ #Описания файлов#
    Описания могут быть использованы для того, чтобы связать с файлом текстовую
информацию. Описания файлов текущей папки хранятся в этой папке в специальном
файле - списке описаний. В нём в начале каждой строки содержится имя
описываемого файла, и отделённый от него пробелами текст описания.

    Описания можно посмотреть в соответствующих ~режимах просмотра~@PanelViewModes@
панели файлов. По умолчанию этими режимами являются #Описания# и #Длинные#
#описания#.

    Команда #Описание файлов# (#Ctrl+Z#) из ~Меню файлов~@FilesMenu@
предназначена для добавления описаний к выбранным файлам.

    Имена списков описаний могут быть изменены в диалоге #Описания файлов# из
меню ~Меню параметров~@OptMenu@. В этом диалоге также можно установить режим
обновления локальных описаний. Обновление может быть запрещено совсем,
разрешено, только если текущий режим просмотра файловой панели показывает
описания, или разрешено всегда. По умолчанию Far устанавливает атрибут "Hidden"
на созданные списки описаний, но вы можете это запретить, выключив опцию
"Устанавливать атрибут "Hidden" на новые списки описаний" в этом же диалоге.
Также здесь вы можете указать позицию для выравнивания новых описаний в списке
описаний.

    Если файл с описаниями имеет атрибут "Только для чтения", то Far не
обновляет описания и, после операций переименования/удаления файловых объектов,
будет выведено сообщение об ошибке. При включённой опции #Обновлять файл#
#описаний с атрибутом "Только для чтения"# Far попытается корректно обновить
описания.

    Если это разрешено в конфигурации, Far обновляет описания файлов при
копировании, переносе и удалении файлов. Но если команда обрабатывает и часть
файлов во вложенных папках, то для этих файлов описания не обновляются.

    #Использовать кодовую страницу ANSI по умолчанию#

    #Сохранять в UTF8#


@PanelViewModes
$ #Настройка режимов просмотра панели файлов#
    ~Панель файлов~@FilePanel@ может выводить информацию, используя 10 заданных
заранее режимов: краткий, средний, полный, широкий, детальный, описания,
длинные описания, владельцы файлов, ссылки файлов, альтернативный полный. Обычно
этого достаточно, но, тем не менее, при желании можно изменить параметры этих
режимов или даже полностью заменить их на новые.

    Команда #Режимы панели файлов# из меню ~Меню параметров~@OptMenu@ позволяет
изменить параметры режимов просмотра. Сначала она предлагает выбрать требуемый
режим из списка. В этом списке режим 0 соответствует режиму просмотра,
вызываемому по #ЛевыйCtrl+0# (альтернативный полный), режим 1 соответствует
краткому режиму (#ЛевыйCtrl+1#), режим 2 соответствует среднему режиму
(#ЛевыйCtrl+2#) и так далее. После выбора режима появляется диалог, в котором
можно изменить следующие параметры:

  - #Типы колонок# - список, разделённый запятыми. Тип колонки начинается
со свойства файла (например, имя или размер), обозначенного одной
буквой. За некоторыми свойствами могут следовать модификаторы.
Допустимые типы колонок (свойства и их модификаторы) перечислены ниже.

    Если список типов колонок состоит из нескольких повторяющихся групп,
файлы на панели будут организованы в «полосы». Свойства каждого файла
будут показаны в колонках одной полосы, а список файлов будет
продолжаться с полосы на полосу, как текст в газетной статье. Если
список типов колонок невозможно разбить на одинаковые группы, список
файлов будет показан в одной полосе.

    Допускаются следующие типы колонок:

    N[M[D],O,R[F],N] - имя файла
                 где: M - ^<wrap>показывать символы пометки где: D
- динамические символы пометки;
                      O - ^<wrap>показывать имена без путей
(предназначено в основном для ~плагинов~@Plugins@);
                      R - ^<wrap>выравнивать не умещающиеся имена
по правому краю где: F - выравнивать все имена по правому краю;
                      N - ^<wrap>не отображать расширения файлов;
                 ^<wrap>Эти символы можно комбинировать, например NMR

    X[R]       - расширение файла
                 где: R - ^<wrap>выравнивать по правому краю;

    S[C,T,F,E] - размер файла
    P[C,T,F,E] - выделенный размер файла
    G[C,T,F,E] - размер потоков файла
                 где: C - ^<wrap>группировать цифры, используя символ
из настроек Windows;
                      T - ^<wrap>использовать десятичные единицы вместо
двоичных, т.е., чтобы вычислить килобайты, размер будет делиться
на 1000, а не на 1024; в этом режиме символ единиц показывается
строчными буквами, например, #к#, #м#, #г# вместо #К#, #М#, #Г#;
                      F - ^<wrap>показывать размер в виде десятичной
дроби с не более чем тремя цифрами до запятой, например, 999 байт будут
показаны как #999#, а 1024 байт как #1.00 К#; заметьте, что поведение
зависит от наличия модификатора #T#;
                      E - ^<wrap>экономичный режим, не показывать пробел
между размером и символом единиц, например, #1.00к#;

    D          - дата последней записи в файл
    T          - время последней записи в файл

    DM[B,M]    - дата и время последней записи в файл
    DC[B,M]    - дата и время создания файла
    DA[B,M]    - дата и время последнего доступа к файлу
    DE[B,M]    - дата и время изменения файла
                 где: B - краткий (Unix-стиль) формат времени файла;
                      M - использование текстовых имён месяцев;

    A          - атрибуты файла
    Z          - описание файла

    O[L]       - владелец файла
                 где: L - отображать также имя домена;

    LN         - количество жёстких ссылок

    F          - количество потоков

    Если описание типов колонок содержит более одной колонки имени
файла, панель файлов будет отображаться в многоколоночной форме.

    Атрибуты файла имеют следующие обозначения:

       #R#         - Только для чтения
       #A#         - Архивный
       #H#         - Скрытый
       #S#         - Системный
       #C#         - Сжатый
       #E#         - Зашифрованный
       #I#         - Неиндексируемый
       #D#         - Каталог
       #$#         - Разрежённый
       #T#         - Временный
       #O#         - Автономный
       #L#         - Точка повторной обработки
       #V#         - Виртуальный
       #G#         - Поток целостности
       #N#         - Нет данных очистки

    По умолчанию размер колонки атрибутов - 6 символов. Для отображения
дополнительных атрибутов необходимо увеличить размер колонки.

  - #Ширина колонок# - позволяет изменить ширину колонок панели.
Если ширина равна 0, то используется значение по умолчанию.
Если ширина колонки с именем, описанием или владельцем равна 0,
она будет подсчитана автоматически, в зависимости от ширины панели.
Для правильной работы с различной шириной экрана настоятельно
рекомендуется, чтобы в каждом режиме просмотра была хотя бы одна
колонка с автоматически вычисляемой шириной.
Ширину колонки также можно задать в процентах от свободного места
оставшегося после колонок с фиксированной шириной, для этого после
числового значения необходимо дописать знак %. Если суммарный размер
таких колонок больше 100%, то их размеры соответственно масштабируются.

    Для использования 12-часового формата времени надо увеличить
на единицу стандартную ширину колонки времени файла или колонки
времени и даты файла. После дальнейшего увеличения в этих колонках
также будут показаны секунды и миллисекунды.

    Для показа года в 4-х символьном формате нужно увеличить ширину
колонки даты на 2.

    При указании колонок, отвечающих за показ ссылок, потоков и владельцев (G, LN, F и O) время
отображения содержимого каталога увеличивается.

  - #Типы колонок строки статуса# и #Ширина колонок строки статуса# -
аналогично "Типам колонок" и "Ширине колонок", но для строки статуса
панели.

  - #Полноэкранный режим# - показывать панель во весь экран вместо
половины экрана.

  - #Выравнивать расширения файлов# - показывать расширения файлов
выровненными.

  - #Выравнивать расширения папок# - показывать расширения папок
выровненными.

  - #Показывать папки заглавными буквами# - показывать все имена папок
в верхнем регистре, вне зависимости от реального регистра.

  - #Показывать файлы строчными буквами# - показывать все имена файлов
в нижнем регистре, вне зависимости от реального регистра.

  - #Показывать имена файлов из заглавных букв строчными буквами# -
показывать все имена файлов, которые содержат только заглавные буквы,
строчными буквами. По умолчанию эта опция включена, но если вы хотите
всегда видеть настоящий регистр имени файла, выключите её, а также
#Показывать папки заглавными буквами# и #Показывать файлы строчными буквами#.
Все эти параметры влияют только на способ показа файлов, для их обработки
Far всегда использует настоящий регистр.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@SortGroups
$ #Группы сортировки#
    Группы сортировки могут применяться в ~панели файлов~@FilePanel@ совместно
с сортировкой #по имени# или #по расширению#. Они активизируются при нажатии
#Shift+F11# и позволяют задать правила сортировки файлов, дополняющие уже
действующие.

    Каждая группа сортировки состоит из одной или нескольких разделённых
запятыми ~масок файлов~@FileMasks@. Если позиция одной группы сортировки в
общем списке групп выше, чем у другой группы, то при сортировке по возрастанию
все принадлежащие к этой группе файлы будут выше, чем принадлежащие к другой
группе.

    Команда #Группы сортировки# из ~Меню команд~@CmdMenu@ позволяет удалять,
создавать и редактировать группы сортировки, используя клавиши #Del#, #Ins# и
#F4#. Группы, находящиеся выше разделителя меню, относятся к началу файловой
панели, и все файлы, попавшие в эти группы, будут расположены выше не попавших
в них файлов. Группы, находящиеся ниже разделителя меню, относятся к концу
файловой панели, и все файлы, попавшие в эти группы, будут расположены ниже не
попавших в них файлов.


@FileMasks
$ #Маски файлов#
    Маски файлов часто используются в командах Far для выбора отдельных файлов
и папок или их групп. Маски могут включать обычные допустимые в именах файлов
символы, '*' и '?', а также специальные выражения:

    #*#           любое количество символов (в т.ч. ни одного);

    #?#           любой символ;

    #[cx-z]#     любой символ из находящихся в квадратных скобках.
                Допускаются и отдельные символы, и их диапазоны.

    Например, файлы ftp.exe, fc.exe и f.ext могут быть выбраны с помощью маски
f*.ex?, маска *co* выберет и color.ini, и edit.com, маска [c-ft]*.txt может
выбрать config.txt, demo.txt, faq.txt и tips.txt.

    Во многих командах Far можно задать несколько разделённых запятыми или
точкой с запятой масок. Например, чтобы выбрать все документы, вы можете ввести
*.doc,*.txt,*.wri в команде "Пометить группу".

    Допускается заключать любую из масок (но не весь список) в двойные кавычки.
Например, это нужно делать, когда маска содержит один из символов-разделителей
(запятую или точку с запятой), чтобы такая маска не была спутана со списком.

    В масках можно использовать ~регулярные выражения~@RegExp@, при этом текст
регулярного выражения должен быть окружён символами #/#.

    Пример:
    #/(eng|rus)/i#  файлы, имена которых содержат строки “eng” или “rus”,
                  регистр символов не учитывается.

    #Маска исключения# - одна или несколько масок файлов, которой не должны
соответствовать имена требуемых файлов, она отделяется от основной маски символом '#|#'.

^Примеры использования масок исключения:
 1. *.cpp
    Все файлы с расширением cpp.
 2. *.*|*.bak,*.tmp
    Все файлы, кроме файлов с расширением bak и tmp.
 3. *.*|
    Введён разделитель |, но сама маска исключения не указана,
    выражение трактуется как *.*
 4. *.*|*.bak|*.tmp
    Разделитель | может быть использован только один раз,
    выражение трактуется как *.*|*.bak
 5. |*.bak
    Обрабатывается как *|*.bak
 6. *.*|/^pict\d{1,3}\.gif$/i
    Все файлы, кроме pict0.gif — pict999.gif, независимо от регистра символов.

    Через запятую (или точку с запятой) перечисляются маски файлов, а при
помощи '|' маски-включения отделяются от масок-исключения.

    Маски файлов могут быть объединены в ~группы~@MaskGroupsSettings@.

@SelectFiles
$ #Пометка файлов#
    Элементы ~панели файлов~@FilePanel@ (файлы и папки) могут быть
помечены для групповой обработки. Если ни один элемент не помечен,
то будет обработан только элемент под курсором.

  #Пометка с клавиатуры#

    #Ins# переключает пометку на элементе под курсором и сдвигает курсор
вниз.

    #Shift+Клавиши управления курсором# перемещают курсор, помечая
элементы или снимая пометку. Действие (пометка или снятие пометки)
зависит от состояния элемента под курсором до нажатия комбинации клавиш.

    #Gray +# помечает элементы, а #Gray -# снимает пометку
с использованием одной или нескольких ~масок файлов~@FileMasks@. #†#

    #Gray *# инвертирует текущую пометку. #†#

    #Ctrl+<Gray +># помечает элементы, а #Ctrl+<Gray -># снимает пометку
с элементов с тем же #расширением#, что и у элемента под курсором. #†#

    #Alt+<Gray +># помечает элементы, а #Alt+<Gray -># снимает пометку
с элементов с тем же #именем#, что и у элемента под курсором. #†#

    #Shift+<Gray +># помечает все элементы, а #Shift+<Gray -># снимает
пометку со всех элементов. #†#

    #Ctrl+<Gray *># инвертирует текущую пометку на всех элементах,
включая папки.

    #Ctrl+M# восстанавливает предыдущую пометку.

  #Пометка мышью#

    #Щелчок правой кнопкой мыши# переключает пометку на элементе,
по которому щёлкнули, и перемещает на него курсор. См. также параметр
#Правый клик помечает файлы# в диалоге ~Настроек панели~@PanelSettings@.

    #Щелчок и удерживание правой кнопкой мыши# на #строке статуса# или
#заголовках колонок# перемещает курсор соответственно вперёд или назад,
помечая элементы или снимая пометку. Действие (пометка или снятие
пометки) зависит от состояния элемента под курсором до нажатия кнопки
мыши.

 ────────────────
 #†# Если параметр #Пометка папок# в диалоге
~Настроек панели~@PanelSettings@ выключен, пометка ставится или
снимается только на файлах. Иначе, пометка меняется также и на папках.

@CopyFiles
$ #Копирование, перенос, переименование и создание связей и ссылок#
    Следующие команды могут быть использованы для копирования, переноса и
переименования файлов и папок:

  Копировать ~выбранные~@SelectFiles@ файлы                                    #F5#

  Копировать файл под курсором вне зависимости            #Shift+F5#
  от пометки

  Переименовать или перенести выбранные файлы                   #F6#

  Переименовать или перенести файл под курсором           #Shift+F6#
  вне зависимости от пометки

  Создание ~ссылок~@HardSymLink@ файлов и папок                            #Alt+F6#

    Для папки: если папка по указанному целевому пути (относительному
или абсолютному) существует, то исходная папка будет скопирована
/ перемещена в целевую папку; иначе новая папка будет создана
по целевому пути, и содержимое исходной папки будет скопировано
/ перемещено во вновь созданную папку.

    Например, при перемещении #c:\folder1\# в #d:\folder2\#:

    - ^<wrap>если #d:\folder2\# существует, то содержимое #c:\folder1\# будет перемещено
в #d:\folder2\folder1\#;

    - ^<wrap>в противном случае содержимое #c:\folder1\# будет перемещено во
вновь созданную папку #d:\folder2\#.

    Если включена опция «#Обрабатывать несколько имён файлов#», то в строке
ввода можно указать несколько путей для копирования или перемещения. Пути
должны быть разделены символом-разделителем «#;#» или «#,#». Если путь
содержит эти символы, заключите его в двойные кавычки.

    Если вы хотите создать папку назначения перед копированием,
добавьте к её имени обратную черту.

    Если ~far:config~@FarConfig@ параметр
~Panel.Tree.TurnOffCompletely~@Panel.Tree.TurnOffCompletely@ установлен
в значение «false», то для того чтобы выбрать целевой путь, вы можете
использовать диалог ~поиска папки~@FindFolder@. Следующие горячие
клавиши открывают диалог с разными выбранными папками:

    - ^<wrap>#F10# выбирает папку из активной панели.

    - ^<wrap>#Alt+F10# выбирает папку из пассивной панели.

    - ^<wrap>#Shift+F10# выбирает заданную целевую папку. Если в строке
ввода указано несколько папок, используется первая из них.

    Если включена опция «#Обрабатывать несколько имён файлов#», то
выбранная папка добавляется к содержимому строки ввода.

    Работает ли копирование, перенос или переименование файлов для плагина
зависит от функциональности конкретного плагина.

    Если диск, на который производится копирование или перенос файлов,
переполнился в процессе операции, то можно либо отменить операцию, либо
заменить диск и выбрать пункт «Разделить». В последнем случае,
копируемый файл будет разделён между дисками. Эта функция доступна
только при выключенном параметре «#Использовать системную функцию копирования#»
из диалога ~Системные параметры~@SystemSettings@.

    Параметр #Права доступа# используется только для файловой системы
NTFS и управляет тем, как устанавливаются права доступа к создаваемым
файлам и папкам. Опция #По умолчанию# оставляет обработку прав доступа
файловой системе. Опция #Копировать# применяет права доступа исходных
объектов. Опция #Наследовать# применяет наследуемые права родительской
папки.

    Параметр «#Уже существующие файлы#» определяет поведение Far для случая,
когда одноимённый файл уже существует в папке-приёмнике.
    Возможные значения:
    ^<wrap>#Запрос действия# - будет отображён ~диалог~@CopyAskOverwrite@
с запросом;
    ^<wrap>#Вместо# - все существующие файлы будут заменены копируемыми;
    ^<wrap>#Пропустить# - существующие файлы останутся без изменений;
    ^<wrap>#Имя# - существующие файлы останутся без изменений,
копируемым будут присвоены другие имена;
    ^<wrap>#Дописать# - копируемые файлы будут дописаны в конец существующих;
    ^<wrap>#Только новые/обновлённые файлы# - копировать только файлы с более
новыми датой и временем записи;
    ^<wrap>#Запрос подтверждения для R/O файлов# - определяет, нужно ли
дополнительное подтверждение для файлов с установленным атрибутом "только
для чтения".

    Параметр «#Использовать системную функцию копирования#» из диалога
~Системные параметры~@SystemSettings@ включает использование функции
CopyFileEx (или CopyFile, если CopyFileEx недоступна) операционной
системы Windows. Это может быть полезно на NTFS, так как CopyFileEx
оптимизирует распределение дискового пространства и копирует расширенные
атрибуты файлов. Если этот параметр выключен, используется внутренняя
реализация функции копирования файлов. Внутренняя функция используется
также, когда исходный файл зашифрован и производится копирование
на другой том.

    Параметр «#Копировать содержимое символических ссылок#» управляет
~логикой~@CopyRule@ работы с ~символическими ссылками~@HardSymLink@.

    При переносе файлов для определения того, должна ли операция осуществляться
как копирование с последующим удалением или как прямой перенос (в пределах
одного физического диска), Far учитывает ~символические ссылки~@HardSymLink@.

    Far обрабатывает попытку копирования в #con# так же, как и копирование в
#nul# или в #\\\\.\\nul# - то есть, файл читается с диска, но никуда не
записывается.

    При перемещении в #nul#, #\\\\.\\nul# или #con# файлы не удаляются
с диска.

    Состояние параметров «#Права доступа#» и «#Только новые/обновлённые файлы#»
действуют только на текущий сеанс копирования.

    Для копирования файлов, соответствующих определённым критериям, включите
переключатель #Использовать фильтр# и нажмите кнопку #Фильтр#, чтобы
открыть параметры ~фильтра~@FiltersMenu@. Учтите, что если вы копируете
каталог, в котором ни один из файлов не соответствует критериям фильтра,
то пустая папка в месте назначения создана #не# будет.

@CopyAskOverwrite
$ #Копирование: запрос действия#
    Если одноимённый файл уже существует в папке-приёмнике, Far предложит на выбор
несколько возможных действий:

    #Вместо# - существующий файл будет заменён копируемым;

    #Пропустить# - существующий файл останется без изменений;

    #Имя# - существующие файлы останутся без изменений, копируемым будут присвоены другие имена;

    #Дописать# - копируемый файл будет дописан в конец существующего.

    Если отмечен переключатель #Запомнить выбор#, выбранное действие будет
использовано для всех существующих файлов в текущем сеансе копирования
и повторные запросы появляться не будут.

    Если для принятия решения вам недостаточно информации о размере и дате последней
записи файлов, вы также можете сравнить их содержимое при помощи встроенной программы просмотра, 
установив курсор на один из файлов в диалоге и нажав F3.


@CopyRule
$ #Копирование: правила#
  При ~копировании/перемещении~@CopyFiles@ папок и
~символических ссылок~@HardSymLink@ соблюдаются следующие правила.

  #Копирование символической ссылки#

  Если включена опция "Копировать содержимое символических ссылок"
  или источник или приёмник - сетевые диски, то в приёмнике
  создаётся папка и в неё копируется содержимое ссылки-источника
  (для вложенных ссылок рекурсивно).

  Если опция "Копировать содержимое символических ссылок" выключена,
  и источник и приёмник - локальные диски, то в приёмнике создаётся
  связь или символическая ссылка, в зависимости от типа источника.

  #Перемещение символической ссылки#

  Если включена опция "Копировать содержимое символических ссылок"
  или источник или приёмник - сетевые диски, то в приёмнике
  создаётся папка и в неё копируется содержимое ссылки-источника
  (для вложенных ссылок рекурсивно). Сама ссылка в источнике
  удаляется.

  Если опция "Копировать содержимое символических ссылок" выключена,
  и источник и приёмник - локальные диски, то ссылка-источник просто
  переносится. Рекурсивный спуск по дереву не производится.

  #Перемещение каталога, содержащего символические ссылки#

  Если источник и приёмник - локальные диски, то каталог просто
  перемещается.

  Если источник или приёмник - сетевые диски, то независимо от
  состояния опции "Копировать содержимое символических ссылок"
  в приёмнике создаётся папка и в неё копируется содержимое
  ссылки-источника (для вложенных ссылок рекурсивно).
  Сама ссылка в источнике удаляется.


@HardSymLink
$ #Жёсткие ссылки, связи папок, символические ссылки#

    На разделах NTFS можно создавать #жёсткие ссылки# (hard links) для файлов,
#связи папок# (directory junctions) для папок и #символические ссылки# (symbolic links) для файлов и
папок с помощью команды #Alt+F6#.


    #Жёсткие ссылки#

    Жёсткая ссылка (hard link) - это просто ещё одна запись в папке для данного
файла.

    Когда создаётся жёсткая ссылка, сам файл не копируется физически, а только
появляется под ещё одним именем в ещё одном месте, а его старые имя и
местонахождение остаются нетронутыми. С этого момента жёсткая ссылка
#неотличима# от первоначальной записи в папке. Единственное отличие - то, что
для жёсткой ссылки не генерируется короткое имя файла, поэтому из ДОС-программ она
не видна.

    Когда меняется размер или дата файла, все соответствующие записи в папках
обновляются автоматически. При удалении файла он не удаляется физически до тех
пор, пока все жёсткие ссылки, указывающие на него, не будут удалены. Порядок их
удаления значения не имеет. При удалении жёсткой ссылки в корзину количество
ссылок у файла сохраняется.

    Far умеет создавать жёсткие ссылки, отображать их количество для каждого
файла в отдельной колонке (по умолчанию это последняя колонка в 9-м режиме
панелей), а также сортировать файлы по количеству жёстких ссылок.

    Создавать жёсткие ссылки можно только на том же разделе, на котором расположен
исходный файл.


    #Связи папок#

    Связи позволяют обращаться к локальным папкам как к любым другим локальным папкам.
    Например, если папка D:\\JUNCTION является связью, указывающей на C:\\WINNT\\SYSTEM32
то программа, обращающаяся к D:\\JUNCTION\\DRIVERS, будет на самом деле обращаться к
C:\\WINNT\\SYSTEM32\\DRIVERS.

    Связь не может указывать на сетевую папку.

    В Windows 2000 нельзя напрямую создать связь, ссылающуюся на папку на CD-ROM,
но это ограничение можно обойти, смонтировав CD-ROM на папку NTFS-раздела.


    #Символические ссылки#

    Символические ссылки (symbolic links) на NTFS поддерживаются, начиная с Windows Vista
(NT 6.0). Они представляют собой улучшенный вариант связей каталогов - символические
ссылки могут указывать как на папки, так и на файлы, как на локальные, так и на сетевые,
при этом поддерживаются относительные пути. 

    Создавать символические ссылки по умолчанию могут только члены группы "Администраторы",
это поведение можно изменить в локальных настройках безопасности.


@ErrCopyItSelf
$ #Ошибка: копирование/перенос "в самого себя"#
    Вы не можете копировать/переносить файл или папку "в самого себя".

    Данная ошибка также возникает, если имеются две папки, одна из которых
является ~символической ссылкой~@HardSymLink@ на другую.


@WarnCopyStream
$ #Предупреждение: Исходный файл содержит более одного потока данных#
    Исходный файл содержит более одного потока данных или файловая система
назначения не поддерживает многопоточность файловых объектов.

    Потоки - это возможность файловой системы NTFS, позволяющая ассоциировать с
файлом дополнительную информацию (например, сведения о его авторе, названии,
ключевые слова и т.д., а также любые другие данные). Эта информация хранится
вместе с файлом и никак не видна при использовании программ, не поддерживающих
потоки. В частности, потоки использует Windows Explorer для хранения дополнительных
свойств файла. Файловые системы FAT/FAT32 не поддерживают потоки.

    Для того, чтобы скопировать файловый объект полностью (со всеми потоками),
включите опцию #"Использовать системную функцию копирования"# в диалоге
настройки ~системных параметров~@SystemSettings@.

    Если вы копируете многопоточный файловый объект на том, отличный от NTFS,
то и в этом случае потеряете данные - будет скопирован только основной поток.


@WarnCopyEncrypt
$ #Предупреждение: Потеря шифрования файла#
    Исходный файл зашифрован. Копирование или перемещение его за пределы
исходного диска возможно, если в месте назначения файл будет расшифрован.

    Кнопки "Игнорировать" (или "Игнорировать все") игнорируют данное
предупреждение и файл копируется в новое место нешифрованным.

    Для копирования шифрованного файла за пределы исходного диска будет использован
внутренний механизм копирования, независимо от того, включён ли параметр
"Использовать системную функцию копирования" или нет.


@ErrLoadPlugin
$ #Ошибка: плагин не загружен#
    Эта ошибка появляется в случаях, когда:

    1. Для нормальной работы плагина требуется динамическая
       библиотека, которая отсутствует в вашей системе.

    2. Плагин по какой-то причине вернул системе информацию о
       недопустимости дальнейшей загрузки.

    3. Dll-модуль плагина испорчен.


@ScrSwitch
$ #Переключение между экранами#
    Far позволяет открыть несколько копий встроенной программы просмотра и
редактора. Используйте #Ctrl+Tab#, #Ctrl+Shift+Tab# или #F12# для переключения
между панелями и экранами с этими копиями. #Ctrl+Tab# переключает на следующий
экран, #Ctrl+Shift+Tab# на предыдущий, #F12# выводит список всех доступных
экранов.

    Количество фоновых экранов редактирования и просмотра отображается в
верхнем левом углу левой панели. Вы можете запретить показ количества экранов,
используя диалог ~Настройки панели~@PanelSettings@.

    См. также: клавиатурные команды, общие ~для всех меню~@MenuCmd@.

@ApplyCmd
$ #Применить команду#
    Используя пункт #Применить команду# из ~Меню файлов~@FilesMenu@,
можно применить команду к каждому помеченному файлу. Для обозначения
имени файла должны использоваться те же ~символы~@MetaSymbols@, что
и в ~Ассоциациях файлов~@FileAssoc@.

    Например, 'type !.!' будет выводить на экран все помеченные файлы по
очереди, а команда 'rar32 m !.!.rar !.!' перенесёт все отмеченные файлы в
одноимённые RAR-архивы. Команда 'explorer /select,!.!' запустит проводник и
установит курсор на текущем файле или папке.

    См. также ~"Команды операционной системы"~@OSCommands@


@OSCommands
$ #Команды операционной системы#
    Far Manager выполняет следующие команды операционной системы сам,
без обращения к командному процессору операционной системы:

    #CLS#

    Очищает экран.

    #disk:#

    Меняет текущий диск на активной панели на указанный «disk».

    #CD [disk:]path# или #CHDIR [disk:]path#

    Меняет текущий путь на активной панели на указанный «path». Если
указана буква диска, меняется также и диск. Если активная панель
отображает файловую систему, эмулируемую ~плагином~@Plugins@, то команда
«CD» меняет текущую папку в этой файловой системе. В отличие от «CD»,
команда «CHDIR» всегда интерпретирует свой параметр как имя папки
в дисковой файловой системе вне зависимости от типа файловой панели.

    Команда #CD ~~# переходит в домашнюю папку (если в текущей папке нет
реального файла или папки с именем «~~»). Домашняя папка задаётся опцией
#использовать домашний каталог# диалога
~настроек командной строки~@CmdlineSettings@. По умолчанию, это строка
«%FARHOME%», символизирующая домашнюю папку Far Manager’а.

    #CHCP [nnn]#

    Показывает или изменяет текущую кодовую страницу. Параметр «nnn»
задаёт номер кодовой страницы, которую надо установить. «CHCP» без
параметра показывает номер текущей кодовой страницы.

    #SET variable=[string]#

    Устанавливает переменную среды «variable» в значение «string». Если
параметр «string» не указан, то переменная «variable» удаляется. При
запуске Far Manager устанавливает некоторые ~переменные среды~@FAREnv@.

    #IF [NOT] EXIST filename command#

    Выполняет команду «command», если «filename» существует, или не
существует (при использовании с «NOT»).

    #IF [NOT] DEFINED variable command#

    Выполняет команду «command», если переменная среды «variable»
определена, или не определена (при использовании с «NOT»).

    Команды «IF» могут быть вложенными. В следующем примере команда
«command» будет выполнена, если файл «file1» существует, файл «file2»
не существует, и переменная среды «variable» определена.

    #if exist file1 if not exist file2 if defined variable command#

    #PUSHD path#

    Сохраняет текущий путь для использования командой «POPD» и меняет
текущий путь на активной панели на указанный «path».

    #POPD#

    Меняет текущий путь на активной панели на сохранённый командой
«PUSHD».

    #CLRD#

    Очищает стек путей, сохранённых командой «PUSHD».

    #TITLE [string]#

    Устанавливает фиксированный заголовок окна консоли Far Manager’а
в «string». Заголовок не будет меняться ни при переключении между
панелями, ни при исполнении команд, ни при изменении опции
#информация для заголовка окна# диалога
~настроек интерфейса~@InterfSettings@. Установка «string» будет
использоваться до завершения текущего сеанса или до восстановления
обычного поведения командой «TITLE» без параметра.

    #EXIT#

    Завершает работу Far Manager’а.

    Примечания:

    1. ^<wrap>Если синтаксис команды отличается от указанных выше,
то Far Manager вызовет для исполнения команды командный процессор
операционной системы.

    2. ^<wrap>Far Manager исполняет вышеперечисленные команды
в следующих контекстах:
       - ~Командная строка~@CmdLineCmd@
       - ~Применить команду~@ApplyCmd@
       - ~Меню пользователя~@UserMenu@
       - ~Ассоциации файлов~@FileAssoc@

@FAREnv
$ #Переменные среды#
    После запуска Far Manager выставляет следующие переменные среды, доступные
дочерним процессам:

    #FARHOME#            ^<wrap>папка, содержащая основной исполняемый модуль Far.

    #FARPROFILE#         ^<wrap>папка, содержащая перемещаемые персональные данные (настройки Far и плагинов, дополнительные плагины и т. п.)

    #FARLOCALPROFILE#    ^<wrap>папка, содержащая локальные персональные данные (истории, кеш плагинов и т. п.)

    #FARLANG#            ^<wrap>название текущего языка интерфейса

    #FARUSER#            ^<wrap>имя пользователя, указанное в параметре /u ~командной строки~@CmdLine@

    #FARDIRSTACK#        ^<wrap>содержимое вершины стека каталогов (который управляется командами pushd и popd)

    #FARADMINMODE#       ^<wrap>равна "1", если Far Manager запущен от имени администратора

@RegExp
$ #Регулярные выражения для поиска#
    Синтаксис регулярных выражений почти полностью совпадает с перловыми регэкспами.

    Общий вид: #regexp# или /#regexp#/#options#.

    Опции (#options#):
    #i# - игнорировать регистр
    #s# - ^<wrap>рассматривать текст как одну строку, '.' совпадает с абсолютно любым знаком
    #m# - ^<wrap>рассматривать текст как много строк. ^ и $ совпадают с началом и концом
любой "внутренней" строки
    #x# - ^<wrap>просто пробельные знаки (без обратного слеша впереди) игнорируются -
полезно в сложных выражениях для структуризации

    #regexp# - последовательность знаков и метасимволов. К знакам
относятся буквы и цифры, всё остальное, если и не является метасимволом, может
им стать, поэтому всё, что не есть буква и не есть цифра, следует делать
знаком "насильственно". Для этого надо перед ним поставить обратный слеш -
#\#.

    Обратите внимание на то, что все слеши (и прямые, и обратные) в вашем
регулярном выражении должны писаться со спецсимволом #\# впереди, чтобы не
быть спутанными с другими спецсимволами или концом выражения. Пример: строка
"большое\белое/страшное" в виде регулярного выражения должна выглядеть так -
"большое\\\\белое\/страшное".

    #Метасимволы#

    #\#  - ^<wrap>следующий за ним знак будет рассмотрен именно как знак, а не как метасимвол
    #^#  - ^<wrap>начало строки
    #$#  - ^<wrap>конец строки
    #|#  - ^<wrap>альтернатива. Должно совпасть выражение до или после |.

          ^<wrap>Пример: "\d+\w+|Hello\d+" работает как "(\d+\w+)|(Hello\d+)", а не как "\d+(\w+|H)ello\d+".

    #()# - ^<wrap>группировка - группировка служит либо для использования
"ссылок", либо для использования попавшего в скобку фрагмента текста при замене.
    #[]# - ^<wrap>класс знаков - это метасимвол который совпадёт с любым из
перечисленных в #[]# знаком или диапазоном знаков. Диапазоны указываются например так: [a-z]
Метасимволы не учитываются в классах символов. Если первый знак класса - #^#, то это делается негативный класс. Если
хочется добавить в класс знак #^#, он либо не должен быть первым, либо перед ним должен быть #\#.

    Кроме группировки круглые скобки служат ещё для следующих операций:
    #(?:pattern)#  - ^<wrap>обычная группировка, но только эта скобка не получает "номера".
    #(?=pattern)#  - ^<wrap>просмотр вперёд. Совпадение продолжится с того же места, но только если pattern в этой скобке
совпал. Например, #\w+(?=\s)# совпадёт со словом, за которым идёт пробел, причём пробел не будет
включён в результат поиска.
    #(?!pattern)#  - ^<wrap>отрицание просмотра вперёд. Совпадение продолжится с того же места, если pattern НЕ
совпадёт. Например, #foo(?!bar)# совпадёт с любым вхождением "foo", которое встречается без
последующего "bar". Помните, что это выражение имеет нулевой размер, что означает, что
#a(?!b)d# совпадёт с #ad#, потому что #a# сопровождается знаком, который не #b# (а #d#),
а #d# идёт за выражением нулевого размера.
    #(?<=pattern)# - ^<wrap>просмотр назад. К сожалению, pattern должен быть фиксированной длины.
    #(?<!pattern)# - ^<wrap>отрицание просмотра назад. Те же ограничения, что и для просмотра назад.

    #(?{name}pattern)# - поименованные скобки.
    В качестве имени "name" может быть пустая строка (получается
#безымянная скобка#, на которую нельзя сослаться) или последовательность из
знаков слова (\w) и пробелов (\s).

    #Квантификаторы#

    За любым знаком, группой или классом знаков может идти один из
квантификаторов:

    #?#      - ^<wrap>жадное совпадение 0 или один раз.
    #??#     - ^<wrap>нежадное совпадение 0 или один раз.
    #*#      - ^<wrap>жадное совпадение 0 или более раз.
    #*?#     - ^<wrap>нежадное совпадение 0 или более раз.
    #+#      - ^<wrap>жадное совпадение 1 или более раз.
    #+?#     - ^<wrap>нежадное совпадение 1 или более раз.
    #{n}#    - ^<wrap>совпадение точно n раз.
    #{n,}#   - ^<wrap>жадное совпадение n или более раз.
    #{n,}?#  - ^<wrap>нежадное совпадение n или более раз.
    #{n,m}#  - ^<wrap>жадное совпадение не меньше чем n, но не больше чем m раз.
    #{n,m}?# - ^<wrap>нежадное совпадение не меньше чем n, но не больше чем m раз.
    #{,m}#   - ^<wrap>эквивалентно {0,m}
    #{,m}?#  - ^<wrap>эквивалентно {0,m}?


    #Что такое "жадный" и "нежадный" квантификатор#

    Жадный квантификатор захватывает как можно больше. И только, если
дальнейшего совпадения не получилось, "отдаёт" захваченное (происходит
"откат", не самая "дешёвая" операция).
    Если выражение "A.*Z" сопоставить строке
"AZXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", то #.*# сначала захватит всю строку, а
потом будет по одному знаку "откатываться" пока не найдёт Z. А если
выражение будет "A.*?Z" то Z найдётся сразу же. Нежадный квантификатор ещё
называют #минимизирующим#, он захватывает минимально возможное количество
знаков, и только, если дальнейшее совпадение не получилось, захватывает ещё.

    #Спецсимволы#

   Перед небуквой и нецифрой можно в большинстве случаев ставить знак '#\#',  а
для букв и цифр это делать нужно осторожно, ибо таким образом обозначаются
спецсимволы:

    #.#    - ^<wrap>любой знак, кроме перевода строки. Если среди опций есть s, то вообще любой знак.
    #\t#   - tab (0x09)
    #\n#   - new line (lf, 0x0a)
    #\r#   - return (cr, 0x0d)
    #\f#   - form feed (0x0c)
    #\a#   - bell (0x07)
    #\e#   - escape (0x1b)
    #\xNNNN# - hex char, где N - [0-9A-Fa-f].
    #\Q#   - ^<wrap>начало квотирования метасимволов - всё, что квотируется,
будет обрабатываться как текст, а не как регулярное выражение
    #\E#   - конец квотирования метасимволов
    #\w#   - буква, цифра или '_'.
    #\W#   - не \w
    #\s#   - пробельный знак (tab/space/lf/cr).
    #\S#   - не \s
    #\d#   - цифра
    #\D#   - не цифра
    #\i#   - буква
    #\I#   - не буква
    #\l#   - знак в нижнем регистре
    #\L#   - не знак в нижнем регистре
    #\u#   - знак в верхнем регистре
    #\U#   - не знак в верхнем регистре
    #\b#   - ^<wrap>граница слова - означает, что слева или справа от текущей
позиции находится знак из "слова", а справа или слева, соответственно, из "не слова"
    #\B#   - не \b
    #\A#   - начало текста, независимо от опции m
    #\Z#   - конец текста, независимо от опции m
    #\O#   - ^<wrap>точка "невозврата". Если при матчинге пройден этот знак,
то отката назад не будет, сразу выдаст no match. Можно
использовать в сложном выражении после обязательного
фрагмента с квантификатором. Этот спецсимвол можно
использовать, когда обрабатываемые объёмы данных очень
большие.
         Пример:
         /.*?name\O=(['"])(.*?)\1\O.*?value\O=(['"])(.*?)\3/
         ^<wrap>Строки,  в которых есть "name=", но нет "value=", будут обрабатываться (фактически - пропускаться) быстрее.

    #\NN#  - ^<wrap>ссылка на ранее совпавшую скобку. NN - целое положительное число
Каждая скобка кроме (?:pattern), (?=pattern), (?!pattern), (?<=pattern), (?<!pattern) и (?{name}pattern)
имеет номер (по порядку появления открывающей скобки).

         Пример:
         "(['"])hello\1" совпадёт с "hello" или 'hello'.

    #\p{name}# - ^<wrap>ссылка на ранее совпавшую скобку с именем name.


    #Примеры#

    #/foobar/#
       совпадёт с "foobar", но не с "FOOBAR"
    #/ FOO bar /ix#
       совпадёт с "foobar" и с "FOOBAR"
    #/(foo)?bar/#
       совпадёт с "foobar" и "bar"
    #/^foobar$/#
       совпадёт _только_ с "foobar", но не с "foofoofoobarfoobar"
    #/[\d\.]+/#
       совпадёт с любым числом с десятичной точкой
    #/(foo|bar)+/#
       совпадёт с "foofoofoobarfoobar" и "bar"
    #/\Q.)))$\E/#
       эквивалентно "\.\)\)\)\$"

@RegExpRepl
$ #Регулярные выражения для замены#
    В строке замены помимо обычных знаков вы можете использовать специальные
операторы - регулярные выражения для строки замены.

    #$0#..#$N#

    Номера найденных групп. Соответствующая группа подставляется в строку во время
работы. Номера группам присваиваются в порядке следования открывающих скобок в
регулярном выражении. #$0# означает всю найденную последовательность целиком.

    $#{#name#}#    Подставить группу с именем #name#.


@ElevationDlg
$ #Запрос привилегий администратора#
    Во время выполнения разнообразных операций с файловой системой
у текущего пользователя может не хватать прав. В этом случае Far Manager
предлагает повторить попытку от имени администратора (повысить права
текущего пользователя).

    Доступны опции:

    #Выполнить это действие для всех текущих объектов#
    Не задавать вопросов о повышении прав для текущей файловой операции.

    #Больше не спрашивать в текущей сессии#
    В текущем сеансе Far Manager будет самостоятельно повышать
привилегии без запроса пользователя.

    См. также опцию #Запрос прав администратора#
в ~Системных параметрах~@SystemSettings@.


@KeyMacro
$ #Макросы#
    По умолчанию, макросы грузятся из файлов с расширениями #.lua# и #.moon#, находящихся в папке
#%FARPROFILE%\\Macros\\scripts#. Подробнее см. в документе #%FARHOME%\\Encyclopedia\\macroapi_manual.ru.chm#.

    Клавиатурные макрокоманды или макросы - это записанная последовательность
нажатий клавиш. Макрос позволяет многократно выполнять одну и ту же
последовательность действий за одно нажатие горячей клавиши.

    Каждый макрос имеет следующие параметры:

    - горячую клавишу, при нажатии на которую будет выполнена
      записанная последовательность;
    - набор дополнительных ~параметров~@KeyMacroSetting@, которые влияют на способ
      и место воспроизведения Far записанной последовательности;

    Макросы, чаще всего, используются для:

    1. Совершения одинаковых действий несколько раз, используя для
       вызова последовательности этих действий одно сочетание кнопок.
    2. Выполнения специальных функций, которые задаются специальными
       командами в тексте макроса.
    3. Переопределение стандартных сочетаний клавиш, которые
       использует Far для совершения тех или иных действий.

    Основным применением макросов является определение кнопок для быстрого
вызова внешних плагинов и переопределение действий Far.

    См. также:

    ~Области действия макросов~@KeyMacroArea@
    ~Кнопки назначения~@KeyMacroAssign@
    ~Запись и воспроизведение макросов~@KeyMacroRecPlay@
    ~Удаление макроса~@KeyMacroDelete@
    ~Параметры макрокоманды~@KeyMacroSetting@
    ~Установленные макросы~@KeyMacroList@


@KeyMacroArea
$ #Макросы: области действия#
    Far позволяет создавать независимые ~макросы~@KeyMacro@ (макросы, у которых
совпадает сочетание клавиш запуска) для различных областей.

    Внимание: Область, к которой будет принадлежать макрос,
              определяется тем местом, где его #начали# записывать.

    В настоящий момент такими независимыми областями являются:

    - файловые панели;
    - внутренняя программа просмотра;
    - редактор;
    - диалоги;
    - быстрый поиск в панелях;
    - меню выбора дисков;
    - основное меню;
    - прочие меню;
    - система помощи;
    - информационная панель;
    - панель быстрого просмотра;
    - панель дерева папок;
    - пользовательское меню;
    - остальное: режим копирования текста с экрана, вертикальные меню.

    Нельзя назначить на какое-либо сочетание клавиш в одной области несколько
различных действий. При попытке назначить для нового макроса уже используемое
сочетание предыдущий макрос будет удалён.

    Таким образом, вы можете иметь по одному макросу с одинаковым сочетанием
клавиш запуска в каждой из перечисленных областей.


@KeyMacroAssign
$ #Макросы: кнопки назначения#
    ~Макрос~@KeyMacro@ может быть назначен на:

    1. любую клавишу;
    2. на сочетание клавиши с модификаторами #Ctrl#, #Alt# и #Shift#;
    3. на сочетание клавиши с двумя модификаторами.
       Far позволяет использовать следующие двойные модификаторы:
       #Ctrl+Shift+<клавиша>#, #Ctrl+Alt+<клавиша># и #Alt+Shift+<клавиша#>

    Макрос #не# может быть назначен на следующие клавиши и сочетания клавиш:
#Alt+Ins#, #Ctrl+<.>#, #Ctrl+Shift+<.>#, #Ctrl+Alt#, #Ctrl+Shift#, #Shift+Alt#
и #Shift+<символ>#.

    Некоторые комбинации клавиш (в частности, #Enter#, #Esc#, #F1#, #Ctrl+F5#,
#MsWheelUp# и #MsWheelDown# с комбинацией #Ctrl#, #Shift# и #Alt#) невозможно
ввести напрямую в диалоге назначения макроклавиши, поскольку они имеют
специальные функции. Для того, чтобы назначить макрос на одну из таких
комбинаций клавиш, выберите её из выпадающего списка.


@KeyMacroRecPlay
$ #Макросы: запись и воспроизведение#
    Far может выполнять ~макросы~@KeyMacro@ в двух основных режимах:

    1. Общий режим: нажимаемые клавиши при записи
       и воспроизведении #будут# передаваться плагинам.

    2. Специальный режим: нажимаемые клавиши при записи
       и воспроизведении #не будут# передаваться плагинам,
       перехватывающим события в редакторе.

    Например, если какой-то плагин обрабатывает сочетание клавиш #Ctrl+A#, то
при специальном режиме работы макросов этот плагин не получит управления и не
выполнит действия, которые он обычно выполняет при реакции на это сочетание
клавиш.

    Создание макроса выполняется следующими действиями:

    1. Начало записи макроса.

       Клавиша #Ctrl+<.># (#Ctrl# и клавишу с точкой) для записи
       макроса в общем режиме и #Ctrl+Shift+<.># (#Ctrl#,
       #Shift# и клавишу с точкой), для записи макроса в специальном
       режиме.

       После того как Far начал запись макроса в левом верхнем
       углу экрана будет отображаться символ '\4FR\-'.

    2. Текст макроса.

       Far будет сохранять все нажимаемые клавиши со следующими
       исключениями:

       - будут сохранены только клавиши, обрабатываемые Far.
         Т.е. если вы в процессе записи макроса из консоли Far
         запустите внешнюю программу, то Far сохранит только
         клавиши, нажатые до запуска и после завершения внешней
         программы.

       #Примечание:# На время записи макроса все остальные макросы
       отключаются. Таким образом, нельзя записать "многоступенчатый"
       макрос, вызывающий ранее записанные макропоследовательности.

    3. Окончание записи макроса.

       Для завершения записи макроса служат специальные сочетания
       клавиш. Т.к. макрос может быть дополнительно настроен,
       то таких сочетаний два: #Ctrl+<.># (#Ctrl# и клавиша с точкой)
       и #Ctrl+Shift+<.># (#Ctrl#, #Shift# и клавиша с точкой).
       Первое сочетание вызывает запись макроса с параметрами
       воспроизведения, принятыми по умолчанию. Второе сочетание
       клавиш показывает диалог с ~параметрами~@KeyMacroSetting@ выполнения макроса.

    4. Назначение сочетания клавиш для запуска макроса.

       После окончания ввода текста макроса и назначения параметров
       его выполнения будет показан диалог ~назначения клавиши~@KeyMacroSetting@,
       в котором можно задать горячую клавишу для воспроизведения
       записанной последовательности.

    Воспроизведение макроса сопровождается отображением в левом верхнем углу экрана символа '\2FP\-'. 
См. также "~Macros.ShowPlayIndicator~@Macros.ShowPlayIndicator@" для включения/отключения отображения символа.

@KeyMacroDelete
$ #Макросы: удаление макроса#
    Для того, чтобы удалить ~макрос~@KeyMacro@, нужно записать пустой (не
содержащий действий) макрос и присвоить ему горячую клавишу макроса, который вы
хотите удалить.

    Эту операцию можно выполнить, осуществив следующие действия:

    1. Начать запись макроса (#Ctrl+<.>#)
    2. Закончить запись макроса (#Ctrl+<.>#)
    3. Ввести или выбрать в диалоге назначения горячей клавиши
       сочетание, макрос для которого вы хотите удалить

    #Внимание#

    После удаления макроса сочетание клавиш, используемое для его
    выполнения, начнёт выполнять свою первоначальную функцию. Т.е.
    если это сочетание клавиш до записи макроса обрабатывалось Far
    или каким-либо плагином, то после удаления макроса оно снова начнёт
    обрабатываться.


@KeyMacroSetting
$ #Макросы: параметры макрокоманды#
    Для задания дополнительных параметров ~макрокоманды~@KeyMacro@ завершите её
запись с помощью #Ctrl+Shift+.# вместо #Ctrl+.# и выберите желаемые опции в
появившемся диалоге:

    #Последовательность:#

    Позволяет изменить записанную последовательность клавиш.

    #Описание:#

    Позволяет изменить описание данной последовательности клавиш.

    #Разрешить во время выполнения вывод на экран#

    Если отключить этот параметр, то во время выполнения макрокоманды Far
Manager отключает перерисовку экрана. Все изменения будут отображены после
завершения макрокоманды.

    #Выполнять после запуска Far#

    Позволяет выполнять макрокоманду сразу после запуска Far Manager.

    Для активной и пассивной панелей возможны следующие условия, активизирующие
макрокоманду:

     #На панели плагина#
        [x] - выполнять, только если панель плагиновая
        [ ] - выполнять только для файловой панели
        [?] - игнорировать тип панели

     #Выполнять для папок#
        [x] - выполнять, только если на панели под курсором папка
        [ ] - выполнять, только если на панели под курсором файл
        [?] - выполнять для папок и файлов

     #Отмечены файлы#
        [x] - выполнять, только если на панели есть отмеченные
              файлы/папки
        [ ] - выполнять, если нет отмеченных файлов/папок
        [?] - игнорировать состояние отметки файлов/папок

   Прочие условия активизирующие макрокоманду:

     #Пустая командная строка#
        [x] - выполнять, только если командная строка пуста
        [ ] - выполнять, только если командная строка не пуста
        [?] - игнорировать состояние командной строки

     #Отмечен блок#
        [x] - выполнять, только если выделен блок в редакторе,
              программе просмотра, командной строке или в строке
              ввода в диалоге.
        [ ] - выполнять, если нет отмеченного блока
        [?] - игнорировать состояние отметки блока


   Примечания:

    1. Far, перед активацией макрокоманды, проверяет все описанные выше
условия.

    2. Некоторые комбинации клавиш (в частности, #Enter#, #Esc#, #F1#,
#Ctrl+F5#, #MsWheelUp#, #MsWheelDown# и другие клавиши мыши с комбинацией #Ctrl#, #Shift# и #Alt#)
невозможно ввести напрямую, поскольку они имеют специальные функции в диалоге.
Для того, чтобы ~назначить макрос~@KeyMacroAssign@ на одну из таких комбинаций
клавиш, выберите её из выпадающего списка в диалоге.


@KeyMacroList
$ #Макросы: Список установленных макросов#
    Ниже приведён список разделов, в которых можно узнать какие ~макросы~@KeyMacro@
действуют в текущей сессии Far Manager.

  ~Общие макросы#~@KeyMacroCommonList@

  ~Панели~@KeyMacroShellList@
  ~Панель быстрого просмотра~@KeyMacroQViewList@
  ~Панель папок~@KeyMacroTreeList@
  ~Информационная панель~@KeyMacroInfoList@
  ~Автодополнение в панелях~@KeyMacroShellAutoCompletionList@

  ~Быстрый поиск в панелях~@KeyMacroSearchList@
  ~Поиск папки~@KeyMacroFindFolderList@

  ~Диалоги~@KeyMacroDialogList@
  ~Автодополнение в диалогах~@KeyMacroDialogAutoCompletionList@

  ~Главное меню~@KeyMacroMainMenuList@
  ~Меню выбора дисков~@KeyMacroDisksList@
  ~Меню пользователя~@KeyMacroUserMenuList@
  ~Прочие меню~@KeyMacroMenuList@

  ~Программа просмотра~@KeyMacroViewerList@
  ~Редактор~@KeyMacroEditList@

  ~Файл помощи#~@KeyMacroHelpList@

  ~Остальные области~@KeyMacroOtherList@

@KeyMacroCommonList
$ #Макросы: Общие#
    Ниже приведены комбинации макроклавиш, действующих везде.

<!Macro:Common!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroQViewList
$ #Макросы: Панель быстрого просмотра#
    Ниже приведены комбинации макроклавиш, действующих в панели быстрого просмотра.

<!Macro:Common!>

<!Macro:Qview!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroMainMenuList
$ #Макросы: Главное меню#
    Ниже приведены комбинации макроклавиш, действующих в главном меню.

<!Macro:Common!>

<!Macro:MainMenu!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroTreeList
$ #Макросы: Панель папок#
    Ниже приведены комбинации макроклавиш, действующих в панели папок.

<!Macro:Common!>

<!Macro:Tree!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroDialogList
$ #Макросы: Диалоги#
    Ниже приведены комбинации макроклавиш, действующих в диалогах.

<!Macro:Common!>

<!Macro:Dialog!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroInfoList
$ #Макросы: Информационная панель#
    Ниже приведены комбинации макроклавиш, действующих в информационной панели.

<!Macro:Common!>

<!Macro:Info!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroDisksList
$ #Макросы: Меню выбора дисков#
    Ниже приведены комбинации макроклавиш, действующих в меню выбора дисков.

<!Macro:Common!>

<!Macro:Disks!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroUserMenuList
$ #Макросы: Меню пользователя#
    Ниже приведены комбинации макроклавиш, действующих в пользовательском меню.

<!Macro:Common!>

<!Macro:UserMenu!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroShellList
$ #Макросы: Панели#
    Ниже приведены комбинации макроклавиш, действующих в файловых панелях.

<!Macro:Common!>

<!Macro:Shell!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroSearchList
$ #Макросы: Быстрый поиск в панелях#
    Ниже приведены комбинации макроклавиш, действующих в быстром поиске файловых панелей.

<!Macro:Common!>

<!Macro:Search!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroFindFolderList
$ #Макросы: Поиск папки#
    Ниже приведены комбинации макроклавиш, действующих в поиске папки.

<!Macro:Common!>

<!Macro:FindFolder!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroViewerList
$ #Макросы: Программа просмотра#
    Ниже приведены комбинации макроклавиш, действующих в программе просмотра.

<!Macro:Common!>

<!Macro:Viewer!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroMenuList
$ #Макросы: Прочие меню#
    Ниже приведены комбинации макроклавиш, действующих в прочих меню.

<!Macro:Common!>

<!Macro:Menu!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroEditList
$ #Макросы: Редактор#
    Ниже приведены комбинации макроклавиш, действующих в редакторе.

<!Macro:Common!>

<!Macro:Editor!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroHelpList
$ #Макросы: Файл помощи#
    Ниже приведены комбинации макроклавиш, действующих в файле помощи.

<!Macro:Common!>

<!Macro:Help!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroOtherList
$ #Макросы: Остальные области#
    Ниже приведены комбинации макроклавиш, действующих в других областях: копировании текста с экрана, вертикальных меню.

<!Macro:Common!>

<!Macro:Other!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroShellAutoCompletionList
$ #Макросы: Автодополнение в панелях#
    Ниже приведены комбинации макроклавиш, действующих в автодополнении в панелях.

<!Macro:Common!>

<!Macro:ShellAutoCompletion!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@KeyMacroDialogAutoCompletionList
$ #Макросы: Автодополнение в диалогах#
    Ниже приведены комбинации макроклавиш, действующих в автодополнении в диалогах.

<!Macro:Common!>

<!Macro:DialogAutoCompletion!>

    См. также ~«Список установленных макросов»~@KeyMacroList@

@FarAbout
$ #Информация о версиях#
    Запускается по команде #far:about#

    Позволяет посмотреть:
    - версию и битность Far Manager
    - версии используемых в проекте сторонних библиотек
    - имена и версии подключённых плагинов

@FarConfig
$ #Редактор конфигурации#
    Запускается по команде #far:config#

    Позволяет просмотреть и изменить все настройки Far Manager.
    Большинство настроек можно изменить через ~Меню параметров~@OptMenu@, но некоторые доступны только отсюда или через импорт конфигурации.
Параметры показаны в виде единого списка, состоящего из трёх полей: имя в формате SectionName.ParamName (например Editor.TabSize),
тип (boolean, 3-state, integer, string) и значение параметра (для типа integer дополнительно отображаются шестнадцатиричное и символьное представления).
Если значение параметра отличается от значения по умолчанию, он помечается символом '*' слева от имени.

    Кроме клавиш перемещения по списку доступны следующие сочетания:

    #Enter# или #F4#  изменить значение параметра,
                  boolean и 3-state на месте,
                  для integer и string вызывается диалог.

    #Shift+F4#      Для типа integer вызывается диалог ввода шестнадцатиричного числа,
                  всё прочее как для #F4#.

    #Ctrl+H#        Скрыть/показать параметры, значения которых не изменены (соответствуют значениям по умолчанию).

    #Shift+F1#      Показать описание параметра, если оно доступно.

    #Ctrl+Alt+F#    Включить/Выключить режим фильтрации.

@Codepages.NoAutoDetectCP
$ #far:config Codepages.NoAutoDetectCP#
    Этот строковый параметр задаёт кодовые страницы, которые будут
исключены из автоматического определения Universal Codepage Detector'ом
(UCD). Иногда (особенно на небольших файлах) UCD назойливо выбирает
неподходящие кодовые страницы.

    Значение по умолчанию -- это пустая строка #""#. В этом случае все
кодовые страницы, которые может определить UCD (около двух десятков,
гораздо меньше, чем обычно доступно в системе) разрешены.

    Если параметр равен строке #"-1"#, и раздел #Прочие# в меню
~кодовых страниц~@CodePagesMenu@ скрыт (комбинация клавиш #Ctrl+H#),
то для UCD будут разрешены только #Системные# (ANSI, OEM), #Юникодные#
и #Избранные# кодовые страницы. Если раздел #Прочие# виден, все кодовые
страницы разрешены.

    В противном случае параметр должен содержать список номеров кодовых
страниц, запрещённых для UCD. Например,
#"1250,1252,1253,1255,855,10005,28592,28595,28597,28598,38598"#.

    Поскольку юникодные кодовые страницы (1200, 1201, 65001) проверяются
отдельно от UCD, они не могут быть запрещены, даже если они есть
в списке исключений.

    Изменение этого параметра возможно только через ~far:config~@FarConfig@

@Help.ActivateURL
$ #far:config Help.ActivateURL#
    Параметр позволяет управлять активацией URL ссылок в HLF-файлах:

     0 - отключить активацию.
     1 - активация включена.
     2 - активация включена, но выдавать предупреждающее сообщение.

    По умолчанию значение = 1 (разрешено).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Confirmations.EscTwiceToInterrupt
$ #far:config Confirmations.EscTwiceToInterrupt#
    Параметр позволяет менять поведение при нажатии Esc в диалоге подтверждения прерывания операции.

    Может быть одним из следующих значений:

     0 - ^<wrap>Нажатие кнопки ESC закрывает сообщение и продолжает выполнение операции.
     1 - ^<wrap>Нажатие кнопки ESC закрывает сообщение и прерывает выполнение операции

    По умолчанию значение = 0 (закрыть сообщение и продолжить выполнение операции).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.AllCtrlAltShiftRule
$ #far:config System.AllCtrlAltShiftRule#
    Параметр задаёт поведение комбинации Ctrl+Alt+Shift для временного гашения объектов интерфейса.

    Номера битов:
     0 - Панели.
     1 - Редактор.
     2 - Внутренняя программа просмотра.
     3 - Окно подсказки.
     4 - Диалоги.

    Если бит установлен, гашение разрешено.

    По умолчанию разрешено гашение всех объектов.

    См. также ~System.CASRule~@System.CASRule@

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.CASRule
$ #far:config System.CASRule#
    Параметр позволяет отключать комбинацию Ctrl+Alt+Shift для временного гашения объектов интерфейса.
    Различаются комбинации левого и правого Ctrl+Alt+Shift.

    Номера битов:
      0 - левая комбинация Ctrl+Alt+Shift.
      1 - правая комбинация Ctrl+Alt+Shift.

    Если бит установлен, срабатывает гашение экрана.

    По умолчанию разрешены обе комбинации.

    См. также ~System.AllCtrlAltShiftRule~@System.AllCtrlAltShiftRule@

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Panel.ShellRightLeftArrowsRule
$ #far:config Panel.ShellRightLeftArrowsRule#
    Параметр позволяет управлять поведением стрелок влево/вправо (как на основной, так и на дополнительной клавиатуре).

    Значения:
      0 - ^<wrap>поведение как у 1.70: если командная строка непустая, то клавиши
Left/Right и Num4/Num6 действуют по-разному в зависимости от
режима панели: если имена файлов отображаются в несколько колонок
(по умолчанию режимы 2 и 3), то команды вправо/влево применяются
к панели (как и при пустой командной строке); а если имена файлов
отображаются в одну колонку (по умолчанию все остальные режимы),
то команды вправо/влево применяются к командной строке.
      1 - ^<wrap>клавиши Left/Right и Num4/Num6 при включённой панели всегда
применяются только к ней, независимо от содержимого командной
строки и режима панели.
          Примечание: в командной строке есть CtrlD/CtrlS.

    По умолчанию значение = 0.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Panel.Layout.ScrollbarMenu
$ #far:config Panel.ShellRightLeftArrowsRule#
    Параметр разрешает показ полосы прокрутки в меню, если пунктов больше, чем высота меню. Если значение =0, то Far не будет отображать полосу прокрутки.

    По умолчанию значение = 1 (отображать полосу прокрутки).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Panel.CtrlFRule
$ #far:config Panel.CtrlFRule#
    Параметр задаёт поведение Ctrl+F.

    Если = 0, то название файла помещается в командную строку как есть,
иначе - с учётом отображения на панелях (т.е. может приводиться к
нижнему регистру или к короткому имени).
    
    По умолчанию значение = 0.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Panel.CtrlAltShiftRule
$ #far:config Panel.CtrlAltShiftRule#
    Параметр задаёт поведение комбинации Ctrl+Alt+Shift для временного гашения панелей:

     0 - гасить только панели (подобно Ctrl+O).
     1 - гасить панели и командную строку.
     2 - гасить панели, командную строку и KeyBar.

    По умолчанию действует правило 0.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Panel.RightClickRule
$ #far:config Panel.RightClickRule#
    Параметр задаёт поведение правой кнопки мыши для случая, если нажали кнопку на пустой колонке панели:

     0 - ^<wrap>позиционирование и пометка последнего файла в предыдущей колонке.
     1 - ^<wrap>в предыдущей колонке файл позиционируется без пометки (аналогично нажатию левой кнопки мыши).
     2 - ^<wrap>не изменять позицию и не помечать файл (по умолчанию).

    В любом случае - если колонка не пуста, то происходит пометка файла.

    По умолчанию значение = 2.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.ExcludeCmdHistory
$ #far:config System.ExcludeCmdHistory#
    Параметр позволяет определять, какие типы команд не будут помещаться в историю. 
Проверка идёт по битовой маске. Если бит установлен, данный тип команд в историю не помещается.

    Номера битов:

     0 - не помещать в историю команды ассоциаций Windows
     1 - не помещать в историю команды ассоциаций Far
     2 - не помещать в историю команды запуска с панели
     3 - не помещать в историю команды запуска из командной строки
    
    По умолчанию значение = 0 (помещать в историю все команды).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.Executor.RestoreCP
$ #far:config System.Executor.RestoreCP#
    Параметр позволяет управлять восстановлением кодовой страницы после запуска и отработки внешних
программ в окне Far Manager.

    Некоторые программы изменяют кодовую страницу консольного окна и после
своей обработки не восстанавливают предыдущее значение. Может быть одним из следующих значений:

     0 - "оставить всё как есть" (не восстанавливать значение)
     1 - восстанавливать предыдущее значение кодовой страницы

    По умолчанию значение = 1 (восстанавливать значение).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.Executor.UseAppPath
$ #far:config System.Executor.UseAppPath#
    При запуске на исполнение содержимого командной строки Far ищет
исполняемый модуль по  следующей логике (попеременно подставляя расширения, перечисленные в переменной окружения  %PATHEXT%):

     1. Текущий каталог
     2. Каталоги, которые перечислены в переменной окружения %PATH%
     3. Windows 95: Системный каталог Windows (SYSTEM).
        Windows NT: 32-битный системный каталог Windows (SYSTEM32)
     4. Windows NT: 16-битный системный каталог Windows (SYSTEM)
     5. Каталог Windows.

     Если параметр "System.Executor.UseAppPath" равен 1, то дополнительно производится поиск исполняемых модулей в реестре:

     6. Содержимое ветки реестра:
        [HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\App Paths]

     7. Содержимое ветки реестра:
        [HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\App Paths]

    Независимо от состояния этого параметра, модуль, прописанный в "App Paths", будет запущен проводником, если для запуска
используется комбинация Shift+Enter.

    По умолчанию значение = 1 (проверять ветки реестра)

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.Executor.ExcludeCmds
$ #far:config System.Executor.ExcludeCmds#
    Параметр позволяет задавать набор команд которые будут сразу передаваться 
в %comspec% для выполнения, поиск в PATH и т.п. не будет произведён. 
    
    Разделитель команд - символ ';'. Например, если "System.Executor.ExcludeCmds" задан списком "DATE;ECHO",  
то при вводе 'date' будет исполнена внутренняя команда CMD.EXE/COMMAND.COM. Для исполнения внешней команды 
"date.exe" необходимо точно написать её название. В тоже время, если "date.exe" доступно в %PATH% и из списка
"ExcludeCmds" убрать "DATE", то внутренняя команда ком.процессора никогда не будет исполнена.

    Готовые настройки для CMD.EXE, COMMAND.COM и TCCLE.EXE (известный ранее как 4NT.EXE) находятся в каталоге Addons\\SetUp, файлы "Executor.???.farconfig".

    Команды "CLS", "REM", "CD" и "CHDIR" Far обрабатывает самостоятельно. Эти команды не включены в "Executor.???.farconfig".

    Команды "IF", "CHCP" и "SET" Far обрабатывает с ограниченной функциональностью - если синтаксис 
отличается от приведённого в разделе "~Команды операционной системы~@OSCommands@", то команда 
передаётся на дальнейшую обработку ком.процессору.

    По умолчанию список "ExcludeCmds" пуст.

    В параметре можно использовать переменные среды.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.Executor.ComspecArguments
$ #far:config System.Executor.ComspecArguments#

    Аргументы, передаваемые командному процессору. #{0}# заменяется непосредственно исполняемой командой.
    Если ваш процессор использует другие ключи и/или кавычки, вы можете задать это здесь.

    Значение по умолчанию: #/S /C "{0}"# (совместимо с cmd.exe)

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.Executor.FullTitle
$ #far:config System.Executor.FullTitle#
    Параметр позволяет задавать вид заголовка консоли при запуске файла на исполнение.

    Может быть одним из следующих значений:

      0 - в заголовке консоли отображается то, что вводил пользователь.
      1 - в заголовке консоли отображается полный путь к исполняемому файлу.

    По умолчанию значение = 0 (то, что вводил пользователь).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Interface.FormatNumberSeparators
$ #far:config Interface.FormatNumberSeparators#
    Параметр позволяет определять символы, используемые в качестве разделителей групп разрядов и целой/дробной части чисел.
    Первый символ - разделитель групп разрядов.
    Второй символ - разделитель целой и дробной части.

    По умолчанию значение - "" (использовать региональные настройки ОС).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.Executor.BatchType
$ #far:config System.Executor.BatchType#
    Параметр позволяет задавать список расширений файлов, по которым Far Manager будет различать какие
файлы являются пакетными (Batch-файлы, обрабатываемые командным процессором) и будут исполняться 
в консоли Far Manager при нажатии Enter на соответствующем элементе панели  
(прочие - в отдельном консольном окне).

    Формат параметра: <.><Расширение><;>[<.><Расширение><;>]
    Разделитель расширений - символ ';'.
    Одиночный символ ";" задаёт пустой список (в этом случае ни один Batch-файл Far не будет исполнять).

    Например, список ".BAT;.BTM;" указывает, что Batch-файлами являются файлы "*.BAT" и "*.BTM".

    В DOS/Windows 9x пакетными файлами считаются файлы, имеющие расширение ".BAT". В линейке Windows на базе NT - ".BAT" и ".CMD".  
Командный процессор TCC/LE (известный ранее как 4NT; ~http://jpsoft.com~@http://jpsoft.com@) считает Batch-файлами файлы с расширением ".BTM". 
Если в списке указано расширение ".BTM", но в системе не прописаны настройки для этого типа файлов (например, не
установлен TCCLE/4NT), то штатный командный процессор (command.com или cmd.exe) не будет исполнять такие пакетные файлы.

    По умолчанию значение = ".BAT;.CMD;".

    В параметре можно использовать переменные среды.
    Если после раскрытия переменных среды список окажется пуст, будет использован список ".BAT;.CMD;".

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.Executor.~
$ #far:config System.Executor.~~#
    Параметр позволяет менять путь к домашней папке для команды "~CD ~~~@OSCommands@".

    По умолчанию значение = "%FARHOME%".

    См. также ~System.Executor.UseHomeDir~@System.Executor.UseHomeDir@

    Значение также можно поменять в диалоге ~Настройка командной строки~@CmdlineSettings@.

@System.Executor.UseHomeDir
$ #far:config System.Executor.UseHomeDir#
    Параметр позволяет включать или отключать переход к домашней папке командой "~CD ~~~@OSCommands@".

    По умолчанию значение = True.

    Значение также можно поменять в диалоге ~Настройка командной строки~@CmdlineSettings@.


@System.CmdHistoryRule
$ #far:config System.CmdHistoryRule#
    Параметр задаёт поведение выбора истории команд в командной строке, если после Ctrl+E/Ctrl+X нажали Esc:

      0 - Изменять положение в History.
      1 - Не изменять положение в History.

    По умолчанию действует правило 0.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.ConsoleDetachKey
$ #far:config System.ConsoleDetachKey#
    Параметр позволяет задавать сочетание клавиш для отделения консоли Far Manager от не интерактивного процесса, запущенного в ней.
    
    Если в консоли Far'а был запущен длительный процесс, например архивация, и по тем или иным причинам именно 
эта копия Far Manager нужна (редактор в фоне), или нежелательно запускать новый Far, то если у вас установлена 
эта опция, можно создать новую консоль для Far, где он продолжит  работу как если бы запущенный процесс уже 
завершился, а сам процесс продолжит работу в старой консоли.
    
    Например, значение "System.ConsoleDetachKey" равное "CtrlAltX" назначает процессу разделения сочетание клавиш Ctrl+Alt+X.

    По умолчанию значение = "CtrlShiftTab"

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.QuotedSymbols
$ #far:config System.QuotedSymbols#
    Параметр позволяет задавать набор символов, присутствие которых в именах файлов/папок заставит Far Manager заключать такие имена в кавычки.

    Максимум 32 символа.

    По умолчанию значение = " &()[]{}^=;!'+,`" и символ с кодом 0xA0.

    См. также ~System.QuotedName~@System.QuotedName@

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.QuotedName
$ #far:config System.QuotedName#
    Имена файлов/папок (содержащие символы, перечисленные в правиле 34) при
вставке в редактор/командную строку или в буфер обмена заключаются в кавычки.
    
    Параметр "System.QuotedName" управляет этим поведением:

    Биты:
      0 - ^<wrap>если установлен, то заключать имена файлов/папок в кавычки при вставке в редактор или командную строку;
      1 - ^<wrap>если установлен, то заключать имена файлов/папок в кавычки при запоминании в буфере обмена.

    По умолчанию установлен нулевой бит.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Interface.AltF9
$ #far:config Interface.AltF9#
    Параметр позволяет выбрать механизм работы комбинации Alt+F9 (Изменение размера экрана) в оконном режиме:

     1 - ^<wrap>использовать усовершенствованный механизм - окно Far Manager
будет переключаться с нормального на максимально доступный размер
консольного окна и обратно. Размер шрифта консольного окна
меняться не будет.
     0 - ^<wrap>использовать механизм, совместимый с Far версии 1.65 и
ниже, т.е. переключение 25/50 линий.

    Данный параметр влияет только на оконный режим работы Far Manager.

    По умолчанию значение = 1

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Dialog.CBoxMaxHeight
$ #far:config Dialog.CBoxMaxHeight#
    Параметр задаёт максимальную высоту открываемого списка истории в диалогах.

    По умолчанию значение = 8

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.UndoDataSize
$ #far:config Editor.UndoDataSize#
    Параметр позволяет ограничить количество памяти, используемой для операций отмены действий в редакторе.

    По умолчанию значение = 104857600 (100MB).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.CharCodeBase
$ #far:config Editor.CharCodeBase#
    Параметр позволяет менять представление кода символа под курсором в статусной строке в редакторе.

    Может принимать следующие значения:

      0 - восьмеричное значение (6 символов с ведущим нулём)
      1 - десятеричное значение (5 символов)
      2 - шестнадцатеричное значение (4 символа под цифру + символ ''h')

    По умолчанию значение = 1 (десятеричное значение).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.BSLikeDel
$ #far:config Editor.BSLikeDel#
    Параметр позволяет управлять поведением клавиши BackSpace в редакторе, когда выделен вертикальный блок. 
    
    Если значение отлично от 0, то BS удаляет вертикальный блок подобно клавише Del.

    По умолчанию значение = 1 (BS удаляет помеченный вертикальный блок).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.AllowEmptySpaceAfterEof
$ #far:config Editor.AllowEmptySpaceAfterEof#
    Окончание файла в редакторе всегда находится внизу экрана, если строк в файле больше чем строк экрана. 
При построчном скроллировании вниз (например, с помощью Ctrl+Down), скроллирование прекращается, когда
показывается последняя строка.

    Параметр "Editor.AllowEmptySpaceAfterEof" позволяет изменить такое поведение редактора.

    Может принимать следующие значения:
    
    0 - прекратить скроллинг, если последняя строка внизу экрана
    1 - продолжать скроллинг, при этом:
        a) поместить курсор за пределы файла по прежнему нельзя
        b) скроллинг с помощью Ctrl+Down сдвинет текст до курсора

    По умолчанию значение = 0 (прекратить скроллинг).

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Interface.RedrawTimeout
$ #far:config Interface.RedrawTimeout#
    Параметр  "Interface.RedrawTimeout" позволяет контролировать время обновления (в мс) 
сообщения в процессе копирования файлов, применения прав доступа после перемещения файлов или папок, 
удаления и поиска файлов, сканирование файловой системы.

    Чем больше значение "Interface.RedrawTimeout", тем реже выводится информацию о процессе и тем быстрее проходит этот самый процесс.

    По умолчанию значение = 200 мс.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@TitleFormat
$ #far:config Interface.ViewerTitleFormat, Interface.EditorTitleFormat#
    Параметры "Interface.ViewerTitleFormat" и "Interface.EditorTitleFormat" позволяют задавать 
формат заголовка консольного окна для ~редактора~@Editor@ и ~программы просмотра~@Viewer@.

    Допускаются шаблонные символы "%File" - имя файла, "%Lng" - строка из lng-файла ("edit" или "view")

    Кроме этого есть шаблон "Interface.TitleAddons", который добавляется в конец заголовка (задаётся в диалоге ~Настройка интерфейса~@InterfSettings@).

    По умолчанию заголовок содержит слово "редактор" (в зависимости от языка интерфейса) и "имя файла" (шаблон "%Lng %File").

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.WipeSymbol
$ #far:config System.WipeSymbol#
    Параметр позволяет задать код символа-заполнителя для операции "~Уничтожить файл~@DeleteFile@" (Alt+Del). 
Использует младший байт параметра.
    Если параметр установлен в -1, будут использоваться случайные значения.

    По умолчанию значение = 0.
    

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.FlagPosixSemantics
$ #far:config System.FlagPosixSemantics#
    Параметр "System.FlagPosixSemantics" задаёт поведение для процесса добавления отредактированного или просмотренного файла в историю.
Если значение параметра равно true, то при поиске дублей учитывается регистр символов в именах файлов.

    По умолчанию значение = true.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.ShowCheckingFile
$ #far:config System.ShowCheckingFile#
    Параметр "System.ShowCheckingFile" позволяет отображать в заголовке окна Far Manager имя плагина, 
претендующего на файл, который хотим запустить или отобразить в качестве файловой панели.

    По умолчанию значение = false - не отображать информацию.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.PluginMaxReadData
$ #far:config System.PluginMaxReadData#
    Параметр "System.PluginMaxReadData" позволяет задавать максимальный размер читаемых данных из 
файла в который попытались войти из панелей (Enter или Ctrl+PgDn). Считанные данные будут переданы
плагинам для определения плагина поддерживающего файл этого типа.

    Минимальное значение - 0x1000. Максимальное - 0xFFFFFFFF.
 
    Не рекомендуется выставлять значение этого параметра больше 5 Mb.
 
    По умолчанию значение = 0x20000.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.SetAttrFolderRules
$ #far:config System.SetAttrFolderRules#
    Параметр "System.SetAttrFolderRules" позволяет задавать значение по умолчанию опции "Process subfolders"
в диалоге установки атрибутов для одиночной папки:

     true  - ^<wrap>опция "Process subfolders" выключена, файловые дата и время установлены.
     false - ^<wrap>опция "Process subfolders" включена, файловые дата и время очищены.
    
    По умолчанию значение = true.
 
    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.CopyBufferSize
$ #far:config System.CopyBufferSize#
    Параметр "System.CopyBufferSize" задаёт размер буфера, когда не используется
~системная функция копирования~@SystemSettings@. Если параметр равен 0, то используется 
размер по умолчанию - 32768 байт.

    По умолчанию значение равно 0.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.SubstNameRule
$ #far:config System.SubstNameRule#
    Параметр "System.SubstNameRule" задаёт правило опроса приводов на предмет сканирования SUBST-дисков.
 
    Биты:
     0 - если установлен, то опрашивать сменные диски
     1 - если установлен, то опрашивать все остальные
 
    По умолчанию значение = 2 - опрашивать все диски кроме сменных.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.SubstPluginPrefix
$ #far:config System.SubstPluginPrefix#
    Параметр "System.SubstPluginPrefix" позволяет управлять подстановкой префиксов плагинов в операциях 
вставки пути к объекту (Ctrl+F, Ctrl+[…), находящемуся на панели плагина. Если значение равно #true#, то 
Far Manager автоматически добавит в командную строку префикс плагина перед вставляемым путём (кроме панелей, 
которые указывают на реальные файлы, например, "Временная панель"). Значение #false# не добавляет префиксы.
 
    По умолчанию значение = false.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.CopySecurityOptions
$ #far:config System.CopySecurityOptions#
    Параметр "System.CopySecurityOptions" позволяет управлять поведением опции "Права доступа" в диалоге копирования/перемещения.
   
    Номера битов:
     0 и 1 - ^<wrap>Диалог Move: по умолчанию выставлять опцию копирования (бит 0 выставлен в 1, 
бит 1 сброшен в 0) или наследования (биты 0 и 1 выставлены в 1) прав доступа;
     2     - ^<wrap>Диалог Move: запоминать состояние опции до конца сеанса работы Far Manager;
     3 и 4 - ^<wrap>Диалог Copy: по умолчанию выставлять опцию копирования (бит 3 выставлен в 1, бит 4 
сброшен в 0) или наследования (биты 3 и 4 выставлены в 1) прав доступа;
     5     - ^<wrap>Диалог Copy: запоминать состояние опции до конца сеанса работы Far Manager.

    Воздействие битов 0 и 1 зависит от состояния бита 2:
    1. ^<wrap>Если бит 2 выставлен в 1, то опция "Права доступа" будет установлена в зависимости от 
битов 0 и 1 только при первом вызове диалога перемещения после запуска Far Manager. Если вы 
переключите эту опцию в диалоге вручную, то при следующем вызове диалог предложит значение
опции, выбранное вами в прошлый раз. Значение этой опции запоминается только до конца сеанса 
работы Far Manager. При следующем запуске Far опция снова будет установлена в зависимости от битов 0 и 1.
    2. ^<wrap>Если бит 2 сброшен в 0, то опция "Права доступа" будет установлена в зависимости от 
битов 0 и 1 всякий раз при вызове диалога перемещения. Вы можете переключать эту опцию в диалоге 
вручную, но выбранное вами значение будет действовать только на текущую операцию переноса файлов.

    Аналогично, для операции копирования воздействие битов 3 и 4 зависит от состояния бита 5.

    Примеры:
      0x21 - ^<wrap>для операции перемещения опцию "Права доступа" выставлять всегда в "Копировать", 
для операции копирования выставлять опцию в значение по умолчанию и запоминать её значение до конца сеанса работы Far Manager.
      0xС0 - ^<wrap>для перемещения запоминать значение опции до конца сеанса работы Far (при первом вызове диалога опция 
выставлена в значение по умолчанию), для операции копирования опцию "Права доступа" выставлять всегда в "Копировать".

    По умолчанию значение параметра = 0 (опция "Права доступа" устанавливается в значение по 
умолчанию и до конца сеанса работы не запоминается).

    Примечание:

    Параметр "System.CopySecurityOptions" не влияет на создание связей (Alt+F6). В этом случае 
права всегда копируются.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Interface.CursorSize
$ #far:config Interface.CursorSizeX#
    Параметры "Interface.CursorSize1" и "Interface.CursorSize2" позволяют задавать размер курсора в оконном и полноэкранном режимах Far Manager для режима вставки.
   
    Параметры "Interface.CursorSize3" и "Interface.CursorSize4" позволяют задавать размер курсора в оконном и полноэкранном режимах Far Manager для режима замены.

    Значения параметров: число между 1 и 100 - процент символьной ячейки, который заполняется курсором. 
Курсор изменяется от полностью заполненной ячейки до горизонтальной строки внизу ячейки.

    Значения параметров равные нулю позволяют использовать системные настройки консоли.

    По умолчанию:
       Interface.CursorSize1 = 15
       Interface.CursorSize2 = 10
       Interface.CursorSize3 = 99
       Interface.CursorSize4 = 99

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.WordDiv
$ #far:config System.WordDiv#
    Параметр "System.WordDiv" позволяет задавать дополнительные (кроме пробела и табуляции) cимволы-разделители слов.

    По умолчанию: #~~!%^&*()+|{}:"<>?`-=\\[];',./#

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@XLat.WordDivForXlat
$ #far:config XLat.WordDivForXlat#
    Параметр "XLat.WordDivForXlat" позволяет задавать используемые в функции транслитерации (XLat, 
для преобразования текущего слова без выделения) символы-разделители слов.

    По умолчанию: пробел табуляция и символы #!##$%^&*()+|=\\/@?#

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.ReadOnlyLock
$ #far:config Editor.ReadOnlyLock#
    Параметр "Editor.ReadOnlyLock" задаёт поведение редактора при открытии файлов с атрибутами ReadOnly, Hidden и System.
 
    Биты:
     0 - Блокировать редактирование файла с атрибутом R/O
     1 - Предупреждать при открытии файла с атрибутом R/O
     2 - не используется
     3 - не используется
     4 - не используется
     5 - применять дополнительно для файлов с атрибутом Hidden
     6 - применять дополнительно для файлов с атрибутом System

    Значения в битах 0 и 1 соответствуют опциям в диалоге ~настроек редактора~@EditorSettings@  ("Блокировать 
редактирование файла с атрибутом R/O" и "Предупреждать при открытии файла с атрибутом R/O").

    Например, значение 0x43 - предупреждать и блокировать изменения в файлах с атрибутами ReadOnly и System.

    По умолчанию значение = 0.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.FileSizeLimit
$ #far:config Editor.FileSizeLimit#
    Параметр "Editor.FileSizeLimit" задаёт максимальный размер редактируемого файла в байтах. 
Если размер редактируемого файла превышает максимально допустимый, то будет показано предупреждающее сообщение перед 
открытием такого файла.

    По умолчанию значение = 0 (отключает проверку и вывод сообщения)

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.MsWheelDelta
$ #far:config System.MsWheelDelta* & System.MsHWheelDelta*#
    Параметры "System.MsWheelDelta*" и "System.MsHWheelDelta*" позволяют менять смещения для
прокрутки колесом мыши по вертикали и горизонтали.

    Параметры для вертикальной прокрутки:

    System.MsWheelDeltaView  - в программе просмотра
    System.MsWheelDeltaEdit  - во встроенном редакторе
    System.MsWheelDeltaHelp  - в системе помощи
    System.MsWheelDelta      - в прочих областях

    Параметры для горизонтальной прокрутки (Windows Vista и выше):

    System.MsHWheelDeltaView - в программе просмотра
    System.MsHWheelDeltaEdit - во встроенном редакторе
    System.MsHWheelDeltaHelp - в системе помощи
    System.MsHWheelDelta     - в прочих областях

    По умолчанию значение = 1

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@System.CopyTimeRule
$ #far:config System.CopyTimeRule#
    Параметр "System.CopyTimeRule" задаёт режим отображения вывода информации 
о средней скорости копирования, времени копирования и примерном времени до конца операции в диалоге копирования.
 
    Номера битов:
     0 - ^<wrap>если установлен, то показывать при копировании в NUL.
     1 - ^<wrap>если установлен, то показывать при обычных операциях копирования.

    Так как эта функция требует времени для сбора статистики, то на небольших файлах при выключенном
"общем индикаторе копирования" Вы можете ничего не увидеть.

    Параметр доступен в ~Настройках интерфейса~@InterfSettings@, но в диалоге можно выставить только два значения 
- показывать информацию везде или отключить режим отображения.

    Примеры:
     1 - ^<wrap>показывать информацию только при копировании в NUL
     2 - ^<wrap>показывать информацию при обычных операциях копирования.
     3 - ^<wrap>всегда показывать информацию о времени и скорости.

    По умолчанию значение = 3 (всегда показывать информацию о времени и скорости)

    Изменение этого параметра возможно через ~far:config~@FarConfig@ или в ~Настройках интерфейса~@InterfSettings@

@Policies.ShowHiddenDrives
$ #far:config Policies.ShowHiddenDrives#
    Параметр "Policies.ShowHiddenDrives" позволяет позволяет наследовать свойства Windows 
по сокрытию логических дисков из системы ("Hide  Drives in My Computer").

    Значение:

     false - ^<wrap>Far показывает только доступные диски (учитывается значение параметра 
"NoDrives" системной политики - [HKLM или HKCU\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer]).
Если "NoDrives" из HKLM=0 (не показывать скрытые диски для всех пользователей), 
то значение этого параметра из HKCU не имеет никакого эффекта.

     true  - ^<wrap>функция отключена, Far показывает все диски, независимо от
значения параметра "NoDrives" в реестре.

    По умолчанию значение = true

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.KeepEditorEOL
$ #far:config Editor.KeepEditorEOL#
    Параметр "Editor.KeepEditorEOL" позволяет управлять типом перевода строк для текста
вставляемого в редактор из буфера обмена.

     false - ^<wrap>текст вставляется без изменений, т.е. берётся тип перевода строк источника (при этом можно получить текст
с разными типами перевода строк).

     true  - ^<wrap>если файл не пуст, сохраняется текущий тип перевода строк редактируемого файла, 
в противном случае параметр ни на что не влияет, т.е. будет использован стиль переводов строк оригинала.

    По умолчанию значение = true

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.AddUnicodeBOM
$ #far:config Editor.AddUnicodeBOM#
    Параметр "Editor.AddUnicodeBOM" указывает надо ли добавлять BOM (Byte Order Mark) в начало создаваемых
редактором файлов в юникодной кодировке (1200, 1201, 65001).

     false - ^<wrap>BOM не добавляется.

     true  - ^<wrap>BOM добавляется.

    По умолчанию значение = true

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Editor.NewFileUnixEOL
$ #far:config Editor.NewFileUnixEOL#
    Параметр "Editor.NewFileUnixEOL" позволяет задавать умолчательные символы конца строки в редакторе
для вновь создаваемых файлов.

     false - ^<wrap>Во вновь создаваемых файлах строки заканчиваются символами #<CR><LF># - (как в Windows).

     true  - ^<wrap>Во вновь создаваемых файлах строки заканчиваются символом #<LF># - (как в Unix).

    По умолчанию значение = false

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Panel.ShortcutAlwaysChdir
$ #far:config Panel.ShortcutAlwaysChdir#
    Параметр "Panel.ShortcutAlwaysChdir" управляет поведением при нажатии клавиш перехода на папку
#RCtrl+0# .. #RCtrl+9#, когда панели невидимы.

     false - ^<wrap>нажатия передаются редактору командной строки, что приводит к появлению имени папки,
связанной с нажатой клавишей, в командной строке.

     true  - ^<wrap>всегда осуществляется переход на папку, связанную с нажатой клавишей (если задана),
даже если панели невидимы.

    По умолчанию значение = false

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Macros.ShowPlayIndicator
$ #far:config Macros.ShowPlayIndicator#
    Параметр "Macros.ShowPlayIndicator" позволяет включать или отключать отображение в левом верхнем углу экрана символа '\2FP\-'
во время воспроизведения макропоследовательности.

     false - ^<wrap>Символ не отображается

     true  - ^<wrap>Символ отображается

    По умолчанию значение = true

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Viewer.SearchWrapStop
$ #far:config Viewer.SearchWrapStop#
    Параметр "Viewer.SearchWrapStop" позволяет изменять поведение при прохождении через начало/конец
файла при поиске в просмотрщике.

     False - ^<wrap>Тихий переход через начало/конец файла

     True  - ^<wrap>Показывается сообщение о переходе через начало/конец файла

     Other - ^<wrap>Сообщение выводится при переходе через точку начала поиска (пройден весь файл)

    По умолчанию значение = True

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@XLat.Layouts
$ #far:config XLat.Layouts#
    Параметр "XLat.Layouts" позволяет задавать номера раскладок клавиатуры (через ';'), которые будут переключаться,
независимо от количества установленных в системе раскладок.

    Например, "04090409;04190419" (или "0409;0419").

    Если указано меньше двух, то механизм "отключается" и раскладки переключаются по кругу.

    Far для "Layouts" считывает первые 10 значений, остальные, если есть, игнорируются.

    По умолчанию значение отсутствует.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@XLat.Flags
$ #far:config XLat.Flags#
    Параметр "XLat.Flags" определяет поведение функции Xlat:

    Биты:
       0 - ^<wrap>Автоматическое переключение раскладки клавиатуры после перекодирования
           ^<wrap>Переключение происходит по кругу: RU->EN->RU->…
           ^<wrap>В семействе Windows NT позволяет переключить раскладку клавиатуры на следующую доступную (см. также описание бита 2).
       1 - ^<wrap>При переключении раскладки выдать звуковой сигнал.
       2 - ^<wrap>Использовать предопределённые именованные правила для "двойных" клавиш.
           ^<wrap>Также, если задано автоматическое переключение, то переключение раскладок происходит только 
по списку значений, перечисленных в ~XLat.Layouts~@XLat.Layouts@, независимо от количества установленных в системе раскладок.
           ^<wrap>Пример см. в Addons\XLat\Russian\Qwerty.farconfig (name="00000409" и name="00000419")
Такие правила возможно поменять только из ~командной строки~@CmdLine@ (параметр /import)
      16 - ^<wrap>Конвертировать всю командную строку при отсутствии выделенного блока.

    По умолчанию значение = 0x00010001 (переключить раскладку и конвертировать всю командную строку при отсутствии выделенного блока)

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@XLat.Tables
$ #far:config XLat.Tables#
    Параметры "XLat.Table*" и "XLat.Rules*" задают перекодировочные таблицы и особые правила конвертации строк.

    Перекодировочная таблица #XLat.Table1# содержит набор символов национальной кодировки.
    
    Перекодировочная таблица #XLat.Table2# содержит набор латинских символов, соответствующих символам национальной кодировки на клавиатуре (см. свою клавиатуру).

    Значение #XLat.Rules1# содержит пары правил для случая "если предыдущий символ русский". Первый символ - что меняем, второй - на что меняем. Допускается 

    Значение #XLat.Rules2# содержит пары правил для случая "если предыдущий символ латинский". Первый символ - что меняем, второй - на что меняем.

    Значение #XLat.Rules3# содержит пары правил для случая "если предыдущий символ не буква". Первый символ - что меняем, второй - на что меняем - крутим по кругу.

    По умолчанию параметры не содержат значений. Если в системе установлена русская раскладка (0x0419) и значение параметра XLat.Table1 
пусто, то Far Manager выставляет следующие умолчания:
    Table1=№АВГДЕЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЯавгдезийклмнопрстуфхцчшщъыьэяёЁБЮ
    Table2=##FDULTPBQRKVYJGHCNEA{WXIO}SMZfdultpbqrkvyjghcnea[wxio]sm'z`~~<>
    Rules1=,??&./б,ю.:^Ж:ж;;$"@@Э"
    Rules2=?,&?/.,б.ю^::Ж;ж$;@@""Э
    Rules3=^::ЖЖ^$;;жж$@""ЭЭ@@&??,,бб&/..юю/

    Изменить эти параметры можно через ~far:config~@FarConfig@

@Interface.DelHighlightSelected
$ #far:config Interface.DelHighlightSelected#
$ #far:config Interface.DelShowSelected#

Interface.DelHighlightSelected -- bool, default = true.
true -- выделяем случай, когда список удаляемых объектов отличаеся от объекта под курсором.

Interface.DelShowSelected -- int, default = 10.
При множественном удалении показываем имена удаляемых объектов. Не более чем заданное число,
приведённое к диапазону 1..высота_окна/2

Старое поведение = (false, 1)

    Изменить эти параметры можно через ~far:config~@FarConfig@

@History.Config
$ #far:config History.*#
    Данный блок параметров позволяет ограничить размеры списков и время жизни элементов следующих историй:
  
    - история ~команд~@History@ в командной строке:
      #History.CommandHistory.Count#
      #History.CommandHistory.Lifetime#

    - история строк ввода в диалогах:
      #History.DialogHistory.Count#
      #History.DialogHistory.Lifetime#
    
    - история ~посещения папок~@HistoryFolders@:
      #History.FolderHistory.Count#
      #History.FolderHistory.Lifetime#

    - история ~просмотра и редактирования~@HistoryViews@:
      #History.ViewEditHistory.Count#
      #History.ViewEditHistory.Lifetime#

    По умолчанию:
      максимальный размер списка (.Count) = 1000 элементов
      время жизни элемента (.Lifetime) = 90 дней

    Изменить эти параметры возможно через ~far:config~@FarConfig@

@Editor.F8CPs
$ #far:config Editor.F8CPs#
$ #far:config Viewer.F8CPs#
    Строка позволяющая задавать список кодовых страниц используемых при переключении
кодировки клавишей #F8# в редакторе или просмотрщике.

    Умолчательное значение - #""#, в этом случае используются только кодовые
страницы ANSI и OEM.

    Если задать строку #"-1"#, то кроме ANSI и OEM в список переключения добавляется
умолчательная кодовая страница редактора/просмотрщика (если отличается).

    В противном случае строка должна быть списком номеров кодовых страниц.
Кроме номеров можно использовать также имена - ANSI/OEM/UTF8/DEFAULT.
Дубликаты и неподдерживаемые кодовые страницы удаляются.
Пример: #"ANSI,OEM,65001"#.

    Изменение этого параметра возможно через ~far:config~@FarConfig@

@Panel.Tree.TurnOffCompletely
$ #far:config Panel.Tree.TurnOffCompletely#
    Если «true», отключает все операции работы с деревом каталогов:

  - Режим ~дерева папок~@TreePanel@ в ~меню левой и правой панелей~@LeftRightMenu@,
а также горячую клавишу включения и включения дерева папок #Ctrl+T#.

  - Команду ~поиска папки~@FindFolder@ на панелях (#Alt+F10#).

  - Операции работы с деревом каталогов в диалоге
~копирования, переноса и переименования~@CopyFiles@ (#F10# #Alt+F10# #Shift+F10#).

    Также не обновляются файлы кэша дерева каталогов (даже если они уже
существуют) при создании / удалении / переименовании каталогов.

    Значение по умолчанию: True

    Изменение этого параметра возможно только через ~far:config~@FarConfig@

@Index
$ #Индекс файла помощи#
<%INDEX%>
