m4_include(`farversion.m4')m4_dnl
.Language=Ukrainian,Ukrainian (Українська)
.Options CtrlColorChar=\
.Options CtrlStartPosChar=^<wrap>


@CodepagesSettings=CodepagesMenu
@ConfirmationsSettings=ConfirmDlg
@DescriptionsSettings=FileDiz
@Editor.WordDiv=System.WordDiv
@History.CommandHistory.Count=History.Config
@History.CommandHistory.Lifetime=History.Config
@History.DialogHistory.Count=History.Config
@History.DialogHistory.Lifetime=History.Config
@History.FolderHistory.Count=History.Config
@History.FolderHistory.Lifetime=History.Config
@History.ViewEditHistory.Count=History.Config
@History.ViewEditHistory.Lifetime=History.Config
@Interface.CompletionSettings=AutoCompleteSettings
@Interface.CursorSize1=Interface.CursorSize
@Interface.CursorSize2=Interface.CursorSize
@Interface.CursorSize3=Interface.CursorSize
@Interface.CursorSize4=Interface.CursorSize
@Interface.EditorTitleFormat=TitleFormat
@Interface.ViewerTitleFormat=TitleFormat
@InterfaceSettings=InterfSettings
@Panel.InfoSettings=InfoPanel
@Panel.Layout.DoubleGlobalColumnSeparator=PanelSettings
@Panel.Left=PanelCmdSort
@Panel.Right=PanelCmdSort
@Panel.Tree.AutoChangeFolder=TreeSettings
@Panel.Tree.MinTreeCount=TreeSettings
@ScreenSettings=InterfSettings
@System.MsHWheelDelta=System.MsWheelDelta
@System.MsHWheelDeltaEdit=System.MsWheelDelta
@System.MsHWheelDeltaView=System.MsWheelDelta
@System.MsWheelDeltaEdit=System.MsWheelDelta
@System.MsWheelDeltaHelp=System.MsWheelDelta
@System.MsWheelDeltaView=System.MsWheelDelta
@Viewer.F8CPs=Editor.F8CPs
@XLat.Rules1=XLat.Rules
@XLat.Rules2=XLat.Rules
@XLat.Rules3=XLat.Rules
@XLat.Table1=XLat.Tables
@XLat.Table2=XLat.Tables


@Contents
$^#Програма керування файлами та архівами#
$^#M4_MACRO_GET(FULLVERSION)#
$^#Copyright © 1996-2000 Eugene Roshal#
$^#Copyright © 2000-M4_MACRO_GET(COPYRIGHTYEAR) Far Group#
 ~Індекс файлу допомоги~@Index@
 ~Як користуватися допомогою~@Help@

 ~Що таке Far~@About@
 ~Ліцензія~@License@

 ~Параметри командного рядка~@CmdLine@
 ~Клавіатурні команди~@KeyRef@
 ~Підтримка модулів, що підключаються~@Plugins@
 ~Огляд можливостей модулів, що підключаються~@PluginsReviews@

 ~Панелі~@Panels@:
  ~Панель файлів~@FilePanel@
  ~Дерево папок~@TreePanel@
  ~Панель інформації~@InfoPanel@
  ~Панель швидкого перегляду~@QViewPanel@
  ~Перетягання файлів~@DragAndDrop@
  ~Конфігурація режимів перегляду панелі файлів~@PanelViewModes@
  ~Позначення файлів~@SelectFiles@

 ~Меню:~@Menus@:
  ~Меню лівої та правої панелей~@LeftRightMenu@
  ~Меню файлів~@FilesMenu@
  ~Меню команд~@CmdMenu@
  ~Меню параметрів~@OptMenu@

 ~Пошук файла~@FindFile@
 ~Історія команд~@History@
 ~Пошук папки~@FindFolder@
 ~Порівняння папок~@CompFolders@
 ~Меню користувача~@UserMenu@
 ~Меню вибору диска~@DriveDlg@

 ~Асоціації файлів~@FileAssoc@
 ~Команди операційної системи~@OSCommands@
 ~Посилання на папки~@FolderShortcuts@
 ~Групи сортування~@SortGroups@
 ~Фільтр файлової панелі~@FiltersMenu@
 ~Перемикання між екранами~@ScrSwitch@
 ~Список задач~@TaskList@
 ~Список пристроїв~@HotPlugList@

 ~Системні параметри~@SystemSettings@
 ~Конфігурація панелей~@PanelSettings@
 ~Конфігурація дерева~@TreeSettings@
 ~Конфігурація інтерфейсу~@InterfSettings@
 ~Конфігурація діалогів~@DialogSettings@
 ~Конфігурація меню~@VMenuSettings@
 ~Конфігурація командного рядка~@CmdlineSettings@

 ~Розфарбування файлів~@Highlight@
 ~Описи файлів~@FileDiz@
 ~Конфігурація програми перегляду~@ViewerSettings@
 ~Конфігурація редактора~@EditorSettings@

 ~Копіювання, перенесення, перейменування та створення зв'язків~@CopyFiles@

 ~Вбудована програма перегляду~@Viewer@
 ~Вбудований редактор~@Editor@

 ~Маски файлів~@FileMasks@
 ~Клавіатурні макрокоманди~@KeyMacro@

 ~Customizing UI elements~@CustomizingUI@


@Help
$ #Як користуватися допомогою#
 У змісті довідкової системи є посилання (вони функціонують приблизно так
же, як і гіперпосилання, знайомі кожному користувачеві Інтернету), які вказують
на розділи з більш докладною інформацією.
Головна сторінка також має "~Довідковий Індекс~@Index@", що містить всі теми,
доступні у довідковому файлі, та може допомогти знайти інформацію швидше.

 Для переміщення між посиланнями ви можете використовувати #Tab# чи #Shift+Tab#.
Натиснення Enter викличе сторінку, що відповідає вибраному посиланню. Такий же
результат можна отримати, натиснувши кнопку мишi на необхiдному посиланнi.

 Якщо текст вміщується у вікні допомоги не повністю, то з'являється смуга
прокрутки. У цьому випадку текст можна переміщувати вгору і вниз за допомогою
#клавіш керування курсором#.

 Натиснення #Alt+F1# або #BS# приводить до переходу на попередню сторінку.
#Shift+F1# викликає зміст допомоги.

 Натисніть #Shift+F2#, щоб отримати допомогу по ~зовнішніх модулях~@Plugins@.

 Для пошуку тексту у відкритому довідковому файлі натисніть #F7#.
Результати пошуку будуть відображені як посилання на знайдені теми.

 Для перемикання між повноекранним режимом відображення допомоги і
виведенням тексту у вікні можна використовувати #F5#.


@About
$ #Що таке Far#
 #Far# - це працююча в текстовому режимі програма керування файлами для
Windows, котра забезпечує обробку файлів з #довгими іменами# та має широкий набір додаткових функцій.

 #Far# є #freeware# та #open source# програмним забезпеченням, що поширюється під
переглянутою BSD ~ліцензією~@License@.

 #Far# дозволяє працювати з #архівами#. При цьому файли в архівах
обробляються аналогічно файлам у папках. Far сам перетворює
ваші команди у відповідні виклики зовнішніх архіваторів.

 #Far# також забезпечує значну кількість сервісних функцій.


@License
$ #Far: Ліцензія#
 Copyright © 1996 Eugene Roshal
 Copyright © 2000 Far Group
 All rights reserved.

 Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
 1. ^<wrap>Redistributions of source code must retain the above copyright
notice, this list of conditions and the following disclaimer.
 2. Redistributions in binary form must reproduce the above copyright
notice, this list of conditions and the following disclaimer in the
documentation and/or other materials provided with the distribution.
 3. The name of the authors may not be used to endorse or promote products
derived from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.


@CmdLine
$ #Параметри командного рядка#
 У командному рядку можуть бути використані такі параметри:

 #-e[<рядок>[:<позиція>]] <ім'я_файлу>#
 Редагування вказаного файла. Після -е можна додатково вказати рядок і позицію у рядку,
що встановлюються після запуску редактора.
 Наприклад: far -e70:2 readme.

 #-p[<шлях>]#
 Шукати "основні" плагіни у папці, вказаній у <шлях>.
 Можна вказати декілька шляхів для пошуку, розділених знаком ‘;’.

 Наприклад: far -p%USERPROFILE%\\Far\\Plugins#

 #-co#
 Примушує Far вантажити плагіни тільки з кешу. Завантаження при цьому проходить швидше,
але нові або змінені плагіни не виявляються. Є сенс застосовувати #тільки# при стабільному списку плагінів.
Після додавання, заміни чи видалення плагінів треба завантажити Far без цього параметра.
Якщо кешу немає, то і список плагінів завантажений не буде.

 Про опції -p та -co:
 - ^<wrap>якщо вказано тільки -p, Far буде загружено без плагінів;
 - ^<wrap>якщо -p вказано зі шляхом <path>, будуть загружені лише плагіни зі вказаного шляху;
 - ^<wrap>якщо вказана лише опція -co та кеш плагінів не пустий, буде загружено плагіни з кешу;
 - ^<wrap>-co буде проігноровано, якщо вказана опція -p;
 - ^<wrap>якщо -p та -co не вказані, плагіни будуть загружені з папки 'Plugins', що знаходиться там,
де і Far.exe, а також з папки 'Plugins' що знаходиться у профілі користувача
(#%APPDATA%\\Far Manager\\Profile# by default).

 #-m#
 Far не завантажуватиме макроси під час запуску.

 #-ma#
 Не виконувати макроси з опцією "Виконувати після запуску Far" при старті.

 #-s <profilepath> [<localprofilepath>]#
 Вказати шлях до конфігураційних файлів Far (опція має приоритет над значенням в ini файлі).

 #-u <username>#
 Дозволяє використовувати окремі конфігурації для різних користувачів.
 Впливає тільки на плагіни для Far Manager 1.x.
 Наприклад: far -u guest

 Far Manager встановить ~змінну середовища~@FAREnv@ "FARUSER" у значення, рівне <ім'я>.

 #-v <ім'я_файлу>#
 Перегляд вказаного файлу. Якщо у якості <filename> використано `#-#', дані будуть читатися з stdin (стандартного вхідного потоку).

 Наприклад, "dir│far -v -" виведе результат роботи команди dir.

 Якщо при використанні '-' вхідний потік пустий (наприклад, ви не вказали
команду dir у вказаному прикладі), то Far буде чекати завершення
вхідного потоку until you press Ctrl+Break.

 #-w[-]#
 Відображати інтерфейс у межах вікна консолі замість буферу, або навпаки.

 #-t шаблон_профілю#
 Розташування шаблонного файлу конфігурації (перевизначає ini-файл).

 #-title[:<заголовок>]#
 Якщо вказано <заголовок>, його буде використано для заповнення заголовку вікна Far;
якщо опція вказана без значення, заголовок вікна буде взятий з заголовка консолі.
Макрос #%Default# буде замінений на стандартний контекстно-залежний заголовок вікна Far.

 #-clearcache [profilepath [localprofilepath]]#
 Очистити кеш плагінів.

 #-export <out.farconfig> [profilepath [localprofilepath]]#
 Експорт налаштувань у файл out.farconfig.

 #-import <in.farconfig> [profilepath [localprofilepath]]#
 Імпорт налаштувань з файлу in.farconfig.

 #-ro[-]#
 Режим лише для читання або звичайний режим конфігурації (перевизначає ini-файл).

 #-set:<parameter>=<value>#
 Перевизначити параметр конфігурації, подробиці дивіться ~far:config~@FarConfig@.

 #-x#
 Відключити обробку виключних ситуацій. Дана опція призначена для розробників
і у нормальній ситуації не рекомендується.

 У командному рядку можна вказувати не більше двох шляхів до
каталогів, файлів або архівів. Перший шлях для активної панелі, другий - для пасивної:
 - ^<wrap>для каталогів та архівів Far покаже їх зміст;
 - ^<wrap>для файлів - відбудеться перехід у каталог із файлом і
    позиціонування на вказаний файл, якщо він існує;
 - ^<wrap>якщо вказано префікси (можна використовувати одночасно із звичайними шляхами)
пасивна команда буде виконана першою (пасивна панель буде тимчасово активована).
Префікси з однієї літери A-Z чи конфліктуючі з літерою диска буде проігноровано.
 Приклад: far arc:c:\\Far20.7z "lua:msgbox('Far Manager','Successfully started')"


@KeyRef
$ #Клавіатурні команди#
 ~Команди керування панелями~@PanelCmd@

 ~Командний рядок~@CmdLineCmd@

 ~Керування файлами та сервісні команди~@FuncCmd@

 ~Підтримка колеса миші~@MsWheel@

 ~Команди керування меню~@MenuCmd@

 ~Захоплювач екрана~@Grabber@

 ~Інші команди~@MiscCmd@

 ~Спеціальні команди~@SpecCmd@


@MenuCmd
$ #Команди керування меню#
 #Загальні команди меню та розкривного списку#

 #Ctrl+Alt+F#, #RAlt#
 Фільтрувати пункти меню або списку

 #Ctrl+Alt+L#
 Зафіксувати фільтр

 #Alt+Left#, #Alt+Right#, #MsWheelLeft#, #MsWheelRight#
 Scroll all items horizontally.

 #Alt+Shift+Left#, #Alt+Shift+Right#
 Scroll the selected item horizontally.

 #Ctrl+Alt+Left#, #Ctrl+Alt+Right#, #Ctrl+MsWheelLeft#, #Ctrl+MsWheelRight#
 Scroll all items horizontally by 20 characters.

 #Ctrl+Shift+Left#, #Ctrl+Shift+Right#
 Scroll the selected item horizontally by 20 characters.

 #Alt+Home#
 Align all items to the left.

 #Alt+End#
 Align all items to the right.

 #Alt+Shift+Home#
 Align the selected item to the left.

 #Alt+Shift+End#
 Align the selected item to the right.

 Дивіться також список ~макроклавіш~@KeyMacroMenuList@, доступних у меню.


@PanelCmd
$ #Команди керування панелями#
 #Загальні команди#

 Змінити активну панель                                         #Tab#
 Поміняти панелі місцями                                     #Ctrl+U#
 Перечитати вміст панелі                                     #Ctrl+R#
 Прибрати/показати інформаційну панель                       #Ctrl+L#
 Прибрати/показати ~панель швидкого перегляду~@QViewPanel@                 #Ctrl+Q#
 Прибрати/показати ~дерево папок~@TreePanel@                              #Ctrl+T#
 Прибрати/показати обидві панелі                             #Ctrl+O#
 Тимчасово прибрати обидві панелі                    #Ctrl+Alt+Shift#
 (працює до тих пір, поки утримуємо ці клавіші)
 Прибрати/показати неактивну панель                          #Ctrl+P#
 Прибрати/показати ліву панель                              #Ctrl+F1#
 Прибрати/показати праву панель                             #Ctrl+F2#
 Змінити висоту панелей                          #Ctrl+Up, Ctrl+Down#
 Змінити висоту поточної панелі       #Ctrl+Shift+Up,Ctrl+Shift+Down#
 Змінити ширину                               #Ctrl+Left, Ctrl+Right#
 (при пустому командному рядку)
 Відновити ширину панелей за замовчуванням             #Ctrl+Numpad5#
 Відновити висоту панелей за замовчуванням         #Ctrl+Alt+Numpad5#
 Сховати/Показати лінійку функціональних клавіш              #Ctrl+B#
 Перемкнути показ загального та вільного розміру       #Ctrl+Shift+S#
 у байтах (якщо можливо) або з суфіксами розміру K/M/G/T

 #Команди файлової панелі#

 ~Позначити/зняти позначення файла~@SelectFiles@        #Ins, Shift+Клавіші курсору#
                                                 #Right mouse button#
 Позначити групу                                             #Gray +#
 Зняти позначення з групи                                    #Gray -#
 Інвертувати позначення                                      #Gray *#
 Позначити файли з розширенням                        #Ctrl+<Gray +>#
 як у поточного файла
 Зняти позначення з файлів з розширенням              #Ctrl+<Gray ->#
  як у поточного файла
 Інвертувати позначення, включаючи папки              #Ctrl+<Gray *>#
 Позначити файли з ім'ям як у поточного файла          #Alt+<Gray +>#
 Зняти позначення з файлів з ім'ям                     #Alt+<Gray ->#
 як у поточного файла
 Інвертувати позначення файлiв,                        #Alt+<Gray *>#
 зняти позначення з папок
 Позначити всі файли                                 #Shift+<Gray +>#
 Зняти позначення з усіх файлiв                      #Shift+<Gray ->#
 Відновити попереднє позначення                              #Ctrl+M#

 Прокрутка довгих імен і описів                 #Alt+Left, Alt+Right#
                                                   #Alt+Home,Alt+End#

 Встановити короткий режим перегляду                    #ЛiвийCtrl+1#
 Встановити середній режим перегляду                    #ЛiвийCtrl+2#
 Встановити повний режим перегляду                      #ЛiвийCtrl+3#
 Встановити широкий режим перегляду                     #ЛiвийCtrl+4#
 Встановити детальний режим перегляду                   #ЛiвийCtrl+5#
 Встановити режим перегляду описів                      #ЛiвийCtrl+6#
 Встановити режим перегляду довгих описів               #ЛiвийCtrl+7#
 Встановити режим перегляду власників файлів            #ЛiвийCtrl+8#
 Встановити режим перегляду зв'язків файлів             #ЛiвийCtrl+9#
 Встановити альтернативний повний режим перегляду       #ЛiвийCtrl+0#

 Прибрати/показати файли з атрибутом Прихований і Системний  #Ctrl+H#
 Перемкнути виведення довгих/коротких файлів                 #Ctrl+N#

 Сховати/Показати ліву панель                               #Ctrl+F1#
 Сховати/Показати праву панель                              #Ctrl+F2#

 Сортувати файли активної панелі за iм'ям                   #Ctrl+F3#
 Сортувати файли активної панелі за розширенням             #Ctrl+F4#
 Сортувати файли активної панелі за часом модифікації       #Ctrl+F5#
 Сортувати файли активної панелі за розміром                #Ctrl+F6#
 Не сортувати файли активної панелі                         #Ctrl+F7#
 Сортувати файли активної панелі за часом створення         #Ctrl+F8#
 Сортувати файли активної панелі за часом доступу           #Ctrl+F9#
 Сортувати файли активної панелі за описами                #Ctrl+F10#
 Сортувати файли активної панелі за власниками             #Ctrl+F11#
 Вивести меню ~режимів сортування~@PanelCmdSort@                           #Ctrl+F12#
 Використати сортування за групами                        #Shift+F11#
 Показувати позначені файли першими                       #Shift+F12#

 Створити ~посилання на папку~@FolderShortcuts@                         #Ctrl+Shift+0…9#
 Перейти за посиланням на папку                      #ПравийCtrl+0…9#

 Якщо активна панель являється ~панеллю швидкого перегляду~@QViewPanel@,
~деревом папок~@TreePanel@ чи ~інформаційною панеллю~@InfoPanel@, то папка змінюється
не на активній, а на пасивній панелі.

 #Ctrl+Ins#
 Вмістити позначені імена до Буфера Обміну (при пустому командному рядку)

 #Ctrl+Shift+Ins#
 Вмістити позначені імена до Буфера Обміну (без урахування стану командного рядка)

 #Alt+Shift+Ins#
 Вмістити позначені повні імена до Буфера Обміну (без урахування стану командного рядка)

 #Ctrl+Alt+Ins#
 Вмістити справжні імена позначених файлів до Буфера Обміну (без урахування стану командного рядка)

 #Ctrl+Shift+C#
 Копіювати вибрані файли в буфер обміну.

 #Ctrl+Shift+X#
 Вирізати вибрані файли в буфер обміну.

 Файли, скопійовані або вирізані з панелей, можна вставити в інші програми, наприклад Провідник.

 Дивіться також список ~макроклавіш~@KeyMacroShellList@, доступних у панелях.

 Примітки:

 1. ^<wrap>Якщо увімкнена опція "Дозволити зворотне сортування" у діалозі
~Конфігурація панелей~@PanelSettings@, то повторне натиснення однієї і тієї ж
клавіші сортування файлів приводить до зміни напрямку
сортування зі зростаючого на убуваючий і навпаки;

 2. ^<wrap>Комбінації #Alt+Left# та #Alt+Right#, що використовуються для
прокрутки довгих імен і описів, працюють тільки з клавішами
#Left# i #Right#, розташованими не на numpad. Так відбувається тому,
що при натиснутій #Alt# клавіші керування курсором на numpad
використовуються для уведення символів через їх десяткові коди.

 3. ^<wrap>Комбінація клавіш #Ctrl+Alt+Ins# працює за наступними правилами:
    - ^<wrap>для мережних дисків - мережне (UNC) ім'я файлового об'єкта;
    - ^<wrap>для локальних дисків - повне ім'я із урахуванням ~символічних~@HardSymLink@ зв'язків.

  4. Комбінації клавіш #Alt+Shift+Ins# та #Ctrl+Alt+Ins# обробляють ім'я
     "#..#" як ім'я поточної папки.


@PanelCmdSort
$ #Режими сортування#
 Меню режимів сортування викликається по #Ctrl+F12# та застосовується до активної панелі.
Доступні такі режими сортування:

 Сортування файлів за іменем                                #Ctrl+F3#
 Сортування файлів за розширенням                           #Ctrl+F4#
 Сортування файлів за часом останнього запису               #Ctrl+F5#
 Сортування файлів за розміром                              #Ctrl+F6#
 Залишити файли несортованими                               #Ctrl+F7#
 Сортування файлів за часом створення                       #Ctrl+F8#
 Сортування файлів за часом доступу                         #Ctrl+F9#
 Сортування файлів за описом                               #Ctrl+F10#
 Сортування файлів за власником                            #Ctrl+F11#

 Клавіша #+# встановлює прямий порядок сортування.
 Клавіша #-# встановлює порядок сортування на зворотний.
 Клавіша #*# змінює порядок сортування на зворотний.

 Використовувати групи сортування                         #Shift+F11#
 Спочатку показати вибрані файли                           #Shift+F12#

 Ви можете ~додатково налаштувати~@PanelSortCriteria@ режими сортування, натиснувши #F4#.

 Дивіться також: загальні клавіатурні команди ~меню~@MenuCmd@.


@PanelSortCriteria
$ #Критерії сортування#
 Коли файли вважаються еквівалентними у вибраному режимі сортування, враховуються додаткові критерії сортування.
 Наприклад, якщо файли відсортовано за розміром та "a.txt" і "b.txt" мають однаковий розмір, "a.txt" буде першим, ніби вони відсортовані за назвою.
 У цьому меню ви можете налаштувати набір критеріїв, пов'язаних із вибраним режимом сортування.

 #Ins#
 Додати критерій до набору.

 #Del#
 Видалити обраний критерій.

 #F4#
 Змінити обраний критерій.

 #+#
 Використовувати порядок зростання.

 #-#
 Використовувати порядок спадання.

 #*#
 Змінити порядок.

 #=#
 Успадкувати порядок із відповідного режиму сортування.

 #Ctrl+Up#
 Перемістити критерій вгору.

 #Ctrl+Down#
 Перемістити критерій вниз.

 #Ctrl+R#
 Скинути набір критеріїв до стандартних.


@FastFind
$ #Швидкий пошук у панелях#
 Для позиціонування на файл можна скористатися операцією
#швидкого пошуку# за першими літерами імені. Для цього, утримуючи клавішу #Alt#
(або #Alt+Shift#), набирайте ім'я необхідного файла, доки на нього не
переміститься курсор.

 За допомогою #Ctrl+Enter# можна циклічно переміщуватися по елементах
панелі у відповідності до введеної у рядку файлової маски. #Ctrl+Shift+Enter# дозволяє
переміщуватись у зворотньому напрямку.

 Крім звичайних символів у імені файла також можна використовувати
символи ‘*’ та ‘?’.

 Вставлення тексту з буфера обміну (#Ctrl+V# або #Shift+Ins#) у
діалогове вікно швидкого пошуку триватиме доти, доки знайдено збіг.

 Під час введення тексту в поле пошуку можна використовувати функцію транслітерації.
У разі ії використання введений текст буде транслітерований і буде знайдено новий збіг,
що відповідає новому тексту. Перегляньте ~XLat.Flags~@XLat.Flags@, щоб дізнатися,
як налаштувати гарячу клавішу для транслітерації.

 Дивіться також список ~макроклавіш~@KeyMacroSearchList@, доступних у швидкому пошуку.


@CmdLineCmd
$ #Командний рядок#
 #Загальні команди#

 Символ вліво                                          #Left, Ctrl+S#
 Символ вправо                                        #Right, Ctrl+D#
 Слово вліво                                              #Ctrl+Left#
 Слово вправо                                            #Ctrl+Right#
 У початок рядка                                          #Ctrl+Home#
 У кiнець рядка                                            #Ctrl+End#
 Видалити символ                                                #Del#
 Видалити символ лiворуч                                         #BS#
 Видалити до кiнця рядки                                     #Ctrl+K#
 Видалити слово лiворуч                                     #Ctrl+BS#
 Видалити слово праворуч                                   #Ctrl+Del#
 Копiювати до Буфера Обмiну                                #Ctrl+Ins#
 Вставити з Буфера Обмiну                                 #Shift+Ins#
 Попередня команда                                           #Ctrl+E#
 Наступна команда                                            #Ctrl+X#
 Очистити командний рядок                                    #Ctrl+Y#

 #Команди вставки#

 Вставити ім'я файла з активної панелі            #Ctrl+J,Ctrl+Enter#

 У режимі ~швидкого пошуку~@FastFind@ Ctrl+Enter не вставляє ім'я файла,
а призводить до циклічного обходу по елементах файлової панелі.

 Вставити ім'я файла з пасивної панелі             #Ctrl+Shift+Enter#
 Вставити повне ім'я файла з активної панелі                 #Ctrl+F#
 Вставити повне ім'я файла з пасивної панелі                 #Ctrl+;#
 Вставити мережне (UNC) ім'я файла з активної панелі     #Ctrl+Alt+F#
 Вставити мережне (UNC) ім'я файла з пасивної панелі     #Ctrl+Alt+;#

 Вставити шлях з лівої панелі                                #Ctrl+[#
 Вставити шлях з правої панелі                               #Ctrl+]#
 Вставити мережний (UNC) шлях з лівої панелі             #Ctrl+Alt+[#
 Вставити мережний (UNC) шлях з правої панелі            #Ctrl+Alt+]#

 Вставити шлях з активної панелі                       #Ctrl+Shift+[#
 Вставити шлях з пасивної панелі                       #Ctrl+Shift+]#
 Вставити мережний (UNC) шлях з активної панелі         #Alt+Shift+[#
 Вставити мережний (UNC) шлях з пасивної панелі         #Alt+Shift+]#

 Примітки:

 1. ^<wrap>Якщо командний рядок пустий, #Ctrl+Ins# буде копіювати
імена вибраних у панелі файлів до Буфера Обміну так само,
як і #Ctrl+Shift+Ins# (див. ~Команди керування панелями~@PanelCmd@);

 2. ^<wrap>#Ctrl+End#, натиснута у кінці командного рядка, замінює його
поточний вміст командою з ~історії команд~@History@, яка починається
з уже введених літер, якщо така команда існує. Щоб перейти до
наступної такої команди, ви можете натиснути Ctrl+End повторно.

 3. ^<wrap>Більшість з описаних вище команд дійсні для усіх рядків
редагування, включаючи рядки у діалогах та вбудований редактор.

 4. ^<wrap>#Alt+Shift+Left#, #Alt+Shift+Right#, #Alt+Shift+Home# та #Alt+Shift+End#
виділяють блок у командному рядку незалежно від стану панелей.

 5. ^<wrap>Для локальних дисків комбінації клавіш, які дозволяють отримати мережне (UNC) ім'я
файлового об'єкта, отримують повне ім'я з урахуванням ~символічних~@HardSymLink@ зв'язків.


@FuncCmd
$ #Керування файлами та сервісні команди#
 Допомога                                                        #F1#

 Викликати ~меню користувача~@UserMenu@                                      #F2#

 Перегляд                               #Ctrl+Shift+F3, Numpad 5, F3#
 Якщо #NumPad 5# або #F3# натиснуті на файлі, вони викликають ~вбудовану~@Viewer@,
зовнішню або ~асоційовану~@FileAssoc@ програму перегляду,
у залежності від типу файла і ~конфігурації програми перегляду~@ViewerSettings@.
 #Ctrl+Shift+F3# завжди викликає вбудовану програму перегляду,
незалежно від файлових асоціацій.
 При натисненні будь-якої з цих клавіш на папці обчислюються і показуються
розміри вибраних папок.

 Редагування                                      #Ctrl+Shift+F4, F4#
 #F4# викликає ~вбудований~@Editor@, зовнішній або ~асоційований~@FileAssoc@
редактор, у залежності від типу файла і ~конфігурації редактора~@EditorSettings@.
 #Ctrl+Shift+F4# завжди викликає вбудований редактор, незалежно
від файлових асоціацій.
 #F4# і #Ctrl+Shift+F4# для папок викликають діалог зміни файлових ~атрибутів~@FileAttrDlg@.

 ~Копіювання~@CopyFiles@                                                      #F5#
 Копіює файли й папки. Якщо ви хочете створити папку призначення перед
копіюванням, додайте до її імені зворотну риску (\).

 ~Перейменування або перенесення~@CopyFiles@                                  #F6#
 Перейменування або перенесення файлів та папок. Якщо ви хочете створити папку
призначення перед перенесенням, додайте до її iменi зворотну риску (\).

 ~Створення нової папки~@MakeFolder@                                           #F7#

 ~Видалення~@DeleteFile@                                  #Shift+Del, Shift+F8, F8#

 ~Знищення~@DeleteFile@                                                   #Alt+Del#

 Показати горизонтальне ~меню~@Menus@                                     #F9#

 Завершити роботу з Far                                         #F10#

 Показати команди ~модулів, що підключаються~@Plugins@                     #F11#

 Змінити поточний диск у лівій панелі                        #Alt+F1#

 Змінити поточний диск у правій панелі                       #Alt+F2#

 Вбудована/зовнiшня програма перегляду                       #Alt+F3#
 Викликає у залежності від типу файла
~асоційовану програму перегляду~@FileAssoc@ чи зовнішню програму перегляду,
вказану у ~конфігурації~@ViewerSettings@, якщо за замовчуванням
використовується вбудована, або вбудовану, якщо за замовчуванням
використовується зовнішня.

 Вбудований/зовнішній редактор                               #Alt+F4#
 Викликає у залежності від типу файла ~асоційований редактор~@FileAssoc@
чи зовнішній редактор, вказаний у ~конфігурації~@EditorSettings@, якщо
за замовчуванням використовується вбудований, і вбудований, якщо за
замовчуванням використовується зовнішній.

 Друкування файлів                                           #Alt+F5#
 Для друкування виділених файлів використовується плагін "Print Manager",
якщо його встановлено, інакше використовуються внутрішні засоби.

 Створення ~посилань~@HardSymLink@ файлів та папок (тільки на NTFS)         #Alt+F6#
 Використовуючи жорсткі посилання файлів, ви можете мати кілька різних
імен файлів, які посилаються на одні й ті ж дані.

 Виконати команду ~пошуку файла~@FindFile@                               #Alt+F7#

 Показати ~історію команд~@History@                                     #Alt+F8#

 Зміна розмірів вікна Far Manager                            #Alt+F9#
 У віконному режимі перемикання проходить від нормального до максимально
допустимого розміру консольного вікна і навпаки. У повноекранному режимі
Alt+F9 перемикає екран з 25 ліній на 50 і навпаки. Докладніше див.
~Interface.AltF9~@Interface.AltF9@.

 Конфігурація параметрів ~зовнішніх модулів~@Plugins@             #Alt+Shift+F9#

 Виконати команду ~пошуку папки~@FindFolder@                              #Alt+F10#

 Показати історію ~перегляду і редагування~@HistoryViews@                   #Alt+F11#

 Показати ~історію папок~@HistoryFolders@                                     #Alt+F12#

 Додати файли до архіву                                    #Shift+F1#
 Витягнути файли з архіву                                  #Shift+F2#
 Виконати команди керування архiвом                        #Shift+F3#

 Редагувати ~новий файл~@FileOpenCreate@                                     #Shift+F4#
 При створенні нового файла використовується кодова сторінка, якa
було виставлене у останньому відкритому редакторі. Якщо редактор
відкривається уперше у поточній сесії Far, використовується
кодова сторінка за замовчуванням.

 Копіювання файла під курсором                             #Shift+F5#
 Перейменування або перенесення файла під курсором         #Shift+F6#
 Для папок: якщо вказаний шлях (абсолютний чи відносний) вказує на існуючу
папку, вихідну папку буде переміщено всередину цієї папки.
В іншому випадку папку буде перейменовано/переміщено у новий шлях.
 Наприклад, під час переміщення #c:\folder1\# у #d:\folder2\#:
 - ^<wrap>якщо #d:\folder2\# існує, вміст #c:\folder1\# буде
переміщено у#d:\folder2\folder1\#;
 - ^<wrap>інакше вміст #c:\folder1\# буде переміщено у
щойно створену #d:\folder2\#.

 ~Видалення файлу~@DeleteFile@ під курсоро                               #Shift+F8#

 Зберегти конфігурацію                                     #Shift+F9#

 Вибрати останній виконаний пункт меню                    #Shift+F10#

 Запуск, зміна папки, вхід у архів                            #Enter#
 Запуск в окремому вікні                                #Shift+Enter#
 Запуск від імені адміністратора                     #Ctrl+Alt+Enter#

 #Shift+Enter# для папки викликає Провідник с показом умісту
вибраної папки. Для того, щоб у Провіднику показати кореневу папку,
треба натиснути #Shift+Enter# на необхідному диску в меню ~вибору дисків~@DriveDlg@.
Shift+Enter на папці з іменем "#..#" відкриває у Провіднику поточну папку.

 Змінити папку на кореневу                                   #Ctrl+\\#

 Зміна папки, вхід у архів (також у SFX архів)    #Ctrl+[Shift+]PgDn#
 Якщо курсор показує на папку, то проводиться зміна поточної папки
на вказану. Якщо курсор показує на файл, то у залежності від типу файла
або виконується ~асоційована команда~@FileAssoc@, або відбувається вхід у
архів.

 Перейти до папки рівнем вище                             #Ctrl+PgUp#
 На Ctrl+PgUp у кореневій папці впливає опція "~Використовувати Ctrl+PgUp для вибору диска~@InterfSettings@".

 Створити посилання на поточну папку                 #Ctrl+Shift+0…9#

 Використати посилання на папку                      #ПравийCtrl+0…9#

 Встановити ~атрибути файлів~@FileAttrDlg@                                  #Ctrl+A#

 ~Застосувати команду~@ApplyCmd@ до позначених файлів                    #Ctrl+G#

 Додати ~описи~@FileDiz@ до позначених файлів                           #Ctrl+Z#


@DeleteFile
$ #Видалення та знищення файлів і папок#
 Наступні клавіші використовуються для видалення або знищення файлів та папок:

 #F8#
 Якщо на панелі вибрано будь-які файли чи папки, іх буде видалено. Інакше буде видалено
об'єкт під курсором.

 #Shift+F8#
 Видалити тільки об'єкт під курсором (ігноруючи вибрані об'єкти панелі).

 #Shift+Del#
 Видалити вибрані об'єкти, пропустивши кошик.

 #Alt+Del#
 Знищення файлів та папок.

 Зауваження:

 1. ^<wrap>Відповідно до ~системних параметрів~@SystemSettings@, клавіші #F8# та
#Shift+F8# переміщують або не переміщують видалені файли до кошика.
Клавіша #Shift+Del# завжди видаляє, пропускаючи кошик.

2. ^<wrap>Файл знищується шляхом попередньої заміни його даних нулями
(інше значення можна вказати в ~System.WipeSymbol~@System.WipeSymbol@),
потім усікання його розміру до нуля, потім перейменування у тимчасове ім’я
та, нарешті, видалення.


@ErrCannotExecute
$ #Помилка: неможливо виконати#
 Програма, яку ви намагаєтеся виконати, не розпізнана як внутрішня або
зовнішня команда, операбельна програма або пакетний файл.


@Grabber
$ #Копіювання тексту з екрана#
 Копіювання тексту з екрана                                 #Alt+Ins#

 Ця команда дозволяє вибрати і вмістити до Буфера Обміну будь-яку ділянку
екрана.

 Для перемикання між потоковим і блоковим режимами виділення використовуйте клавішу #Пробіл#.
 Для переміщення курсору використовуйте клавіші керування курсором або натисніть ліву кнопку миші.
 Для вибору тексту використовуйте клавіші керування курсором при натиснутій #Shift# або натиснуту ліву кнопку миші.
 Щоб розширити або зменшити виділену область, використовуйте клавіші #Alt+Shift+стрілка#.
 Для переміщення виділеної області використовуйте клавіші #Alt+стрілка#.
 #Enter#, #Ctrl+Ins#, #права кнопка миші# або #подвійне натиснення лівої кнопки миші#
копіюють вибраний текст до Буфера Обмiну, #Ctrl+<Gray +># додає його до поточного вмісту Буфера Обміну.
 #Esc# відміняє позначення і завершує операцію.
 #Ctrl+A# - вибрати весь екран.
 #Ctrl+U# - скасувати вибір блоку.
#Ctrl+Shift+Left# та #Ctrl+Shift+Right# - розширення або звуження виділення на 10 символів ліворуч або праворуч.
 #Ctrl+Shift+Up# та #Ctrl+Shift+Down# - розширення або звуження виділення на 5 рядків вгору або вниз.


@MiscCmd
$ #Загальні команди#
 #Клавіатурні макрокоманди#

 Записати ~клавіатурну макрокоманду~@KeyMacro@                         #Ctrl+<.>#

 #Меню та випадаючі списки#

 Увімкнути/вимкнути режим фільтрації               #RAlt, Ctrl+Alt+F#
 Зафіксувати фільтр                                      #Ctrl+Alt+L#

 У режимі фільтрації ви можете фільтрувати відображені елементи, вводячи текст.

 #Діалоги#

 Історія у рядках редагування діалогів           #Ctrl+Up, Ctrl+Down#

 У історії рядків редагування діалогів ви можете використовувати
Enter для копіювання поточного елемента у рядок редагування або Ins
для позначення елемента. Позначені елементи не витісняються з історії
новими елементами, так що ви можете позначити рядки, які часто
використовуються, щоб увесь час мати їх в історії.

 Очищення історії у рядках редагування діалогів                 #Del#

 Очищення поточного невідзначеного пункту історії         #Shift+Del#
 у рядках редагування діалогів

 Set the dialog focus to the first element                     #Home#

 Помістити курсор у діалогах на елемент за замовчуванням  #PgDn, End#

 The #Home# and #End# keys move the focus if it is currently not
on a control which handles these keys internally, like edit control.

 Наступні комбінації клавіш можуть бути використані в усіх рядках редагування
крім командного рядка, включаючи діалоги та ~вбудований редактор~@Editor@.

 Вставити ім'я файла під курсором у діалог              #Shift+Enter#

 Вставити у діалог ім'я файла з пасивної панелі    #Ctrl+Shift+Enter#

 #Ctrl+Enter# у діалогах викликає дію за замовчуванням (натискання на
кнопку за замовчуванням чи подібну за змістом дію).

 У діалогах, коли поточним елементом керування є контрольний
перемикач (кнопка з незалежною фіксацією чи Check Box):

 - включити (#[x]#)                                            #Gray +#
 - виключити (#[ ]#)                                           #Gray -#
 - змінити стан на невизначений (#[?]#)                        #Gray *#
   (якщо перемикач має трипозиційний стан)

 Ви можете перемістити діалог (вікно), перетягнувши його мишею або натиснувши #Ctrl+F5# і використовуючи клавіші зі стрілками.

 Натискання #лівої клавіші миші# за межами діалогу аналогічне натисканню
клавіші #Esc#.

 Натискання #правої клавіші миші# за межами діалогу аналогічне натисканню
клавіші #Enter#.

 #Миша#

 Натискання середньою клавішею миші з відповідними модифікаторами (#Ctrl#,
#Alt#, #Shift#) у ~панелях~@PanelCmd@ аналогічне натисканню клавіші #Enter#. Для
непустого ~командного рядка~@CmdLineCmd@ буде виконано його зміст.

 Far Manager також вміє обробляти ~колесо миші~@MsWheel@.


@SpecCmd
$ #Спеціальні команди#
 ~Інформація про версію~@FarAbout@
 ~Редактор конфігурації~@FarConfig@


@MsWheel
$ #Підтримка колеса миші#
 #Панелі#
 Прокрутка списку при незмінній позиції курсору на екрані.
Натискання середньої кнопки аналогічне натисканню #Enter#.

 #Редактор#
 Прокрутка тексту з постійним позиціонуванням курсору (аналогічно #Ctrl+Up#/#Ctrl+Down#).

 #Вбудована програма перегляду, система допомоги#
 Прокрутка всього тексту.

 #Допомога#
 Прокрутка всього тексту.

 #Меню#
 Прокрутка колеса аналогічна дії клавіш #Up#/#Down#.
Натискання середньої кнопки аналогічно натисканню #Enter#. Можна обирати пункти, не пересовуючи курсор.

 #Діалоги#
 У діалогах при прокрутці колеса для рядка редагування з історією і комбінованого списку розкривається список.
Всередині списку прокрутка працює так же, як для меню.

 Ви можете задати кількість рядків для прокрутки у панелях, редакторі та
у вбудованій програмі перегляду (див. ~System.MsWheelDelta~@System.MsWheelDelta@).


@Plugins
$ #Пiдтримка модулiв, що пiдключаються#
 Зовнішні DLL модулі, що підключаються (plugins) можуть бути використані
для створення нових команд Far і підтримки додаткових файлових систем.
Наприклад, робота з архівами, FTP-клiєнт, тимчасова панель і перегляд
мережі реалізовані за допомогою модулів, що емулюють файлові системи.

 Усі модулі, що підключаються зберігаються в окремих папках,
розміщених у папці 'Plugins', яка знаходиться в одній папці з
Far.exe and the 'Plugins' folder, which is in the
user profile folder (#%APPDATA%\\Far Manager\\Profile# by default).
При виявленні нового модуля Far зберігає інформацію про
нього і потім завантажує його тільки при необхідності, так що
модулі, котрі не вживаються не вимагають додаткової пам'яті. Проте,
якщо ви впевнені, що які-небудь модулі вам не потрібні, ви можете
видалити їх, щоб зберегти місце на диску.

 Модулі можуть бути викликані або з ~Меню вибору диска~@DriveDlg@, або з меню
~Команди зовнішніх модулів~@PluginCommands@, що активізується за допомогою #F11# або
відповідного пункту ~Меню команд~@CmdMenu@. #F4# в меню "Команди зовнішніх
модулів" дозволяє призначити гарячі клавіші для пунктів цього меню,
що спрощує їх подальший виклик з допомогою ~клавіатурних макрокоманд~@KeyMacro@.
Це меню доступне з файлових панелей і (тільки по F11) з вбудованої
програми перегляду і редактора. При виклику з програми перегляду і
редактора будуть показані не всі модулі, а тільки ті, які спеціально
створені для роботи в цьому режимі.

 Ви можете встановити параметри модулів, використовуючи команду
~Параметри зовнішніх модулів~@PluginsConfig@ з ~Меню параметрів~@OptMenu@.

 Операції обробки файлів типу копіювання, перенесення, видалення,
редагування або ~Пошуку файла~@FindFile@ можуть працювати з модулями,
що емулюють файлові системи, якщо ці модулі забезпечують
відповідну функціональність. Пошук з поточної папки у команді
"Пошук файла" вимагає меншої функціональності, ніж пошук по всьому
диску, так що спробуйте використати його у випадку, якщо пошук
по всьому диску працює некоректно.

 Модулі мають власні файли повідомлень та допомоги. Ви можете
отримати список доступної допомоги по модулях, натиснувши:

 #Shift+F2# - в основній допомозі Far

 #Shift+F1# - у списку плагінів (контекстно-залежна допомога).

 Якщо плагін не має файла допомоги, то контекстно-залежна підказка
викликатися не буде.

 Якщо активна панель відображає файлову систему, що підтримується
зовнішнім модулем, то команда "CD" у командному рядку може бути
використана для зміни поточної папки цiєї файлової системи. На
відміну від "CD" команда "CHDIR" завжди сприймає вказаний параметр
як ім'я реальної папки, незалежно від типу файлової панелі.

 Щоб ~налаштувати плагіни~@PluginsConfig@, натисніть #Alt+Shift+F9#.


@PluginCommands
$ #Команди плагінів#
 Це меню надає користувачеві можливість використовувати функції плагінів (інші
способи перераховані в ~"Підтримці плагінів"~@Plugins@).
Вміст меню та дії, що запускаються при виборі пунктів меню, визначаються плагінами.

 Меню можна викликати такими способами:

- ^<wrap>#F11# на панелях файлів або елемент #Plugins# у ~меню команд~@CmdMenu@, при цьому
буде показано команди, призначені для використання у файлових панелях;
 - ^<wrap>#F11# у програмі перегляду або редакторі, при цьому буде показано команди,
призначені для використання у переглядачі та редакторі відповідно.

 Кожному пункту меню команд плагіна можна призначити гарячу клавішу за допомогою #F4#, ця
можливість широко використовується в ~клавіатурних макросах~@KeyMacro@. Призначена гаряча клавіша
відображається зліва від елемента. Символ #A# у крайньому лівому стовпці меню означає, що
відповідний плагін створено для Far 1.7x і він підтримує не всі можливості, доступні у Far 3
(зокрема, символи Unicode в іменах файлів і в редакторі).

 Гарячі клавіші меню #Команди плагінів#:

 #Shift+F1#
 Довідка щодо використання вибраного пункту меню. Текст довідки
береться з HLF файлу, пов'язаного з плагіном, якому належить пункт меню.

 #F4#
 Призначити гарячу клавішу обраному пункту меню. Якщо введено #Пробіл#,
то Far обере гарячу клавішу автоматично.

 #F3#
 Показати технічну інформацію плагіна.

 #Shift+F9#
 Налаштування обраного плагіна.

 #Alt+Shift+F9#
 Відкрити меню ~"Конфігурація плагінів"~@PluginsConfig@.

 Дивіться також:

 ~Підтримка плагінів~@Plugins@.
 Загальні клавіатурні команди ~меню~@MenuCmd@.


@PluginsConfig
$ #Параметри зовнішніх модулів#
 Ви можете сконфігурувати параметри ~модулів, що пiдключаються~@Plugins@,
використовуючи команду #"Параметри зовнішніх модулів"#
із ~Меню параметрів~@OptMenu@, або натиснувши
#Alt+Shift+F9# у меню ~Змінити диск~@DriveDlg@ або у меню плагінів.

 Ви можете отримати інформацію про конкретний модуль, натиснувши
#Shift+F1# - контекстно-залежна допомога по конфігурації модуля. Якщо
плагін не має файла допомоги, то контекстно-залежна підказка
викликатися не буде.

 При викликанні контекстної підказки Far спробує показати тему з
ім'ям #Config#. Якщо такої теми у файлі допомоги плагіна немає, буде
показана основна тема допомоги по даному плагіну.

 Клавіша #F4# у списку #"Параметри зовнішніх модулів"# дозволяє
призначити гарячі клавіші для пунктів цього меню, що спрощує їх
подальший виклик за допомогою ~клавіатурних макрокоманд~@KeyMacro@. Призначена гаряча клавіша
відображається зліва від елемента. Символ #A# у крайньому лівому стовпці меню означає, що
відповідний плагін створено для Far 1.7x і він підтримує не всі можливості, доступні у Far 3
(зокрема, символи Unicode в іменах файлів і в редакторі).

 Натискання #F3# покаже деяку технічну інформацію про плагін.

 Дивіться також: загальні клавіатурні команди ~меню~@MenuCmd@.


@PluginsReviews
$ #Огляд можливостей модулів, що пiдключаються#
 Оболонка Far Manager настільки тісно сплелася зі своїми плагінами,
що говорити про неї і не говорити про плагіни просто нема сенсу. Плагіни
неймовірно розширюють можливості Far Manager, доповнюючи їх і модифікуючи.

 Не вдаючись у подробиці та персоналії, можна відзначити тільки деякі
з цих можливостей:

 * ^<wrap>підсвічування синтаксису у вихідних текстах програм.
 * робота з FTP-серверами (з підтримкою доступу через різноманітні типи проксі, автоматичним довантаженням та інше).
 * пошук і заміна символів одночасно у великій кількості файлів із застосуванням регулярних виразів.
 * засоби перейменування груп файлів із можливістю використання складних складених масок із символів підстановки та шаблонів.
 * NNTP/SMTP/POP3/IMAP4 клієнти та відправка повідомлень на пейджер.
 * робота при нестандартних розмірах текстового екрана.
 * перекодування текстів з урахуванням національних кодових таблиць.
 * маніпуляції з умістом Кошика.
 * керування пріоритетами процесів на локальному чи на мережному ПК.
 * автозавершення слів у редакторі та робота з шаблонами.
 * редагування системного реєстру Windows.
 * створення та зміна ярликів Windows.
 * різноманітні маніпуляції з файлами й текстом, які роблять комфортною роботу з FidoNet.
 * кодування і декодування файлів у форматі UUE.
 * керування програмою Winamp і модифікація коментарів MP3-файлів.
 * обробка Quake PAK файлів.
 * керування принтерами, як підключеними до ПК, так і мережними.
 * Робота з різноманітними серверами через ODBC.
 * керування службою RAS.
 * запуск зовнішніх програм (компіляторів, конверторів та ін.) при редагуванні текстів у редакторі Far.
 * відображення вмісту файлів довідки Windows (.hlp та .chm)
 * калькулятори з різними можливостями.
 * різноманітні ігри :-)
 * функції перевірки орфографії при обробці тексту в редакторі Far.
 * підготовка каталогу змінних накопичувачів та багато іншого…

 У якості джерел інформації, які можна використовувати для пошуку
конкретних плагінів, можна порекомендувати:

 - Офіціальний сайт Far Manager
   ~https://www.farmanager.com~@https://www.farmanager.com@
 - Онлайн форум
   ~https://forum.farmanager.com~@https://forum.farmanager.com@
 - Реєстрація та вирішення проблем
   ~https://bugs.farmanager.com~@https://bugs.farmanager.com@
 - сайт PlugRinG
   ~http://plugring.farmanager.com~@http://plugring.farmanager.com@
 - Free email group service
   ~https://groups.google.com/group/fardeven/~@https://groups.google.com/group/fardeven@
 - конференції USENET
   ~news:fido7.far.support~@news:fido7.far.support@
   ~news:fido7.far.development~@news:fido7.far.development@
 - конференції FidoNet
   far.support
   far.development


@Panels
$ #Панелі#
 Звичайно Far показує дві панелі (ліве і праве вікна) з рiзною
інформацією. Якщо ви хочете змінити тип інформації, що відображається
у панелі, використовуйте ~меню панелей~@LeftRightMenu@ або відповідні
~клавіатурні команди~@KeyRef@.

 Для отримання додаткової інформації про панелі прочитайте перераховані нижче теми:

 ~Панель файлів~@FilePanel@
 ~Дерево папок~@TreePanel@
 ~Панель інформації~@InfoPanel@
 ~Панель швидкого перегляду~@QViewPanel@

 ~Перетягання файлів~@DragAndDrop@
 ~Позначення файлів~@SelectFiles@
 ~Конфігурація режимів перегляду панелі файлів~@PanelViewModes@


@FilePanel
$ #Панель файлів#
 Панель файлів відображає вміст поточної папки.
Ви можете вибирати файли й папки, виконувати різні файлові й
архівні операції. Команди керування панелями описані у темі
~Список команд~@KeyRef@.

 За замовчуванням у панелі файлів використовуються такі режими перегляду:

 #Короткий#     Імена файлів виводяться у три стовпчики.

 #Середній#     Імена файлів виводяться у два стовпчики.

 #Повний#       Виводяться ім'я, розмір, дата й час файла.

 #Широкий#      Виводяться ім'я й розмір файла.

 #Детальний#    ^<wrap>Виводяться імена, розміри, упаковані розміри,
час останньої модифікації, створення, доступу та атрибути файла. Повноекранний режим.

 #Описи#        Імена й ~описи файлів~@FileDiz@

 #Довгі#        Імена, розміри й описи файлів.
 #описи#        Повноекранний режим.

 #Власники#     Імена, розміри та власники файлів.
 #файлів#

 #Зв'язки файлів#   Імена, розміри та кількість жорстких зв'язків
                  файлів.

 #Альтернативний#   Ім'я, розмір (форматований за допомогою ком)
 #повний#           і дата файла.

 Ви можете самі ~сконфігурувати режими перегляду панелі файлiв~@PanelViewModes@.

 Власники і кількість зв'язків файлів також застосовні тільки до розділів
NTFS. Деякі файлові системи можуть не підтримувати час створення й час доступу до файла.

 Якщо ви хочете змінити режим перегляду панелі, виберіть бажаний з
~меню панелей~@LeftRightMenu@. Після зміни режиму перегляду або поточного диска
тип будь-якої панелi автоматично змінюється на панель файлів.

 Для позиціонування на файл можна скористатися операцією
~швидкого пошуку~@FastFind@ по перших літерах імені.

 Дивіться також список ~макроклавіш~@KeyMacroShellList@, доступних у панелях.


@TreePanel
$ #Дерево папок#
 Панель дерева папок відображає структуру папок поточного диска у вигляді
дерева. Це дозволяє швидко змінити поточну папку, а також виконувати
операції над папками.

 Far запам'ятовує інформацію про структуру папок у файлі #tree3.far#,
розташованому у кореневій папці кожного диска. Якщо запис на диск
неможливий, то ця інформація зберігається у прихованій папці Tree.Cache,
що знаходиться у тій же папці, що й Far.exe. Файл tree3.far
не існує за замовчуванням. Його буде створено автоматично після першого
використання #Панелі дерева# або команди #Знайти папку#. Якщо цей файл існує, Far
оновлює його при змінах у структурі дерева, про які йому відомо. Якщо такі
зміни було внесено за межами Far, і Tree.far більше не актуальний, його можна
оновити, натиснувши #Ctrl+R#.

 Для позиціонування на папку можна використовувати операцію
#швидкого пошуку#. Для цього, утримуючи клавішу Alt, набирайте ім'я
необхідної папки, доки на неї не переміститься курсор. За допомогою
#Ctrl+Enter# можна переміститися на наступне ім'я, відповідне
введеному рядку.

 Клавіші #Gray +# та #Gray -# переміщують вгору та вниз по дереву до наступної гілки
на тому ж рівні.

 Перегляньте також список ~макроклавіш~@KeyMacroTreeList@, доступних у панелі дерева папок.


@InfoPanel
$ #Панель інформації#
 Панель інформації містить такі дані:

 1. ^<wrap>#мережні# імена комп'ютера й користувача (see ~Info panel settings~@InfoPanelSettings@);

 2. ^<wrap>ім'я і тип #поточного диска#, тип його файлової системи,
мережне ім'я, загальний і вільний розміри, мітка тому й серійний номер;

    ^<wrap>Far спробує визначити тип кожного з наявних приводів компакт-дисків
в системі. Розрізняються такі типи: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM,
DVD-RW та DVD-RAM. Ця функція доступна лише для користувачів з
адміністративними привілеями або всі локальним користувачам, якщо це явно вказано у
редакторі локальної політики (для цього запустіть #secpol.msc# з командного рядка
та встановіть параметр '#Local Policies/Security Options/Devices: Restrict#
#CD-ROM access to locally logged-on user only# у '#Enabled#')

    ^<wrap>Для віртуальних пристроїв (SUBST-диск) відображаються параметри основного диску.

    ^<wrap>#Ctrl+Shift+S# перемикає режим відображення розміру: float із суфіксами розміру або байти.
Це також впливає на режим відображення обсягу пам'яті, ~панель швидкого перегляду~@QViewPanel@ та статусний рядок ~панелі файлів~@FilePanel@
Поточний режим - far:config #Panel.ShowBytes# (false за замовчуванням).

 3. ^<wrap>Інформація про пам'ять
    ^<wrap>рівень завантаження #пам'яті# (100% означає, що використана вся пам'ять),
розмір встановленої фізичної пам'яті (у Vista та новіших версіях), загальний та вільний розміри фізичної
 й віртуальної пам'яті (доступної для Windows), віртуальної пам'яті та файлу підкачки;

 4. ^<wrap>файл #опису папки#
    ^<wrap>Ви можете переглянути вміст цього файла у повноекранному
режимі, натиснувши #F3# або ліву кнопку миші. Для редагування або створення
цього файла натисніть #F4# або праву кнопку миші. Ви також можете
використовувати багато команд ~вбудованої програми перегляду~@Viewer@
(пошук, вибір кодування та ін.) для перегляду файла опису.
    ^<wrap>Список можливих імен файлів опису папок може бути заданий
за допомогою команди "Файли опису папок" у ~Меню параметрів~@OptMenu@.

 5. Панель плагіна
    ^<wrap>Містить інформацію про протилежну панель плагіна, якщо вона надається плагіном.

 6. Стан живлення.
    - ^<wrap>Стан живлення змінного струму (офлайн, онлайн, невідомо);
    - ^<wrap>Відсоток батареї;
    - ^<wrap>Стан заряду (високий (більше 66%), низький (менше 33%), критичний, заряджається, немає акумулятора або невідомо);
    - ^<wrap>Час роботи батареї;
    - ^<wrap>Повний час роботи батареї (система здатна оцінити цей час лише на основі розрахунків часу роботи батареї
та відсотка батареї. Без відповідних підсистем акумулятора це значення може бути недостатньо точним, щоб бути корисним).
    ^<wrap>Стан живлення змінного струму оновлюється автоматично.
    ^<wrap>У Windows Vista та вище стан заряду оновлюється автоматично.
    ^<wrap>Розділ стану живлення можна вмикати та вимикати в ~налаштуваннях~@InfoPanelSettings@.

 Усі розділи (крім імен комп'ютера та користувача) можна приховати або показати (див. ~Режими відображення інформаційної панелі~@InfoPanelShowMode@).

 Також перегляньте список ~макроклавіш~@KeyMacroInfoList@, доступних у інформаційній панелі.


@InfoPanelShowMode
$ #Режими відображення інформаційної панелі#
 Меню режимів відображення ~інформаційної панелі~@InfoPanel@ може бути викликане за допомогою #Ctrl+F12# і впливає на
поточну активну інформаційну панель. Доступні режими відображення:

 - Інформація про диск
 - Інформація про пам'ять
 - Вміст файлу опису
 - Інформація про панель плагіна
 - Інформація про стан живлення

 Клавіша #+# показує вибраний розділ.
 Клавіша #-# приховує вибраний розділ.
 Клавіша #*# змінює видимість вибраного розділу.

 Інформацію про стан живлення можна ввімкнути в ~параметрах~@InfoPanelSettings@ інформаційної панелі.


@InfoPanelSettings
$ #Параметри інформаційної панелі#
 #Показувати стан живлення#
 Якщо ввімкнено, ~інформаційна панель~@InfoPanel@ міститиме розділ із деталями стану живлення.

 #Показувати параметри приводу компакт-дисків#
 Якщо ввімкнено, Far намагатиметься визначити тип CD-приводу.
Підтримувані типи: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW і DVD-RAM.

 #Формат імені комп'ютера#
 Може бути одним із:

 - #NetBIOS#
   ^<wrap>NetBIOS-ім'я локального комп'ютера. Якщо локальний комп'ютер є вузлом у кластері, ім'я NetBIOS віртуального сервера кластера.

 - #Ім'я хоста DNS#
   ^<wrap>Ім'я хоста DNS локального комп'ютера. Якщо локальний комп'ютер є вузлом у кластері, ім'я хоста DNS віртуального сервера кластера.

 - #Ім'я домену DNS#
   ^<wrap>Ім’я домену DNS, призначеного локальному комп'ютеру. Якщо локальний комп'ютер є вузлом у кластері, доменне ім'я DNS віртуального сервера кластера.

 - #Повне DNS ім'я#
   ^<wrap>Повне ім'я DNS, яке унікально ідентифікує локальний комп'ютер. Це ім'я є комбінацією імені хоста DNS та імені домену DNS у формі HostName.DomainName. Якщо локальний комп'ютер є вузлом у кластері, повне DNS-ім'я віртуального сервера кластера.

 - #Фізичне NetBIOS#
   ^<wrap>NetBIOS-ім'я локального комп'ютера. Якщо локальний комп'ютер є вузлом у кластері, ім'я NetBIOS локального комп’ютера, а не ім’я віртуального сервера кластера.

 - #Фізичне ім'я хоста DNS#
   ^<wrap>Ім'я хоста DNS локального комп'ютера. Якщо локальний комп'ютер є вузлом у кластері, ім'я хоста DNS локального комп'ютера, а не ім'я віртуального сервера кластера.

 - #Фізичне ім'я домену DNS#
   ^<wrap>Ім'я домену DNS, призначеного локальному комп'ютеру. Якщо локальний комп'ютер є вузлом у кластері, доменне ім'я DNS локального комп'ютера, а не ім'я віртуального сервера кластера.

 - #Фізичне повне DNS ім'я#
   ^<wrap>Повне ім'я DNS, яке унікально ідентифікує комп'ютер. Якщо локальний комп'ютер є вузлом у кластері, повне DNS-ім'я локального комп'ютера, а не ім’я віртуального сервера кластера. Повне ім'я DNS – це комбінація імені хоста DNS та імені домену DNS у формі HostName.DomainName.

 Формат виводу залежить від структури домену, групових політик і налаштувань DNS.

 #Формат імені користувача#
 Може бути одним із:

 - #Ім'я для входу#
   Логін користувача (наприклад, JeffSmith)

 - #Повне доменне ім'я#
   ^<wrap>Повне розрізняюче ім'я (наприклад, CN=Jeff Smith,OU=Users,DC=Engineering,DC=Microsoft,DC=Com).

 - #Сумісне з Sam#
   ^<wrap>Застаріле ім'я облікового запису (наприклад, Engineering\JSmith). Версія лише для домену включає зворотні косі риски (\\).

 - #Відображуване ім'я#
   ^<wrap>"Дружнє" відображуване ім'я (наприклад, Jeff Smith). Відображуване ім'я не обов'язково є визначальним відносним розрізняючим іменем (RDN).

 - #Унікальний ідентифікатор#
   ^<wrap>Рядок UUID (наприклад, {4fa050f0-f561-11cf-bdd9-00aa003a77b6}).

 - #Канонічне ім'я#
   ^<wrap>Повне канонічне ім’я (наприклад, engineering.microsoft.com/software/someone). Версія лише для домену містить косу риску (/).

 - #Основне ім'я користувача#
   ^<wrap>Основне ім’я користувача (наприклад, someone@@example.com).

 - #Основне ім'я служби#
   ^<wrap>Узагальнене основне ім'я служби (наприклад, www/www.microsoft.com@@microsoft.com).

 - #Ім'я домену DNS#
   ^<wrap>Ім’я домену DNS, після якого йде зворотна коса риска та ім’я користувача SAM.

   #Дане ім'я#

   #Прізвище#

 Формат виводу залежить від структури домену.


@QViewPanel
$ #Панель швидкого перегляду#
 Панель швидкого перегляду використовується для отримання інформації
про вибраний елемент ~панелі файлів~@FilePanel@ або ~дерева папок~@TreePanel@.

 Якщо вибраний елемент - файл, то відображається його вміст.
Чимало команд ~внутрішнього засобу перегляду~@Viewer@ може бути використано
з файлом, відображеним на панелі. Для відомих Windows типів файлів також виводиться назва типу.

 Для папок у панелі швидкого перегляду повідомляється загальний
розмір, загальний упакований розмір, кількість файлів і вкладених
папок, розмір кластера поточного диска, реальний розмір файлів,
включаючи недовикористані фрагменти кластерів.

 Для ~символічних зв'язків~@HardSymLink@ також відображається шлях до вихідних папок.

 Для папок значення загального розміру може не відповідати фактичному значенню:
 - ^<wrap>Якщо папка або її підпапки містять символічні посилання та опцію
"Сканувати символічні посилання" в діалоговому вікні ~Налаштування системи~@SystemSettings@ увімкнено.
 - ^<wrap>Якщо папка або її підпапки містять кілька жорстких посилань на той самий файл.

    ^<wrap>#Ctrl+Shift+S# перемикає режим відображення розміру: float із суфіксами розміру або байти.
Це також впливає на ~інформаційну панель~@InfoPanel@ та статусний рядок ~панелі файлів~@FilePanel@
Поточний режим - far:config #Panel.ShowBytes# (false за замовчуванням).

 Дивіться також список ~макроклавіш~@KeyMacroQViewList@, доступний на панелі швидкого перегляду.


@DragAndDrop
$ #Перетягання файлів#
 Операції #копіювання# і #перенесення# файлів можуть бути виконані
за допомогою #перетягання#. Натисніть ліву кнопку миші на вихідному файлі
або папці, перетягніть його на іншу панель і відпустіть кнопку миші.

 Якщо ви хочете обробити групу файлів або папок, позначте їх
перед перетяганням, натисніть ліву кнопку миші на вихідній панелі
і перетягніть файли на іншу панель.

 Ви можете перемикатися між копіюванням і перенесенням, натискаючи праву
кнопку миші під час перетягання. Також, для перенесення файлів
ви можете втримувати клавішу #Shift# у момент натиснення лівої кнопки миші.


@Menus
$ #Меню#
 Для активізації меню ви можете використовувати #F9# або натиснути кнопку
миші на верхньому рядку екрана.

 При активізації по клавіші #F9# автоматично вибирається меню,
яке відповідає активній панелі. При активному меню клавіша #Tab# дозволяє
перемикатися між меню лівої та правої панелей. Якщо вибрано меню "Файли",
"Команди" або "Параметри", клавіша #Tab# перемикає на меню пасивної
панелі.

 Комбінація #Shift+F10# дозволяє вибрати останній використаний пункт меню.

 Описи конкретних меню можна прочитати у таких темах:

 ~Меню лівої та правої панелей~@LeftRightMenu@
 ~Меню файлів~@FilesMenu@
 ~Меню команд~@CmdMenu@
 ~Меню параметрів~@OptMenu@

 Дивіться також список ~макроклавіш~@KeyMacroMainMenuList@, доступних у головному меню.


@LeftRightMenu
$ #Меню лівої та правої панелей#
 Меню #Ліва# та #Права# дозволяють змінити параметри лівої та правої
панелі відповідно. Це меню містить такі пункти:

 #Короткий#           Показувати файли у три стовпчики.

 #Середній#           Показувати файли у два стовпчики.

 #Повний#             Показувати ім'я, розмір, дату й час файла.

 #Широкий#            Показувати ім'я й розмір файла.

 #Детальний#          ^<wrap>Показувати ім'я, розмір, упакований розмір,
час модифікації, створення й доступу та атрибути файла. Повноекранний режим.

 #Описи#              Ім'я й ~опис~@FileDiz@ файла.

 #Довгі описи#        ^<wrap>Ім'я, розмір й опис файла. Повноекранний режим.

 #Власники файлів#    Ім'я, розмір та власник файла.

 #Зв'язки файлів#     ^<wrap>Ім'я, розмір та кількість жорстких зв'язків файлів.

 #Альтернативний#     Ім'я, розмір (форматований з використанням
 #повний#             ком) і дата файла.

 #Панель інформації#  Змінити панель на ~панель інформації~@InfoPanel@.

 #Дерево папок#       Змінити панель на ~дерево папок~@TreePanel@.

 #Швидкий перегляд#   Змінити панель на ~панель швидкого перегляду~@QViewPanel@.

 #Режими сортування#  Показати доступні режими сортування.

 #Показувати довгі#   Показувати довгі/короткі імена.
 #імена#

 #Панель Увім/Вим#    Показати/сховати панель.

 #Перечитати#         Перечитати вміст панелі.

 #Змінити диск#       Змінити поточний диск.

 Дивіться також: загальні ~меню~@MenuCmd@ команди клавіатури.


@FilesMenu
$ #Меню файлів#
 #Перегляд#             ~Перегляд файлів~@Viewer@, підрахунок розмірів папок.

 #Редагування#          ~Редагування~@Editor@ файлів.

 #Копіювання#           ~Копіювання~@CopyFiles@ файлів і папок.

 #Перенесення#          ^<wrap>~Перейменування або перенесення~@CopyFiles@ файлів і папок.

 #Посилання#            Створення ~посилань на файли~@HardSymLink@.

 #Створення папки#      ~Створення~@MakeFolder@ нової папки.

 #Видалення#            Видалення файлів і папок.

 #Знищення#             ^<wrap>Знищення файлів та папок. Перед видаленням файлу
його дані перезаписуються нулями, після чого файл усікається та перейменовується на
тимчасове ім'я.

 #Архівувати#           Додати вибрані файли до архіву.

 #Розпакувати#          Розпакувати вибрані файли з архіву.

 #Архівні команди#      Виконати команду керування архівом.

 #Атрибути файлів#      ~Змінити атрибути~@FileAttrDlg@ і час файла.

 #Застосувати команду#  ~Застосувати команду~@ApplyCmd@ до вибраних файлів.

 #Опис файлів#          Додати ~описи~@FileDiz@ до вибраних файлів.

 #Позначити групу#      ~Позначити~@SelectFiles@ задану маскою групу файлів.

 #Зняти позначення#     ~Зняти позначення~@SelectFiles@ з відповідної заданій
                        масці групи файлів.

 #Інверсія позначення#  ~Інвертувати~@SelectFiles@ поточне позначення файлів.

 #Відновити позначення# ~Відновити~@SelectFiles@ попереднє позначення після обробки
                      файлів або операції позначення групи.

 Деякі команди з цього меню також описані у темі
~Керування файлами та сервісні команди~@FuncCmd@.

 Дивіться також: загальні клавіатурні команди ~меню~@MenuCmd@.


@CmdMenu
$ #Меню команд#
 #Пошук файла#        Пошук у дереві папок файлів, що задовольняють
                    заданій масці. Ця команда описана детальніше
                    у темі ~Пошук файла~@FindFile@.

 #Історія команд#     Показати попередні команди. Ця команда
                    описана детальніше у темі ~Історія команд~@History@.

 #Відеорежим#         Вибрати кількість рядків на екрані.

 #Пошук папки#        Пошук папки у дереві папок.
                    Додаткова інформація про цю команду
                    міститься у темі ~Пошук папки~@FindFolder@.

 #Історія перегляду#  Показати ~історію перегляду~@HistoryViews@ і редагування
                    файлів.

 #Історія папок#      Показати ~історію зміни папок~@HistoryFolders@.

                    Елементи історії перегляду і історії зміни
                    папок після вибору пересуваються у кінець
                    списку. Ви можете використати Shift+Enter,
                    щоб вибрати елемент без зміни його позиції.

 #Поміняти панелі#    Поміняти ліву і праву панелі місцями.

 #Панелі Увім/Вим#    Показати/сховати обидві панелі.

 #Порівняння папок#   Порівняти вміст папок.
                    Додаткова інформація про цю команду
                    міститься у темі ~Порівняння папок~@CompFolders@.

 #Меню користувача#   Дозволяє редагувати головне або місцеве
                    ~меню користувача~@UserMenu@. Для вставки пункту
                    використовується Ins, для видалення - #Del#,
                    для редагування - #F4#.

 #Асоціації файлів#   Показує список ~асоціацій файлів~@FileAssoc@.
                    Для вставки нової асоціації може
                    використовуватися Ins, для видалення - #Del#,
                    для редагування - #F4#.

 #Посилання на папки# Показує поточні ~посилання на папки~@FolderShortcuts@.

 #Групи сортування#   Дозволяє редагувати ~групи сортування~@SortGroups@,
                    які задаються користувачем.

 #Фільтр панелі#      Дозволяє керувати вмістом панелі файлів.
 #файлів#             Додаткова інформація про цю команду
                    міститься у темі ~Фільтр панелі файлів~@FiltersMenu@.

 #Команди#            Показує список доступних
 #зовнішніх модулів#  ~модулів, що підключаються~@Plugins@.

 #Список екранів#     Показує ~список відкритих екранів~@ScrSwitch@.

 #Список задач#       Показує ~список активних задач~@TaskList@.

 #Список Hotplug-#    Показує ~список пристроїв гарячого підключення~@HotPlugList@.
 #пристроїв#

 Дивіться також: загальні клавіатурні команди ~меню~@MenuCmd@.


@OptMenu
$ #Меню параметрів#
 #Системні параметри#      Викликає ~діалог системних параметрів~@SystemSettings@.

 #Конфігурація панелей#    Викликає ~діалог конфігурації панелей~@PanelSettings@.

 #Налаштування дерева#     Викликає ~діалог конфігурації дерева папок~@TreeSettings@.
 #папок#                   Available only if ~Panel.Tree.TurnOffCompletely~@Panel.Tree.TurnOffCompletely@
                       parameter in ~far:config~@FarConfig@ is set to “false.”

 #Конфігурація інтерфейсу# Викликає ~діалог конфігурації iнтерфейсу~@InterfSettings@.

 #Мови#                    Вибір основної мови і мови допомоги.
                         Використайте команду "Зберегти параметри",
                         щоб зберегти вибрані мови.
                         You can ~customize UI elements~@CustomizingUI@ to you needs and taste.

 #Параметри#               Конфігурація параметрів ~зовнішніх модулів~@PluginsConfig@,
 #зовнішніх модулів#       що підключаються.

 #Plugin manager#        Shows ~Plugin manager settings~@PluginsManagerSettings@ dialog.
 #settings#

 #Dialog settings#       Shows ~Dialog settings~@DialogSettings@ dialog.

 #Menu settings#         Shows ~Menu settings~@VMenuSettings@ dialog.

 #Command line settings# Shows ~Command line settings~@CmdlineSettings@ dialog.

 #AutoComplete settings# Shows ~AutoComplete settings~@AutoCompleteSettings@ dialog.

 #InfoPanel settings#    Shows ~InfoPanel settings~@InfoPanelSettings@ dialog.

 #Groups of file masks#  Shows ~Groups of file masks~@MaskGroupsSettings@ dialog.

 #Підтвердження#           Увімкнення або вимкнення ~підтверджень~@ConfirmDlg@
                         для деяких операцій.

 #Режими панелі#           ~Конфігурація режимів перегляду~@PanelViewModes@ панелі
 #файлів#                  файлів.

 #Описи файлів#            Режими оновлення й імена ~описів файлів~@FileDiz@.

 #Файли опису#             ~Конфігурація файлів опису папок~@FolderDiz@.
 #папок#

 #Конфігурація програми#   ~Конфігурація зовн. програми перегляду~@ViewerSettings@.
 #перегляду#

 #Конфігурація редактора#  ~Конфігурація зовн. і вбудов. редактора~@EditorSettings@.

 #Кодові сторінки#         Показує меню ~Кодові сторінки~@CodePagesMenu@.

 #Кольори#                 Shows the ~Color groups~@ColorGroups@ menu.

 #Розфарбування файлів#    Редагування ~розфарбування файлів~@Highlight@.

 #Зберегти параметри#      Збереження поточної конфігурації, кольорів
                           та зовнішнього вигляду екрана.

 Дивіться також: загальні клавіатурні команди ~меню~@MenuCmd@.


@ConfirmDlg
$ #Підтвердження#
 У діалозі #Підтвердження# ви можете ввімкнути або вимкнути
підтвердження для наступних операцій:

 - ^<wrap>перезапис файлів призначення під час копіювання файлів;
 - перезапис файлів призначення під час перенесення файлів;
 - перезапис та видалення файлів з атрібутом "тільки читання";
 - ~перетягання~@DragAndDrop@ файлів;
 - видалення файлiв;
 - видалення непорожніх папок;
 - переривання операцій (натиснули клавішу Esc);
 - ~відключення мережного пристрою~@DisconnectDrive@ із меню дисків;
 - видалення SUBST-дисків з меню дисків;
 - відключення віртуальних дисків з меню дисків;
 - видалення USB-накопичувачів з меню дисків;
 - ~повторне відкриття~@EditorReload@ файла у редакторі;
 - очищення списку історій редагування/перегляду, переходів та виконаних команд;
 - вихiд із Far.


@PluginsManagerSettings
$ #Налаштування менеджера плагінів#
 #Підтримка OEM плагінів#
 Контролює підтримку старих неюнікодних плагінів для Far Manager 1.x.

 #Сканувати символічні посилання#
 Шукати плагіни в ~символічних посиланнях~@HardSymLink@ так само, як і в в звичайних каталогах.

 #Обробка файла#

 #Відображати пункт стандартної ассоціації#

 #Навіть якщо знайдено лише один плагін#

 #Результати пошуку (SetFindList)#

 #Обробка префікса#


@MaskGroupsSettings
$ #Групи масок файлів#
 Довільне число ~масок файлів~@FileMasks@ може бути об'єднано у іменовану групу.

 Надалі ім'я групи в кутових дужках (тобто #<#name#>#) може використовуватися усюди, де можуть використовуватися маски.

 Групи можуть містити інші групи.

 Наприклад, група #<arc># містить маски "*.rar,*.zip,*.[zj],*.[bg7]z,*.[bg]zip,*.tar".
Щоб ~підсвітити~@Highlight@ всі архіви, окрім "*.rar", можна використати #<arc>|*.rar#.

 Клавіши керування:

 #Ctrl+R#      - ^<wrap>відновити групи за замовчуванням ("arc", "temp" та "exec").

 #Ins#         - ^<wrap>додати групу

 #Del#         - ^<wrap>видалити поточну групу

 #Enter#/#F4#  - ^<wrap>редагувати поточну групу

 #F7#          - ^<wrap>знайти всі групи, що містять вказану маску

 Дивіться також: ~Меню параметрів~@OptMenu@ та ~команди керування меню~@MenuCmd@.


@ChoosePluginMenu
$ #Меню вибору плагіна#
 Дозволяє вибрати плагін обробки, якщо хост-файл (наприклад, архів)
може оброблятися кількома плагінами.

 Дивіться також: ~Команди керування меню~@MenuCmd@.


@MakeFolder
$ #Створення папки#
 Ця функція служить для створення папок. Ви можете використовувати
у рядку уведення змінні оточення, котрі перед створенням папки
перетворюються у значення, яке у них міститься. Також існує можливість
створювати кілька вкладених папок за один раз: для цього виділіть
імена папок одне від одного символом "\\". Наприклад:

 #%USERDOMAIN%\\%USERNAME%\\Папка3#

 Опція "#Тип посилання#" дозволяє вибрати ~тип~@HardSymLink@ посилання
("#з'єднання каталогу#" або "#символне посилання#"). Якщо вибрано, поле #Ціль#
має містити шлях до цільового каталогу.

 Якщо увімкнена опція "#Обробляти кілька імен папок#", то
можна створювати кілька папок за один раз. У цьому випадку імена папок
мають бути відокремлені символом-відокремлювачем "#;#" або "#,#". Якщо
ця опція увімкнена й ім'я папки місить у собі символ "#;#" (або "#,#"),
то воно повинне бути взяте у лапки. Наприклад, якщо буде введено
#C:\\Foo1;"E:\\foo,2;";D:\\foo3#, то будуть створені папки з іменами:
"#C:\\Foo1#", "#E:\\foo,2;#" та "#D:\\foo3#".


@FindFile
$ #Пошук файла#
 Ця команда призначена для пошуку одного або декількох
файлів і папок у дереві папок, у відповідності до однієї або декількох
відокремлених комами чи крапкою з комою ~масок~@FileMasks@. Також вона
може бути використана з файловими системами, що підтримуються за допомогою
~зовнішніх модулів~@Plugins@.

 Додатково може бути вказаний текст, який повинен міститися
в файлах, що розшукуються.  У цьому випадку параметр  #Враховувати регістр#
може бути використаний для проведення пошуку тексту з урахуванням регістру.

 Параметр #Тільки цілі слова# дозволить шукати тільки текст, який
відділений від іншого тексту пробілом, знаком табуляції, повернення каретки,
переводу рядка або стандартними відокремлювачами, котрі за замовчуванням
такі: #!%^&*()+|{}:"<>?`-=\[];',./#.

 #Fuzzy search# is diacritical insensitive, treats ligatures equivalent
to their corresponding multicharacter sequences and fancy numerals
to corresponding number characters, and ignores some other minor
differences.

 Обравши опцію #Шукати 16-ковий код#, ви можете шукати файли, що містять
шістнадцяткову послідовність вказаних байтів. У цьому випадку параметри
#Враховувати регістр#, #Лише цілі слова#, #Використовуючи кодову сторінку# та #Шукати папки#
вимкнено та їх значення не впливають на процес пошуку.

 #Які не містять# дозволяє знаходити файли, що #не# містять вказаний текст або код.

 Розкривний список #Використовуючи кодову сторінку# дозволяє вибрати
конкретну кодову сторінку, яку слід використовувати для пошуку тексту.
Якщо вибраний пункт #Усі кодові сторінки#, то Far буде
використовувати всі стандартні кодові сторінки (ANSI, OEM, UTF-8,
UTF-16, UTF-16 BE), а також #Обрані# кодові сторінки (список #Обраних#
кодових сторінок можна вказати в меню ~Кодові сторінки~@CodepagesMenu@
у параметрах, редакторі або переглядачі). Щоб шукати за допомогою спеціального набору кодових сторінок,
виберіть потрібні кодові сторінки у розкривному списку за допомогою клавіш #Ins# або #Пробіл#,
потім виберіть пункт меню #Позначені кодові сторінки#.

 Для пошуку файлів і в архівах треба встановити опцію #Шукати в архівах#.
В той же час, вона суттєво уповільнює виконання операції і не дозволяє
виконувати пошук у вкладених архівах.

 Параметр #Шукати папки# дозволяє включати до списку пошуку папки,
які співпадають з маскою пошуку. При цьому лічильник знайдених файлів
враховує також і знайдені папки.

 Параметр #Пошук у символьних посиланнях# дозволяє шукати файли в
~символічних посиланнях~@HardSymLink@ разом зі звичайними вкладеними папками.

 #Пошук в альтернативних потоках# - окрім основного потоку даних
(який є вмістом самого файлу), дозволяє шукати альтернативні іменовані потоки даних,
що підтримуються деякими файловими системами (наприклад, #NTFS#).

 Пошук може виконуватися:
 - ^<wrap>на всіх дисках, крім змінних;
 - на всіх дисках, крім змінних і мережних;
 - у всіх папках, вказаних у змінній середовища %PATH% (не включаючи вкладені папки);
 - у всіх папках, починаючи з кореневої, при цьому можна вибрати диск пошуку;
 - починаючи з поточної папки;
 - тільки у поточній папці;
 - у відзначених папках.

 Параметри пошуку зберігаються у конфігурації.

 Check the #Use filter# checkbox to search for files according to user
defined conditions. Press the #Filter# button to open the ~filters menu~@FiltersMenu@.

 The #Advanced# button invokes the ~find file advanced options~@FindFileAdvanced@
dialog that can be used to specify extended set of search properties.


@FindFileAdvanced
$ #Find file advanced options#
 #Search only in the first# - The string entered in the #Containing text#
(or #Containing hex#) field can be searched for not only in the whole
file, but also within the specified range at the beginning of the file.
If the specified value is less than the file size, the rest of the file
is ignored even if the searched for sequence exists there.

 The following file size suffixes can be used:
 - #B# for bytes (no suffix also means bytes);
 - #K# for kilobytes;
 - #M# for megabytes;
 - #G# for gigabytes;
 - #T# for terabytes;
 - #P# for petabytes;
 - #E# for exabytes.

 #Column types# - Allows to specify search results output format.
Column types are encoded with one or more characters delimited with commas.
The following column types are supported:

 S[C,T,F,E] - ^<wrap>file size
 P[C,T,F,E] - allocation file size
 G[C,T,F,E] - size of alternate file streams, where:
              C - ^<wrap>format file size;
              T - use 1000 instead of 1024 as the divisor;
              F - show size as a decimal fraction using the most appropriate unit, e.g. 0.97 K, 1.44 M, 3.5 G;
              E - compact mode, no space before the file size suffix (e.g 0.97K).

 D          - file last write date
 T          - file last write time

 DM[B,M]    - file last write date and time
 DC[B,M]    - file creation date and time
 DA[B,M]    - file last access date and time
 DE[B,M]    - file change date and time, where:
              B - brief (Unix style) file time format;
              M - use text month names.

 A          - file attributes
 Z          - file description

 O[L]       - file owner, where:
              L - show domain name.

 LN         - number of hard links

 F          - number of alternate streams

 File attributes are denoted as follows:

 #N# - Attributes not set
 #R# - Read only
 #H# - Hidden
 #S# - System
 #D# - Directory
 #A# - Archive
 #T# - Temporary
 #$# - Sparse
 #L# - Reparse point
 #C# - Compressed
 #O# - Offline
 #I# - Not content indexed
 #E# - Encrypted
 #V# - Integrity stream
 #?# - Virtual
 #X# - No scrub data
 #P# - Pinned
 #U# - Unpinned

 #Column widths# - allows to change column widths in the search results
output. If the width equals 0, the default value is used.

 To use 12-hour time format, add one to the standard width of
the file time column or file date and time column. Increase the width
of these columns even more to show seconds and milliseconds.

 To display the year in 4-digit format, add two to the width of
the file date column.

 Unlike the panel modes, the search results can have only one column.
File name is always displayed and added automatically as the last column.

 Adding columns for the links and alternate streams information
(G, LN, and F) increases search time.

 To display only file names without additional attributes in the search
results, leave the “Column types” field empty.

 Default field values are:
 “Column types”  - D,S,A
 “Column widths” - 14,13,0


@FindFileResult
$ #Find file: control keys#
 У час або після завершення ~пошуку~@FindFile@ ви можете використати
клавіші керування курсором для пересування по списку файлів
і кнопки для виконання необхідних дій.

 У час або після завершення пошуку доступні такі кнопки:

 #Новий пошук#   Почати нову операцію пошуку.

 #Перейти#       Перервати пошук, змінити поточну папку і помістити
               курсор на вибраний файл.

 #Дивитися#      Перегляд вибраного файла. Якщо пошук не завершений,
               він буде відновлений після закінчення перегляду.

 #Панель#        Створити тимчасову панель і заповнити її знайденими
               файлами.

 #Стоп#          Перервати пошук. Доступна під час пошуку.

 #Скасувати#    Закрити діалог пошуку.

 У час або після завершення пошуку можна переглядати і редагувати знайдені файли.

 Перегляд                      #F3, Alt+F3, Numpad5, Ctrl+Shift+F3#

 #F3#, #Alt+F3# or #Numpad5# invokes ~internal~@Viewer@, external or ~associated ~@FileAssoc@ viewer,
depending on file type and ~Viewer settings~@ViewerSettings@.
#Ctrl+Shift+F3# always invokes internal viewer regardless of file associations.

 Редагування                             #F4, Alt+F4, Ctrl+Shift+F4#

 #F4# or #Alt+F4# invokes ~internal~@Editor@, external or ~associated~@FileAssoc@ editor,
depending on file type and ~Editor settings~@EditorSettings@.
#Ctrl+Shift+F4# always invokes internal editor regardless of file associations.

 Редагування і перегляд також підтримуються для
файлових систем модулів, що підключаються. Зауважте, що збереження
змін у редакторі по клавіші #F2# для файлових систем модулів, що
підключаються буде викликати операцію #Зберегти у# замість звичного
#Зберегти#.


@FindFolder
$ #Пошук папки#
 Ця команда призначена для швидкого пошуку потрібної папки у дереві папок.

 Для вибору папки ви можете використовувати клавіші керування
курсором або набрати декілька початкових символів імені папки.

 Натисніть #Enter# для переходу до вибраної папки.

 #Ctrl+R# та #F2# дозволяють перечитати дерево папок.

 #Gray +# and #Gray -# should move up and down the tree to the next branch
on the same level.

 #F5# allows to maximize the window, pressing #F5# again will restore the
window to the previous size.

 By pressing #Ctrl+Enter#, you can cycle through the folders matching the
part of the filename that you have already entered. #Ctrl+Shift+Enter# allows
to cycle backwards.

 See also the list of ~macro keys~@KeyMacroFindFolderList@, available in the find folder dialog.


@Filter
$ #Filter#
 Operations filter is used to process certain file groups according to
rules specified by the user, if those rules are met by some file it
will be processed by a corresponding operation. A filter can have several
rule sets.

 The filter dialog consists of the following elements:

 #Filter name#
 A title that will be shown in the filters menu. This field can be empty.

 #Mask#
 One or several ~file masks~@FileMasks@.
 Filter conditions are met if file mask analysis is on and its name matches any of the given file
masks. If mask analysis is off, file name is ignored.

 #Size#
 Minimum and maximum files size. The following file size suffixes can be used:
 - #B# for bytes (no suffix also means bytes);
 - #K# for kilobytes;
 - #M# for megabytes;
 - #G# for gigabytes;
 - #T# for terabytes;
 - #P# for petabytes;
 - #E# for exabytes.

 Filter conditions are met if file size analysis is on, and it is inside the given range.
If nothing is specified (empty line) for one or both range boundaries then file size for that
boundary is not limited.

 Example:
 >= 1K - select files greater than or equal to 1 kilobyte
 <= 1M - to less than or equal to 1 megabyte

 #Date/time#
 Starting and ending file date/time.
You can specify the date/time of last file #write#, file #creation#, last #access# and #change#.
 #Current# allows to fill the date/time fields with the current date/time after which you
can change only the needed part of the date/time fields, for example only the month or minutes.
 #Blank# will clear the date/time fields.
 Filter conditions are met if file date/time analysis is on and its date/time is in the
given range and corresponds to the given type. If one or both of the date/time limit
fields are empty then the date/time for that type is not limited.

 Example:
 <= 31.01.2010 - select files up to 31 numbers
 >= 01.01.2010 - but after Jan. 1, 2010

 Option #Relative# allows you to switch to work with the date in relative time.
The logic at work this option is similar to arithmetic with negative numbers.

 Example:
 <= 0  - select files in the period from the "Today"
 >= 30 - and 30-days ago, including

 #Attributes#
 Inclusion and exclusion attributes.

 Filter conditions are met if file attributes
analysis is on and it has all of the inclusion
attributes and none of the exclusion attributes:

 #[x]# - ^<wrap>inclusion attribute - the file must have this attribute.
 #[ ]# - ^<wrap>exclusion attribute - the file must not have this attribute.
 #[?]# - ^<wrap>ignore this attribute.

 The #Compressed#, #Encrypted#, #Not indexed#, #Sparse#, #Temporary# and #Offline# attributes
are used only on disks with the NTFS file system.
The #Integrity stream# and #No scrub data# attributes are supported only on ReFS volumes starting from Windows Server 2012.

 #Has more than one hardlink#
 Used only on disks with NTFS file system. Condition evaluates to true,
if piece of data, which current file is pointing, is also pointed at least by one another file.
 #Warning#: Enabling of this option can cause a significant slowdown.

 To quickly disable one or several conditions, uncheck the corresponding
checkboxes. The #Reset# button will clear all of the filter conditions.


@History
$ #Історія команд#
 Історія команд показує список виконаних раніше команд. Крім
клавіш керування курсором доступні такі клавіші:

 Повторно виконати команду                                     #Enter#

 Повторно виконати команду в окремому вікні              #Shift+Enter#

 Re-execute a command as administrator                #Ctrl+Alt+Enter#

 Помістити команду у командний рядок                      #Ctrl+Enter#

 Очистити історію команд                                         #Del#

 Lock/unlock the current history item                            #Ins#

 Delete the current history item                           #Shift+Del#

 Копіювати вміст поточної позиції історії                     #Ctrl+C#
 до Буфера Обміну не закриваючи списку                  або #Ctrl+Ins#

 Show additional information                                      #F3#

 Для переходу до попередньої або наступної команди безпосередньо
з командного рядка, можна використовувати клавіші #Ctrl+E# або #Ctrl+X#
вiдповiдно.

 Для збереження історії команд після виходу, використовуйте
відповідну опцію з ~діалогу системних параметрів~@SystemSettings@.

 Locked items will not be deleted when clearing the history.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@HistoryViews
$ #Історія перегляду і редагування#
 Історія перегляду і редагування файлів показує список
переглянутих або редагованих раніше файлів. Крім клавіш керування
курсором доступні такі клавіші:

 Повторно відкрити файл для перегляду або редагування          #Enter#

 Помістити ім'я файла у командний рядок                   #Ctrl+Enter#

 Очистити список історії                                         #Del#

 Delete the current history item                           #Shift+Del#

 Lock/unlock the current history item                            #Ins#

 Refresh list and remove non-existing entries                 #Ctrl+R#

 Копіювати вміст поточної позиції історії                     #Ctrl+C#
 до Буфера Обміну не закриваючи списку                  або #Ctrl+Ins#

 Відкрити файл у ~редакторі~@Editor@                                        #F4#

 Відкрити файл у ~програмі перегляду~@Viewer@                   #F3 або #Numpad 5#

 Елементи історії перегляду і редагування після вибору пересуваються
у кінець списку. Ви можете використати Shift+Enter, щоб вибрати елемент
без зміни його позиції.

 Для збереження історії перегляду і редагування файлів після
виходу, використовуйте відповідну опцію з діалогу ~системних параметрів~@SystemSettings@.

 Примітки:

 1. ^<wrap>List refresh operation (Ctrl+R) can take a considerable amount
of time if a file was located on a currently unavailable remote resource.
 2. ^<wrap>Locked items will not be deleted when clearing or refreshing the history.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@HistoryFolders
$ #Історія зміни папок#
 Історія зміни папок показує список папок які відвідувалися раніше.
Крім клавіш керування курсором доступні такі клавіші:

 Перейти до вказаної папки                                     #Enter#

 Open the selected folder in the passive panel      #Ctrl+Shift+Enter#

 Помістити ім'я папки у командний рядок                   #Ctrl+Enter#

 Очистити список історії                                         #Del#

 Delete the current history item                           #Shift+Del#

 Lock/unlock the current history item                            #Ins#

 Refresh list and remove non-existing entries                 #Ctrl+R#

 Копіювати вміст поточної позиції історії                     #Ctrl+C#
 до Буфера Обміну не закриваючи списку                  або #Ctrl+Ins#

 Елементи історії зміни папок після вибору пересуваються у кінець
списку. Ви можете використати #Shift+Enter#, щоб вибрати елемент без
зміни його позиції.

 Для збереження історії зміни папок після виходу, використовуйте
відповідну опцію з діалогу ~системних параметрів~@SystemSettings@.

 Примітки:

 1. ^<wrap>List refresh operation (Ctrl+R) can take a considerable amount
of time if a folder was located on a currently unavailable remote resource.
 2. ^<wrap>Locked items will not be deleted when clearing or refreshing the history.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@TaskList
$ #Список задач#
 Список задач показує активні на даний момент задачі.
Кожний рядок списку містить заголовок вікна задачі.

 Із списку задач можна перемкнутися на вікно задачі або видалити
задачу, використовуючи клавішу #Del#. Будьте обережні з видаленням
задач. Ця операція виконується негайно і будь-яка не збережена
інформація даної задачі буде втрачена. Тому видалення задач повинне
використовуватися тільки при необхідності, наприклад, якщо програма
перестала відповідати на запити користувача.

 Список задач може бути викликаний або з ~Меню команд~@CmdMenu@,
або використовуючи #Ctrl+W#. У останньому випадку список задач також може
бути викликаний з програми перегляду або редактора.

 #Ctrl+R# дозволяє оновити список задач.

 #F2# Switch between displaying of window caption and path to executable.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@HotPlugList
$ #Hotplug devices list#
 Hotplug devices list displays PC Card boards and other analogue devices
which are installed and work in the computer.

 To remove a device you need to select it in the list and press the #Del#
key. After that Windows will prepare the device for safe removal and a
notification will be displayed when it is safe to remove the device.

 #Ctrl+R# allows to refresh the list of connected devices.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@CompFolders
$ #Порівняння папок#
 Команду порівняння папок можна виконувати, тільки коли обидві панелі
на екрані є ~панелями файлів~@FilePanel@. Вона порівнює
вміст папок, що відображаються у цих панелях.  Файли, які присутні
тільки в одній панелі, або файли, чия дата модифікації більш свіжа,
ніж у файлів з тим же ім'ям у іншій панелі, стають відзначеними.

 Вкладені папки не порівнюються. Для порівняння файлів використовується
їх ім'я, дата й час, але не вміст.


@UserMenu
$ #Меню користувача#
 Меню користувача призначене для спрощення виконання операцій,
що часто використовуються. Воно містить задані користувачем команди
й послідовності команд, які можуть бути виконані
з використанням цього меню. Меню користувача може включати
вкладені меню. Спеціальні ~метасимволи~@MetaSymbols@ підтримуються
й у командах, і у заголовках команд меню. Зверніть увагу, що символ
!?<title>?<init>! може бути використаний для введення додаткових
параметрів безпосередньо перед виконанням команди.

 Для редагування або створення головного або місцевого меню
користувача застосовується команда #Меню користувача#
з ~Меню команд~@CmdMenu@. Головне меню користувача може бути
тільки одне. Головне меню викликається у тому випадку, коли для поточної
папки вiдсутнiй мiсцеве меню. Мiсцеве меню може бути розташоване
в будь-якiй папцi. Ви можете у любий момент перемкнутися між місцевим
меню та головним меню за допомогою клавіш #Shift+F2#. Також ви можете викликати
місцеве меню з батьківської папки за допомогою клавіші #BkSpace#.

 Ви можете додати до меню користувача роздільник. Для
цього потрібно додати новий пункт меню (команду), у якому у
якості "Гарячої клавіші" вказати "-" (мінус), а поле "Мітка" залишити
пустим. Видалити такий роздільник можна тільки через #Alt+F4#.

 User menu items can be moved with #Ctrl+Up# or #Ctrl+Down# key combinations.

 Для виконання команди з меню користувача треба вибрати її
за допомогою клавіш керування курсором і натиснути #Enter#. Також можна
використати призначену для даного пункту меню #гарячу клавішу#.

 Ви можете видалити вкладене меню або пункт меню, використовуючи
клавішу #Del#, вставити нове вкладене меню або пункт меню
за допомогою #Ins# і редагувати існуюче вкладене меню
або пункт меню за допомогою #F4#. Натисніть #Alt+F4# для редагування
меню у вигляді текстового файла.

 У якості гарячих клавіш для звернення до пунктів меню можуть
використовуватися цифри, літери і функціональні клавіші (#F1#…#F24#).
Якщо використані #F1# і #F4#, їх первинні функції втрачаються.
У цьому випадку для редагування меню може застосовуватися Shift+F4.

 При редагуванні або створенні пункту меню треба ввести гарячу
клавішу для швидкого доступу до цього пункту, заголовок пункту,
який буде відображатися в меню і послідовність команд
для виконання у разі вибору даного пункту меню.

 При редагуванні або створенні вкладеного меню досить
ввести гарячу клавішу і заголовок вкладеного меню.

 Мiсцеві меню зберігаються у текстових файлах #FarMenu.Ini#:
 - ^<wrap>Головне меню за замовчуванням зберігається у у папці Far Manager.
If global user menu file exists it will override the user specific menu.
 - User specific user menu is located in the user profile.
 - Local user menu is located in the current folder.

 To close the menu even if submenus are open use #Shift+F10#.

 See also:

 The list of ~macro keys~@KeyMacroUserMenuList@, available in the user menu.
 Common ~menu~@MenuCmd@ keyboard commands.


@FileAssoc
$ #Асоціації файлів#
 Far Manager підтримує асоціації файлів, котрі дозволяють задавати
різноманітні дії на запуск, редагування та перегляд файлів,
заданих ~маскою~@FileMasks@.

 Ви можете додати нові асоціації за допомогою команди
#Асоціації файлів# у ~Меню команд~@CmdMenu@.

 Ви можете задати декілька асоціацій для одного типу файлів
і вибирати бажану асоціацію з меню.

 У списку асоціацій доступні такі дії:

 #Ins#        - ~додати~@FileAssocModify@ нову асоціацію

 #F4#         - ~змінити~@FileAssocModify@ настройки поточної асоціації

 #Del#        - видалити поточну асоціацію

 #Ctrl+Up#    - move association up

 #Ctrl+Down#  - move association down

 See also: common ~menu~@MenuCmd@ keyboard commands.


@FileAssocModify
$ #Редагування асоціацій файлів#
 Far дозволяє задати шість команд, асоційованих з певним
типом файла, заданим ~маскою~@FileMasks@:

 #Команда запуску по Enter#      Виконується при натисканні #Enter#

 #Команда запуску по Ctrl+PgDn#  Виконується при натисканні #Ctrl+PgDn#

 #Команда перегляду#             Виконується при натисканні #F3#

 #Альтернативна команда#         Виконується при натисканні #Alt+F3#
 #перегляду#

 #Команда редагування#           Виконується при натисканні #F4#

 #Альтернативна команда#         Виконується при натисканні #Alt+F4#
 #редагування#

 Асоціацію можна описати у полі #Опис асоціації#.

 В асоційованих командах можуть використовуватися спеціальні
~метасимволи~@MetaSymbols@.

 Примітки:

 1. ^<wrap>Якщо для даного файла відсутні асоційовані команди
запуску і встановлено параметр #Використовувати стандартні типи файлів#
у ~Системних параметрах~@SystemSettings@, то Far пробує використовувати
асоціації Windows для запуску цього типу файлів.
 2. ^<wrap>~Команди~@OSCommands@ операційної системи "IF EXIST" та "IF DEFINED"
дозволяють зробити асоціації більш "розумними" - якщо ви призначили кілька
асоціацій для одного типу файлів, то до меню попадуть тільки ті асоціації,
у яких умови будуть виконуватися.
 3. ^<wrap>If the specified mask is a regular expression, its capturing groups can be referenced in the commands as %RegexGroup#N# or %RegexGroup{#Name#}.


@MetaSymbols
$ #Метасимволи#
 В ~асоційованих командах~@FileAssoc@, ~меню користувача~@UserMenu@
та команді ~"Застосувати команду"~@ApplyCmd@ можуть використовуватися
спеціальні символи:

 #!!#       ^<wrap>символ '!'
 #!#        Довге ім'я файла без розширення
 #!~~#       Коротке ім'я файла без розширення
 #!`#       Довге розширення файла без імені (ext)
 #!`~~#      Коротке розширення файла без імені (ext)
 #!.!#      Довге ім'я файла з розширенням
 #!-!#      Коротке ім'я файла з розширенням
 #!+!#      Аналогічно !-!, але якщо довге ім'я файла загублене після виконання команди, Far відновить його
 #!@@!#      Ім'я файла, що містить імена відзначених файлів
 #!$!#      Ім'я файла, що містить короткі імена відзначених файлів
 #!&#       Список відзначених файлів
 #!&~~#      Список відзначених файлів з короткими іменами
 #!:#       Поточний диск
 #!\\#       Поточний шлях
 #!/#       Коротке ім'я поточного шляху
 #!=\\#      Current path considering ~symbolic links~@HardSymLink@.
 #!=/#      Short name of the current path considering ~symbolic links~@HardSymLink@.
 #!?!#      Description of the current file

 #!?<title>?<init>!#
 При виконанні команди цей символ замінюється
даними, введеними користувачем. <title> та <init> - заголовок та вихідний текст рядка редагування.
 Допускається використання декількох таких символів в одному рядку, наприклад:
 grep !?Search for:?! !?In:?*.*!|c:\\far\\Far.exe -v -

 A history name for the <init> string can be supplied in the <title>. In such case the command has the following format:
#!?$<history>$<title>?<init>!#, for example:
 grep !?#$GrepHist$#Search for:?! !?In:?*.*!|Far.exe -v -

 Leave the name empty to disable history.

 The entered string can also be accessed later as #%<history># (or as #%UserVarN#, where N is the index of the corresponding input).

 In <title> and <init> the usage of other meta-symbols is allowed by enclosing them in brackets, e.g.
grep !?Find in (!.!):?! |Far.exe -v -.

 #!###
 Префікс "!##", вказаний перед символом асоціації
файла, примушує його (й усі наступні) посилатися
на пасивну панель (див. примітку 4).
Наприклад, !##!.! означає ім'я поточного файла на
пасивній панелі.

 #!^#
 Префікс "!^", вказаний перед символом асоціації
файла, примушує його (й усі наступні) посилатися
на активну панель (див. примітку 4).
Наприклад, !^!.! означає ім'я поточного файла на
активній панелі, а конструкція !##!\\!^!.! - файл на
пасивній панелі з таким же ім'ям, як ім'я поточного
файла на активній панелі.

 #![#
 "![" prefix forces all subsequent special symbols
to refer to the left panel (see note 4).
For example, ![!.! denotes a current file name on
the left panel, ![!\\!^!.! - a file on the left
panel with the same name as the name of the current
file on the active panel.

 #!]#
 "!]" prefix forces all subsequent special symbols
to refer to the right panel (see note 4).
For example, !]!.! denotes a current file name on
the right panel, !]!\\!^!.! - a file on the right
panel with the same name as the name of the current
file on the active panel.

 Примітки:

 1. ^<wrap>Far при обробці метасимволів підставляє тільки те, що
вони означають (ім'я файла, розширення і т.ін.). Ніяких додаткових символів
(наприклад, лапки або прізвища розробників Far) не підставляється і ви
повинні це зробити самі, коли необхідно. Наприклад, якщо програма, що
використовується в асоціаціях вимагає, щоб ім'я файла було у лапках, то ви
повинні писати #program.exe "!.!"#, а не #program.exe !.!#.

 2. ^<wrap>Для асоціацій !@@! та !$! допускаються такі модифікатори:
    #Q# - брати імена з пробілами у лапки;
    #S# - використовувати '/' замість '\' у шляхах файлів;
    #F# - використовувати повний шлях;
    #A# - використовувати ANSI кодування.
    #U# - use UTF-8 code page;
    #W# - use UTF-16 (Little endian) code page.

    ^<wrap>Наприклад, асоціація #!@@AFQ!# - ім'я файла, що містить імена відзначених
файлів з повним шляхом в ANSI кодуванні; імена файлів, які містять пробіли будуть узяті у лапки.

    ^<wrap>The following modifiers can be used with the special symbols #!&# and #!&~~#:
    #Q# - enclose each name in quotes. This is the default, if no modifier is specified.
    #q# - do not enclose names in quotes (as it was before build 5466).

    ^<wrap>For example, #!&Q# denotes the list of selected file names, each enclosed in quotes.

 3. ^<wrap>Метасимволи !@@! та !$! у меню вибору (коли задано кілька асоціацій)
показуються як є, перетворення відбувається у момент виконання команди.

 4. ^<wrap>Префікси "!##", "!^", "![" та "!]" працюють як перемикачі для асоціацій.
Дія цих префіксів поширюється до наступного подібного префікса. Наприклад:

    if exist !##!\\!^!.! diff -c -p !##!\\!^!.! !\\!.!

    ^<wrap>"Якщо на пасивній панелі існує такий же файл, як і на
активній під курсором, то показати розбіжності між файлом
на пасивній панелі і файлом на активній панелі, незалежно
від імені поточного файла на пасивній панелі"

 5. ^<wrap>If it is needed to pass to a program a name with an ending
backslash, use quotes, e.g. #"!"\#.
    ^<wrap>For example, to extract a rar archive to a folder with the same name:

    #winrar x "!.!" "!"\#


@SystemSettings
$ #Системні параметри#
 #Видаляти у Кошик#
 Дозволяє видалення файлів з використанням Кошика (Recycle Bin). Операція видалення у
Корзину здійснюється тільки для локальних жорстких дисків.

 #Використовувати системну функцію копіювання#
 Використовувати функції копіювання файлів, які надає операційна система, замість
внутрішньої реалізації копіювання файлів. Це може бути корисне на NTFS, оскiльки
системна функція (CopyFileEx) копіює розширені атрибути файлів. У той же час, при увімкненій опції
буде недоступною можливість of "smart" ~copying~@CopyFiles@ of sparse files.

 #Копіювати відкриті для запису файли#
 Дозволяє копіювати файли, які відкриті для запису іншими програмами.
Цей режим зручний, коли треба скопіювати відкритий протягом довгого часу файл, але
він може бути небезпечним, якщо цей файл модифікується одночасно з копіюванням.

 #Scan symbolic links#
 Scan ~symbolic links~@HardSymLink@ along with normal sub-folders when building the folder tree,
determining the total file size in the sub-folders.

 #Зберігати історію команд#
 Викликає збереження ~історії команд~@History@ перед завершенням та її відновлення після запуску Far.

 #Зберігати історію папок#
 Викликає збереження ~історії папок~@HistoryFolders@ перед завершенням та її відновлення після
запуску Far. Для перегляду вмісту історії папок натисніть #Alt+F12#.

 #Зберігати історію перегляду і редактора#
 Викликає збереження ~історії перегляду~@HistoryViews@ і редактора перед завершенням та її
відновлення після запуску Far. Для перегляду файлів, які входять до цього списку, натиснiть #Alt+F11#.

 #Використовувати стандартні типи файлів#
 Якщо це опція увімкнена, то при натисканні #Enter# на файлі, тип якого відомий
Windows і відсутній в ~асоціаціях файлів~@FileAssoc@ Far, буде запущена програма Windows,
призначена для обробки цього типу файлів.

 #Automatic update of environment variables#
 Automatically update the environment variables if they have been changed globally.

 #Request administrator rights#
 The current user might not always has the required rights to work with certain file system objects.
Far allows to retry the operation using the privileged account.
 Available options:
 - ^<wrap>#for modification#: allow requesting rights for operations that change the state of the file system (e.g. file or directory creation/modification/deletion)
 - ^<wrap>#for read#: allow requesting rights for operations that do not change the state of the file system (e.g. reading files or listing directories).
 - ^<wrap>#use additional privileges#: attempt accessing all files bypassing Access Control Lists.
Use with caution.

 #Sorting collation#
 Allows to choose and configure the sorting collation.
 - ^<wrap>#ordinal#: based on the ordinal value of the characters in the string
 - ^<wrap>#invariant#: invariant collation
 - ^<wrap>#linguistic#: based on the culture-specific sorting conventions

 #Treat digits as numbers#
 When enabled, sequential groups of digits are treated as numbers. The following example shows how the files are sorted:
 ┌──────────┬──────────┐
 │ Disabled │ Enabled  │
 ├──────────┼──────────┤
 │ Ie4_01   │ Ie4_01   │
 │ Ie4_128  │ Ie4_128  │
 │ Ie401sp2 │ Ie5      │
 │ Ie5      │ Ie6      │
 │ Ie501sp2 │ Ie401sp2 │
 │ Ie6      │ Ie501sp2 │
 │ 11.txt   │ 5.txt    │
 │ 5.txt    │ 11.txt   │
 │ 88.txt   │ 88.txt   │
 └──────────┴──────────┘
 Note: treating digits as numbers in linguistic collation is possible in Windows 7 and above. In older systems invariant collation will be used automatically.

 #Case sensitive#
 Take into account the case of the characters in the string.

 Note: how exactly the case of the characters in the string will be taken into account depends on the sorting collation.

 #Автозапис конфігурації#
 Якщо ця опція увімкнена, Far буде автоматично зберігати конфігурацію.
Також будуть зберігатися поточні папки обох панелей.


@PanelSettings
$ #Конфігурація панелей#
 #Показувати приховані й системні файли#
 Дозволяє показ файлів з атрибутами Прихований та Системний. Цей режим також може бути перемкнутий за допомогою Ctrl+H.

 #Розфарбування файлів#
 Дозволяє ~розфарбування файлів~@Highlight@.

 #Позначати папки#
 Дозволяє позначення папок з використанням #Gray +# та #Gray *#. У іншому випадку ці команди працюють тільки з файлами.

 #Right click selects files#
 If this option is on, #right mouse click# selects files. Otherwise, it opens Windows  Explorer Context menu.

 #Сортувати імена папок за розширенням#
 Застосовувати режим сортування за розширенням не тільки до файлів, але і до папок. При
увімкненій опції сортування за розширенням працює так же, як і у Far 1.65.
Якщо опція вимкнена, то у режимі сортування за розширенням папки будуть
сортуватися так же як у режимі сортування за ім'ям.

 #Дозволити зворотне сортування#
 Якщо ця опція увімкнена, і поточний режим сортування файлової панелі обрано повторно, то буде встановлений режим зворотного сортування.

 #Відключати автооновленя панелей#
 Механізм автоматичного оновлення панелі при зміні стану файлової системи буде відключатися, якщо кількість файлових
об'єктів перевищить задане значення.
 Механізм автоматичного стеження за файловою системою працює тільки для файлових систем FAT/FAT32/NTFS.
Значення параметра, рівне нулю відповідає стану "автоматичне оновлення увімкнене завжди".
Для примусового оновлення панелі використовуйте #Ctrl+R#.

 #Network drives autorefresh#
 This option enables panel autorefresh when the file system state of a network drive is changed.
It may be helpful to disable this option on slow network connections.

 #Показувати заголовки стовпчиків#
 Дозволяє показ заголовків стовпчиків ~панелі файлів~@FilePanel@.

 #Показувати рядок статусу#
 Дозволяє показ рядка статусу у панелі файлів.

 #Detect volume mount points#
 Distiguishes between normal directory links (Junctions) and volume mount points.
This option significanty slows down displaying directories on slow network connections.

 #Показувати сумарну інформацію#
 Дозволяє показ сумарної інформації у нижньому рядку панелі файлів.

 #Показувати вільне місце#
 Дозволяє показ вільного місця на поточному диску.

 #Показувати смугу прокрутки#
 Дозволяє показ смуги прокрутки у панелі файлів і ~панелі дерева папок~@TreePanel@.

 #Показувати кількість фонових екранів#
 Дозволяє показ кількості ~фонових екранів~@ScrSwitch@.

 #Показувати літеру режиму сортування#
 Показувати поточний режим сортування у верхньому лівому кутку панелі.

 #Show ".." in root folders#
 Enables displaying of ".." item in root folders.
Pressing #Enter# on this item opens ~Change drive menu~@DriveDlg@.


@TreeSettings
$ #Tree settings#
 #Автозміна папки#
 Якщо ця опція увімкнена, то пересування курсору по ~дереву папок~@TreePanel@ буде викликати
зміну папки в іншій панелі. Якщо ця опція вимкнена, то для зміни папки з дерева папок ви маєте натиснути #Enter#.

 #Minimum number of folders#
 The minimal number of folders on the disk for which folder tree cache file #tree3.far# will be created.


@InterfSettings
$ #Конфігурація інтерфейсу#
 #Годинник#
 Показувати годинник у верхньому правому кутку екрана.

 #Миша#
 Використовувати мишу.

 #Показувати лінійку клавіш#
 Показувати призначення функціональних клавіш у нижньому рядку екрана.
Ця опція також може перемикатися по #Ctrl+B#.

 #Завжди показувати меню#
 Показувати меню вгорі екрана, навіть коли воно неактивне.

 #Збереження екрана#
 Запуск програми збереження екрана після заданого у хвилинах інтервалу бездіяльності. When this option
is enabled, screen saver will also activate when mouse pointer is brought
to the upper right corner of Far window.

 #Показувати загальний індикатор копіювання#
 Показувати загальний індикатор під час виконання операції копіювання. Це може
зажадати додаткового часу перед початком копіювання для підрахунку загального розміру файлів.

 #Показувати інформацію про час копіювання#
 Виводить інформацію про середню швидкість копіювання, час копіювання та приблизний
час до кінця операції у діалозі копіювання.
 Оскільки ця функція потребує часу для збирання статистики,
то на невеликих файлах при вимкненому "загальному індикаторі
копіювання" ви можете нічого не побачити.

 #Show total delete indicator#
 Show total progress bar, when performing a file delete operation.
This could require some additional time before starting deleting
to calculate the total files count.

 #Використовувати Ctrl+PgUp для вибору диска#
 Комбінація клавіш Ctrl+PgUp у кореневій папці викличе меню вибору дисків.
 If Network plugin is installed, for network folders (and network drives, if switch
is in the third state) a list of server shared resources  will be shown.

 #Use Virtual Terminal for rendering#
 Render the output using ANSI escape sequences. You can find more about it ~here~@https://docs.microsoft.com/en-us/windows/console/classic-vs-vt@.
 This allows using 8 and 24-bit colors, text styles, and may (or may not) work better (or worse) with some Unicode characters.
 Requires Windows 10 and above.

 #Fullwidth-aware rendering#
 Take into account the fact that East Asian characters require two screen cells instead of one.
 The support is rudimentary and experimental. It may work or not, depending on your OS, locale, terminal, font and other settings.

 #ClearType friendly redraw#
 Redraw the window in such a way that ClearType related artifacts do not appear.
 #Attention!#: Enabling this option can considerably slow down the redraw speed.

 #Console icon#
 If this option is activated, Far will set the selected embedded icon as the icon of the console window.
Otherwise you can choose any desired icon in the Far shourtcut properties.

 #Alternate for Administrator#
 If this option is activated, Far will use the red icon when running with administrator privileges.

 #Far window title addons#
 Additional information, displayed in the window title.
Can contain any text, including environment variables (e.g. "%USERDOMAIN%\%USERNAME%") and the following special variables:
 - #%Ver# - Far version;
 - #%Platform# - Far platform;
 - #%Admin# - ^<wrap>"Administrator" if running as administrator, otherwise an empty string.
 - #%PID# - Far process ID;


@DialogSettings
$ #Settings dialog: dialogs#
  #Історія у рядках#        Зберігати історію у рядках уведення
  #уведення діалогів#       деяких діалогів Far. Список раніше
                          введених рядків може бути викликаний за
                          допомогою миші або Ctrl+Up та Ctrl+Down.
                          Якщо ви не хочете вести таку історію,
                          наприклад, із міркувань безпеки, вимкніть
                          цю опцію.

  #Постійні блоки#          Не знімати виділення при переміщенні
  #у рядках уведення#       курсору у рядках уведення у діалогах,
                          у командному рядку та в історії папок.

 #Del removes blocks#      If a block is selected, pressing Del will
 #in edit controls#        not remove the character under cursor, but
                         this block.

  #Автозавершення#          Дозволяє використання функції
  #у рядках уведення#       автозавершення у рядках уведення, які мають
                          історію чи у комбінованих списках.
                          При вимкненій опції для автозавершення
                          рядків можна скористатися комбінацією
                          клавіш Ctrl+End. Операція автозавершення
                          не працює під час запису та виконання
                          макросу.

 #Backspace deletes#       If the option is on, pressing #BackSpace#
 #unchanged text#          in an unchanged edit string deletes
                         the entire text, as if #Del# had been
                         pressed.

 #Mouse click outside#     #Right/left mouse click# outside a dialog
 #a dialog closes it#      closes the dialog (see ~Common~@MiscCmd@).
                         This option allows to switch off this
                         functionality.

 See also the list of ~macro keys~@KeyMacroDialogList@, available in dialogs.


@VMenuSettings
$ #Menu settings#
 #Left/Right/Middle mouse click outside a menu#
 You can choose action for mouse buttons, when click occures outside a menu:
#Cancel menu#, #Execute selected item# or #Do nothing#.


@CmdlineSettings
$ #Settings dialog: command line#
 #Persistent blocks#
 Do not remove block selection after moving the cursor in command line.

 #Del removes blocks#
 If a block is selected, pressing Del will not remove the character under cursor, but this block.

 #AutoComplete#
 Allows to use the AutoComplete function in command line. When the option is
disabled, you can use the #Ctrl+Space# key to autocomplete a line. The autocomplete
feature is disabled while a macro is being recorded or executed.

 #Встановити формат командного рядка#
 Змінити формат ~командного рядка~@CommandPrompt@ Far.

 #Use home dir#
 This option specifies the target folder of ~CD ~~~@OSCommands@ command.
If the string is empty, #CD ~~# will attempt to change the current path
to real “~~” directory (and fail if this is impossible, e.g. because
the directory does not exist). Default value is string “%FARHOME%” which
denotes Far home directory.


@AutoCompleteSettings
$ #Settings dialog: AutoComplete#
 #Show a list#
 Show completion suggestions as a list.

 #Modal mode#
 Make the list modal.

 #Append the first matched item#
 Append the first matched item to the command line text as you type.

 There are several additional options to control what data sources will be used to populate the completion list:
 - #Interface.Completion.UseFilesystem#
 - #Interface.Completion.UseHistory#
 - #Interface.Completion.UsePath#
 - #Interface.Completion.UseEnvironment#
 All parameters are 3-state - yes / no / only if called manually (using #Ctrl+Space#).
These parameters can be changed via ~far:config~@FarConfig@


@CommandPrompt
$ #Command line prompt format#
 Far allows to change the command line prompt format.
To change it you have to enter the needed sequence of variables and
special code words in the #Set command line prompt format# input field
of the ~Command line settings~@CmdlineSettings@ dialog, this will allow showing
additional information in the command prompt.

 Можна використовувати змінні середовища та наступні спеціальні:

 $a - ^<wrap>the & character
 $b - the | character
 $c - the ( character
 $d - current date (depends on system settings)
 $f - the ) character
 $g - символ >
 $h - delete the previous character
 $l - the < character
 $m - full network path of the current drive or empty, if the current drive is not a network drive
 $n - літера поточного диска
 $p - поточний шлях
 $q - the = character
 $s - space
 $t - current time in HH:MM:SS format
 $w - current working directory (without the path)
 $$ - символ $
 $+ - the depth of the folders stack
 $##nn - ^<wrap>max prompt width, given in percents relative to the width of the window
 $@@xx - ^<wrap>"Administrator", if Far Manager is running as administrator.
xx is a placeholder for two characters that will surround the "Administrator" word.
For example, #$@@{}$s$p$g# will be shown as "{Administrator} C:\>"

 By default the #$p$g# sequence is used - current drive and path ("C:\>").

 Examples:

 1. ^<wrap>A prompt of the following format #[%COMPUTERNAME%]$S$P$G#
will contain the computer name, current drive and path
(the %COMPUTERNAME% environment variable must be defined)

 2. ^<wrap>A prompt of the following format #[$T$H$H$H]$S$P$G# will
display the current time in HH:MM format before the current drive and path

 3. ^<wrap>Code "$+" displays the number of pluses (+) needed according to
current ~PUSHD~@OSCommands@ directory stack depth, one character per each
saved path.

 Prompt elements can be highlighted with #colors#.

 Format:
 #([[T]FFFFFFFF][:[T]BBBBBBBB][:style[:[T]UUUUUUUU]])#, where:

  #FFFFFFFF#
  Foreground color in aarrggbb format or index in the console palette.

  #BBBBBBBB#
  Background color in aarrggbb format or index in the console palette.

  #style#
  One or more text styles, separated by spaces:
  #bold#
  #italic#
  #overline#
  #strikeout#
  #faint#
  #blink#
  #inverse#
  #invisible#
  #underline#
  #underline_double#
  #underline_curly#
  #underline_dot#
  #underline_dash#

  #UUUUUUUU#
  Underline color in aarrggbb format or index in the console palette.

  #T#
  "TrueColor" flag. If absent, value is treated as the console palette index (00-FF):

  \00 \11 \22 \33 \44 \55 \66 \77 \88 \99 \AA \BB \CC \DD \EE \FF \-
  0123456789ABCDEF

 If a color is omitted, the corresponding default value will be used.

 Examples:

 #(E)#               \0e Bright yellow text on default background    \-
 #(:F)#              \f7 Default text on white background            \-
 #(B:C)#             \cb Bright blue text on bright red background   \-
 #()#                \07 Default text on default background          \-
 #(T00CCCC:TE34234)# \(T00CCCC:TE34234) Robin egg blue text on Vermilion background \-

 The specified color will be active till the end of the prompt or the next color entry.

 Example:

 #(a)%username%(f)@@(b)%computername%() $p$g# \0aadmin\0f@@\0bserver\07 C:\\>\-


@Viewer
$ #Вбудована програма перегляду#
 Navigation keys

 The behavior of navigation keys depends on the ~view mode~@ViewerMode@.

 The following keys work in all modes:

 #Up#                 Рядок угору
 #Down#               Рядок униз
 #PgUp#               Сторінку вгору
 #PgDn#               Сторінку вниз
 #Home, Ctrl+Home#    На початок файла
 #End, Ctrl+End#      На кінець файла

 The following additional keys work in #text mode without line wrap#:

 #Left#               Символ вліво
 #Right#              Символ вправо
 #Ctrl+Left#          20 символів уліво
 #Ctrl+Right#         20 символів управо
 #Ctrl+Shift+Left#    На початок рядків на екрані
 #Ctrl+Shift+Right#   На кінець рядків на екрані

 The following additional keys work in #dump# and #hex# modes:

 #Ctrl+Left#          ^<wrap>Shift all characters (#dump# mode) or bytes (#hex# mode) to the right
moving the last character (byte) of a row to the first position of the next row
 #Ctrl+Right#         Shift all characters (#dump# mode) or bytes (#hex# mode) to the left
moving the first character (byte) of a row to the last position of the previous row

 The following additional keys work in #hex mode#:

 #Alt+Left#           ^<wrap>Decrement the number of bytes per row
 #Alt+Right#          Inrement the number of bytes per row
 #Ctrl+Alt+Left#      Decrease the number of bytes per row to the nearest multiple of 16-bytes
 #Ctrl+Alt+Right#     Increase the number of bytes per row to the nearest multiple of 16-bytes

 Команди програми перегляду

 #F1#                 Допомога
 #F2#                 Перенос рядків (увімкнутий, вимкнутий)
 #Shift+F2#           Вид переносу рядків (по літерах, по словах)
 #F4#                 Перемкнути текстовий/16-ковий режим
 #Shift+F4#           Select ~view mode~@ViewerMode@: #text#, #hex#, or #dump#
 #F6#                 Перемкнутися у ~редактор~@Editor@
 #F7#                 ~Пошук~@ViewerSearch@
 #Shift+F7, Space#    Continue searching forward
 #Alt+F7#             Continue searching backwards
 #F8#                 Перемкнути між OEM та ANSI кодовими сторінками
 #Shift+F8#           Select code page using the ~Code pages~@CodePagesMenu@ menu
 #Alt+F8#             ~Змінити поточну позицію~@ViewerGotoPos@
 #Alt+F9#             Зміна розмірів вікна Far Manager;
see also ~Interface.AltF9~@Interface.AltF9@
 #Alt+Shift+F9#       Виклик діалогу ~конфігурація програми перегляду~@ViewerSettings@
 #Numpad5,F3,F10,Esc# Вихід
 #Ctrl+F10#           Позиціонуватися на поточний файл без виходу
 #F11#                Викликати меню "~Команди зовнішніх модулів~@Plugins@"
 #Alt+F11#            Display ~file view and edit history~@HistoryViews@
 #Gray +#             Перейти до наступного файла
 #Gray -#             Перейти до попереднього файла
 #Ctrl+O#             Показати екран користувача
 #Ctrl+Alt+Shift#     Тимчасово показати екран користувача
(працює до тих пір, доки утримуємо ці клавіші)
 #Ctrl+B#             Сховати/Показати лінійку функціональних клавіш
 #Ctrl+Shift+B#       Toggle status line
 #Ctrl+S#             Сховати/Показати смугу прокрутки
 #Alt+BS, Ctrl+Z#     Повернення до попередньої позиції
 #ПравийCtrl+0..9#    Встановити закладку 0…9 у поточній позиції
 #Ctrl+Shift+0..9#    Встановити закладку 0…9 у поточній позиції
 #ЛівийCtrl+0..9#     Перейти до позиції закладки 0…9
 #Ctrl+Ins, Ctrl+C#   Скопіювати виділений текст до Буфера Обміну
The text can be selected manually or as the result of a ~search~@ViewerSearch@.
 #Ctrl+U#             Скинути виділення тексту
 #Shift+Mouse click#  Select text manually. The first mouse click indicates the
beginning of the selected area; the second click indicates the end.
Use navigation keys after the first click to bring the end position into
the view. The end of the selected area may be set before or after the
beginning in the text.

 See also the list of ~macro keys~@KeyMacroViewerList@ available in the viewer.

 Примітки:

 1. ^<wrap>Файл відкривається у програмі перегляду із дозволом на
видалення його стороннім процесом. Якщо відбудеться таке
видалення, то реально файл буде видалений із каталогу тільки
після закриття програми перегляду, при цьому він не буде
доступний для обробки із любого процесу - це властивість
операційної системи Windows.

 2. ^<wrap>The maximum number of columns displayed in the #text#
~view mode~@ViewerMode@ can be configured in the
~Viewer settings~@ViewerSettings@ dialog. The range is between 100 to 100,000,
the default is 10,000. Рядки довжиною більше цього числа будуть займати
 на екрані не один рядок, а кілька, навіть якщо вимкнений режим переносу рядків.

 3. ^<wrap>Far ~шукає~@ViewerSearch@ перше входження підрядка (#F7#) з початку видимої
 ділянки екрана програми перегляду.

 4. ^<wrap>To auto-scroll a file which is being appended by another
process (conf. Linux “tail”), go to the end of the file (press the #End# key).


@ViewerMode
$ #Viewer: view modes#
 The viewer can render the content of the file in three modes:
#text#, #hex#, and #dump#. Current mode is indicated with a character
on the first (status) line of the window, to the left of the current
code page number:
 - #t#: text,
 - #h#: hex,
 - #d#: dump.

 When a file is opened, if #Save view mode# option in the
~Viewer settings~@ViewerSettings@ dialog is on and the file exists
in ~File view and edit history~@HistoryViews@, the last used view mode
is selected. Otherwise, if #Detect dump view mode# option in the
~Viewer settings~@ViewerSettings@ dialog is on and Far considers the
file binary, the #dump# mode is selected. Otherwise, the #text# mode is selected.

 The view mode can be changed manually with the following keys:

 #Shift+F4#
 Opens the #View mode# menu. If #text# or #dump#
mode is selected, it becomes the #base# mode; selecting #hex# mode
switches the current mode but does not change the base mode.

 #F4#
 Switches #text# or #dump# mode to #hex#, and
#hex# mode to the base (#text# or #dump#) mode most recently selected
in the #View mode# menu.

 #F2#
 In the #text# mode toggles line wrap/unwrap,
switches #dump# mode to #text#, and switches #hex# mode to the opposite
of the base mode (#dump# or #text#) most recently selected in the
#View mode# menu. Note: #F4# and #F2# switch #hex# mode to different
modes.

 See also the full list of ~viewer commands~@Viewer@.

 #Text# mode

 In the #text# mode viewer renders file content interpreting byte
sequences as character strings using the encoding defined by the current
code page. (Note that some encodings can use more than one byte
to represent a character.) Byte sequences invalid in the current
encoding and characters for which there are no glyphs in the console
window font are displayed as question marks, or empty rectangles,
or small question marks in a rectangle, or blanks. The representation
depends on the console window font.

 Text lines are broken at any conventional line delimiter, U+000A
U+000D (Dos/Windows format), U+000A (Unix format), or U+000D (Mac
format).

 Long text lines which do not fit into the window can be either
truncated or wrapped over multiple screen rows. The #F2# key switches
between #wrap# and #truncate# modes. In #wrap# mode, #Shift+F2# key
combination controls whether the lines can be broken inside a word.

 In #truncate# mode, the text can be scrolled horizontally within the
window. The #Right# key scrolls the text one column to the left; the
#Left# key scrolls one column to the right (think of moving the window
over the file content). The #Ctrl+Right# and #Ctrl+Left# key
combinations scroll 20 columns at a time. If #Show scrolling arrows#
in the ~Viewer settings~@ViewerSettings@ dialog is on, the truncated
lines are indicated with the #«# and #»# characters at the corresponding
edge of the window. The characters are displayed in a different color.

 The maximum length of text lines is limited to the #Maximum line width#
defined in the ~Viewer settings~@ViewerSettings@ dialog. Longer lines
are split into several screen rows even in #truncate# mode.

 #Dump# mode

 In the #dump# mode there is no notion of a text line.
The viewer renders file content character by character
without regard of line breaks or control codes which are treated
as ordinary characters. The characters are displayed on screen rows from
left to right. After reaching the end of the row, the next character
is displayed in the leftmost position of the next row.

 NOTE: Strictly speaking, text is rendered by code units, not by
characters. The size of a code unit depends on the encoding defined
by the current code page; it is one byte for single-byte encodings
(e.g. all ANSI code pages) and UTF-8, and two bytes for UTF-16 and
UTF-16BE encodings. For example:

 Code page 1252 (ANSI - Latin I): each byte is displayed in its
own screen position.

 Code page 65001 (UTF-8): the character is displayed in the
position corresponding to the leading byte of the UTF-8 sequence, and
the positions of continuation bytes are filled with the #›# characters
(code point U+203A).

 Code page 1200 (UTF-16): each screen position represents two
consecutive bytes starting at an even offset in the file.

 #Hex# mode (hexadecimal codes)

 In the #hex# mode viewer renders hexadecimal representation of the
bytes in the file. Each row starts with the hexadecimal offset of the
first byte and ends with the character representation of the bytes
of the row.

 The rendition depends on the encoding defined by the current code page.
For single-byte encodings (e.g. all ANSI code pages), the bytes on each
row are represented by the sequence of double-digit hex values followed
by the character sequence of the same length. For UTF-8 encoding, the
bytes are represented the same way, while the characters are displayed
at the positions of the leading bytes of the UTF-8 sequences with the
positions of continuation bytes being filled with the #›# characters
(code point U+203A). For UTF-16(BE) encodings, each pair of double-digit
hex values is represented by one character. For example:

 Code page 1252 (ANSI - Latin I)

@-
 \1b0000000000: 54 68 65 20 71 75 69 63 │ 6B 20 62 72 6F 77 6E 20  The quick brown \-
 \1b0000000010: 66 6F 78 20 6A 75 6D 70 │ 73 20 6F 76 65 72 20 74  fox jumps over t\-
 \1b0000000020: 68 65 20 6C 61 7A 79 20 │ 64 6F 67 27 73 20 62 61  he lazy dog's ba\-
 \1b0000000030: 63 6B 2E 0D 0A          │                          ck.♪◙           \-
@+

 Code page 65001 (UTF-8)

@-
 \1b0000000035: D0 92 20 D1 87 D0 B0 D1 │ 89 D0 B0 D1 85 20 D1 8E  В› ч›а›щ›а›х› ю›\-
 \1b0000000045: D0 B3 D0 B0 20 D0 B6 D0 │ B8 D0 BB 2D D0 B1 D1 8B  г›а› ж›и›л›-б›ы›\-
 \1b0000000055: D0 BB 20 D1 86 D0 B8 D1 │ 82 D1 80 D1 83 D1 81 2C  л› ц›и›т›р›у›с›,\-
@+

 Code page 1200 (UTF-16)

@-
 \1b00000000A2: 3D 04 3E 04 20 00 44 04 │ 30 04 3B 04 4C 04 48 04  но фальш\-
 \1b00000000B2: 38 04 32 04 4B 04 39 04 │ 20 00 4D 04 3A 04 37 04  ивый экз\-
 \1b00000000C2: 35 04 3C 04 3F 04 3B 04 │ 4F 04 40 04 2C 00 20 00  емпляр, \-
 \1b00000000D2: 34 04 30 04 2E 00 0D 00 │ 0A 00                    да.♪◙   \-
@+


@ViewerGotoPos
$ #Змінити поточну позицію#
 Цей діалог дозволяє змінити позицію у вбудованій програмі перегляду

 You can enter an absolute or relative value or percentage, in decimal or hexadecimal.
 For relative add #+# or #-# before the value.
 For percentage add #%# after the value.
 For decimal either add #m# after the value or uncheck the #Hex value#.
 For hexadecimal either add #0x# or #$# before the value, #h# after the value, or check the #Hex value#.

 The value will be interpreted as an offset from the beginning of the file.
If the current view mode is #unwrapped text# it is possible to enter an additional value
which will be interpreted as a first visible column.
Values must be delimited by space or one of the following characters: #,.;:#.
If a value is omitted the corresponding parameter will not be changed.


@ViewerSearch
$ #Пошук у програмі перегляду#
 Для пошуку у ~програмі перегляду~@Viewer@ вам доступні такі
режими й опції:

 #Шукати текст#
 Пошук довільного тесту, набраного у рядку #Шукати#.

 #Шукати 16-ковий код#
 Пошук фрагмента, що відповідає шістнадцятковим кодам, набраним у рядку #Шукати#.

 #Враховувати регістр#
 При пошуку буде враховуватися регістр уведених символів
(so, for example, #Text# will not be found when searching for #text#).

 #Тільки цілі слова#
 При пошуку буде проведений пошук тільки цілого слова

 #Fuzzy search#
 The search will be diacritical insensitive (for example, #deja# will be found in #déjà vu#),
ligatures will be equivalent to corresponding multicharacter sequences (#fluffy# matches #ﬂuﬀy#),
fancy numbers to corresponding numbers (#42# matches #④②#), and so on.

 Note that case sensitive fuzzy search sometimes may be useful. For example, #Uber# will be found
in #Überwald# but not in #überwald#. However, #Æther# will match #AEther#, but not #Aether#.

 #Regular expressions#
 Enable the use of ~regular expressions~@RegExp@ in the search string.
The multiline search is not supported.

 The #Find next# button starts searching forward.

 The #Find previous# button starts searching backwards.


@Editor
$ #Вбудований редактор#
 To edit the file currently under the cursor you should press #F4#. This
can be used to open the internal editor or any of the user defined external
editors which are defined in the ~Editor settings~@EditorSettings@ dialog.

 #Creating files using the editor#

 If a nonexistent file name is entered after pressing the #Shift+F4# hotkey
then a ~new file~@FileOpenCreate@ will be created.

 Remarks:

 1. ^<wrap>If a name of a nonexistent folder is entered when creating a new file
then a "~Path to the file to edit does not exist~@WarnEditorPath@" warning will be shown.
 2. ^<wrap>When trying to reload a file already opened in the editor the
"~reloading a file~@EditorReload@" warning message will be shown.
 3. ^<wrap>The ANSI code page is used by default when creating new files, this
behavior can be changed in the ~Editor settings~@EditorSettings@ dialog.

 #Control keys#

 Команди керування курсором

 #Left#                    ^<wrap>Символ уліво
 #Ctrl+S#                  Символ уліво, але курсор не буде переходити на попередній рядок при досягненні початку рядка
 #Right#                   Символ управо
 #Up#                      Рядок угору
 #Down#                    Рядок униз
 #Ctrl+Left#               Слово вліво
 #Ctrl+Right#              Слово вправо
 #Ctrl+Up#                 Прокрутка екрана вгору
 #Ctrl+Down#               Прокрутка екрана вниз
 #PgUp#                    Сторінку вгору
 #PgDn#                    Сторінку вниз
 #Home#                    У початок рядка
 #End#                     У кінець рядка
 #Ctrl+Home, Ctrl+PgUp#    У початок файла
 #Ctrl+End, Ctrl+PgDn#     У кінець файла
 #Ctrl+N#                  У початок екрана
 #Ctrl+E#                  У кінець екрана

 Видалення

 #Del#                     ^<wrap>Видалити символ (також може видалити блок, у залежності від ~Конфігурації редактора~@EditorSettings@)
 #BS#                      Видалити символ злiва
 #Ctrl+Y#                  Видалити рядок
 #Ctrl+K#                  Видалити до кiнця рядка
 #Ctrl+BS#                 Видалити слово зліва
 #Ctrl+T, Ctrl+Del#        Видалити слово праворуч

 Операції над блоками

 #Shift+Клавіша курсору#   ^<wrap>Позначення блоку
 #Ctrl+Shift+Клав.курсору# Позначення блоку
 #Alt+Сірі клав.курсору#   Позначення вертикального блоку
 #Alt+Shift+Клав.курсору#  Позначення вертикального блоку
 #Ctrl+Alt+Сірі клавіші#   Позначеннявертикального блоку
 #Ctrl+A#                  Позначити весь текст
 #Ctrl+U#                  Зняти позначення з блоку
 #Shift+Ins, Ctrl+V#       Скопіювати блок з Буфера Обміну
 #Shift+Del, Ctrl+X#       Перемістити блок до Буфера Обміну
 #Ctrl+Ins, Ctrl+C#        Скопіювати блок до Буфера Обміну
 #Ctrl+<Gray +>#           Додати блок до Буфера Обміну
 #Ctrl+D#                  Видалити блок
 #Ctrl+P#                  Копіювати блок до поточної позиції курсору (тільки у режимі постійних блоків)
 #Ctrl+M#                  Перенести блок до поточної позиції курсору (тільки у режимі постійних блоків)
 #Alt+U#                   Зсунути блок уліво
 #Alt+I#                   Зсунути блок управо

 Інші операції

 #F1#                      ^<wrap>Допомога
 #F2#                      Зберегти файл
 #Shift+F2#                ~Зберегти файл як…~@FileSaveAs@
 #Shift+F4#                Edit ~new file~@FileOpenCreate@
 #F6#                      Перемкнутися у ~програму перегляду~@Viewer@
 #F7#                      ~Пошук~@EditorSearch@
 #Ctrl+F7#                 ~Заміна~@EditorSearch@
 #Shift+F7#                Continue searching or replacing forward
 #Alt+F7#                  Continue searching or replacing backwards
 #F8#                      Toggle OEM/ANSI code page
 #Shift+F8#                Select code page
 #Alt+F8#                  ~Перейти~@EditorGotoPos@ до вказаного рядка й позиції
 #Alt+F9#                  Зміна розмірів вікна Far Manager; дивись також ~Interface.AltF9~@Interface.AltF9@
 #Alt+Shift+F9#            Виклик діалогу ~конфігурації редактора~@EditorSettings@
 #F10, F4, Esc#            Вихід
 #Shift+F10#               Збереження і вихід
 #Ctrl+F10#                Позиціонуватися на поточний файл без виходу
 #F11#                     Викликати меню "~Команди зовнішніх модулів~@Plugins@"
 #Alt+F11#                 Display ~file view and edit history~@HistoryViews@
 #Alt+BS, Ctrl+Z#          Скасування дії
 #Ctrl+Shift+Z#            Redo
 #Ctrl+L#                  Заборонити модифікацію тексту що редагується
 #Ctrl+O#                  Показати екран користувача
 #Ctrl+Alt+Shift#          Тимчасово показати екран користувача (працює до тих пір, доки утримуємо ці клавіші)
 #Ctrl+Q#                  Розглядати наступну комбінацію клавіш як код символу
 #ПравийCtrl+0…9#          Встановити закладку 0…9 у поточній позиції
 #Ctrl+Shift+0…9#          Встановити закладку 0…9 у поточній позиції
 #ЛівийCtrl+0…9#           Перейти до позиції закладки 0…9
 #Shift+Enter#             Вставити до позиції курсору ім'я поточного файла на панелі
 #Ctrl+Shift+Enter#        Вставити до позиції курсору ім'я поточного файла на пасивній панелі
 #Ctrl+F#                  Вставити до позиції курсору повне ім'я файла, що редагується
 #Ctrl+B#                  Show/Hide functional key bar at the bottom line.
 #Ctrl+Shift+B#            Show/Hide status line

 See also the list of ~macro keys~@KeyMacroEditList@, available in the editor.

 Примітки:

 1. ^<wrap>#Alt+U#/#Alt+I# зсувають поточний рядок, якщо не виділено блок.
 2. ^<wrap>Alt+Код символу на додатковій клавіатурі вставляє у рядок,
що редагується, символ із указаним кодом (0-65535).
 3. ^<wrap>Якщо блок не виділено, то #Ctrl+Ins#/#Ctrl+C# відзначають поточний
рядок як блок і копіюють його до Буфера Обміну.


@EditorSearch
$ #Editor: search/replace#
 The following options are available for search and replace in the ~editor~@Editor@:

 #Case sensitive#
 The case of the characters entered will be taken into account while searching (so, for example,
#Text# will not be found when searching for #text#).

 #Whole words#
 The given text will be found only if it occurs in the text as a whole word.

 #Fuzzy search#
 The search will be diacritical insensitive (for example, #deja# will be found in #déjà vu#),
ligatures will be equivalent to corresponding multicharacter sequences (#fluffy# matches #ﬂuﬀy#),
fancy numbers to corresponding numbers (#42# matches #④②#), and so on.

 Note that case sensitive fuzzy search sometimes may be useful. For example, #Uber# will be found
in #Überwald# but not in #überwald#. However, #Æther# will match #AEther#, but not #Aether#.

 #Regular expressions#
 Treat input as Perl regular expression (~search~@RegExp@ and ~replace~@RegExpRepl@).
Each line is processed individually, so multi-line expressions and line break characters will not be found.

 ~Preserve style~@PreserveStyle@
 Preserve style (case and delimiters in program source code) of the replaced text.

 The #Find next# / #Replace next# buttons start searching / replacing forward.

 The #Find previous# / #Replace previous# buttons start searching / replacing backwards.

 The #All# button will show All matching entries ~menu~@FindAllMenu@.


@PreserveStyle
$ #Editor: Replace mode - Preserve style#
 The #“Preserve style”# ~replace~@EditorSearch@ mode in the
~Editor~@Editor@ preserves the style (case, delimiters) of the replaced
text. This mode may be useful when editing program source code. Some
examples are below. Note how the style of the replaced strings
is preserved in each case.

@-
 ┌────────────────┬────────────────────┬──────────────────────┐
 │ Find / Replace │ Before             │ After                │
 ├────────────────┼────────────────────┼──────────────────────┤
 │ tu / to        │ #Tu# be or not #tu# be │ #To# be or not #to# be   │
 ├────────────────┼────────────────────┼──────────────────────┤
 │ UserName       │ writerUserName     │ writerPersonLogin    │
 │  /             │ user.NAME          │ person.LOGIN         │
 │ PersonLogin    │ DEFAULT_USER_NAME  │ DEFAULT_PERSON_LOGIN │
 │                │ default-User-name  │ default-Person-login │
 └────────────────┴────────────────────┴──────────────────────┘
@+

 #More formally.#

 The main operation used in the algorithm is parsing a string into
tokens. The tokens are divided at a single separator character
or between a lowercase and an uppercase letter. Token separator
characters are #underscore “_”#, #hyphen “-”#, and #dot “.”#. All tokens
must be divided with the same separator. If the parse is ambiguous, the
entire string is treated as a single token. For example:

@-
 ┌──────────────────────┬──────────────────────┬──────────────┐
 │ Search Pattern       │ Tokens               │ Comments     │
 ├──────────────────────┼──────────────────────┼──────────────┤
 │ testMe               │ test Me              │              │
 │ WhatIsIt             │ What Is It           │              │
 │ far-manager          │ far manager          │              │
 │ Contact.Address.Type │ Contact Address Type │              │
 │ USER_FIRST_NAME      │ USER FIRST NAME      │              │
 ├──────────────────────┼──────────────────────┼──────────────┤
 │ test_userName        │ test_userName        │ Ambiguous    │
 │ one.two-three        │ one.two-three        │ separators   │
 │ aBc.dEf.gHi          │ aBc.dEf.gHi          │              │
 ├──────────────────────┼──────────────────────┼──────────────┤
 │ A..B                 │ A..B                 │ Adjacent     │
 │                      │                      │ separators   │
 └──────────────────────┴──────────────────────┴──────────────┘
@+

 The parse also defines the common separator type and the style of
each token. There are three token styles: #Title#case, #lower#case, and
#UPPER#case. If a token has a mix of uppercase and lowercase letters
or non-letter characters, its style is undefined. A token consisting
of a single uppercase character is deemed to be both #Title#case and
#UPPER#case.

 #The following algorithm is used to replace preserving style.#

 The search pattern and the replace string are parsed into tokens
according to the rules above. The text is searched for a string that can
be parsed into the same tokens as the search pattern. The tokens are
compared according to the #“Case sensitive”# and #“Whole words”# search
modes.

 If the found string and the replace string have the same number
of tokens and the found tokens have common style (#Title#case
is preferred over the #UPPER#case), the replace tokens are transformed
to this common style. If the common style cannot be defined, the replace
tokens are transformed to the style of the corresponding found tokens.
After the transformation, the replace tokens are joined with the
separator of the parse of the found string. The result is used as the
replace string. Some examples:

@-
 ┌────────────────┬────────────────────┬──────────────────────┐
 │ Find / Replace │ Before             │ After                │
 ├────────────────┼────────────────────┼──────────────────────┤
 │ abc-def-ghi    │ AbcDefGhi          │ PqRstXyz             │
 │  /             │ ABC_DEF_GHI        │ PQ_RST_XYZ           │
 │ pq.RST.Xyz     │ abc.def.ghi        │ pq.rst.xyz           │
 │                │ abcDefGhi          │ pqRstXyz             │
 │                │ ABC_Def_Ghi        │ PQ_Rst_Xyz           │
 ├────────────────┼────────────────────┼──────────────────────┤
 │ AA-B-C         │ Aa_B_C             │ Xxx_Yy_Zz            │
 │  /             │ aa-b-c             │ xxx-yy-zz            │
 │ xxx.Yy.ZZ      │ AA_B_C             │ XXX_YY_ZZ            │
 │                │ aa.B.C             │ xxx.Yy.Zz            │
 │                │ Aa.B.c             │ Xxx.Yy.zz            │
 └────────────────┴────────────────────┴──────────────────────┘
@+

 If the found string and the replace pattern have different number
of tokens, the first token is processed separately from the rest of the
tokens. The first replace token inherits the style of the first found
token. The rest of the replace tokens are transformed to the common
style of the rest of the found tokens. If the common style cannot
be defined, the rest of the replace tokens are not changed. As in the
previous case, the replace tokens are joined with the separator of the
parse of the found string and the result is used as the replace string.
Examples:

@-
 ┌────────────────┬────────────────────┬──────────────────────┐
 │ Find / Replace │ Before             │ After                │
 ├────────────────┼────────────────────┼──────────────────────┤
 │ abc-def-ghi    │ Abc.def.ghi        │ Pq.rst.uvw.xyz       │
 │  /             │ ABC.Def.Ghi        │ PQ.Rst.Uvw.Xyz       │
 │ pq.RST.uvw.Xyz │ abc.Def.ghi        │ pq.RST.uvw.Xyz       │
 │                │ ABC.DEF.ghi        │ PQ.RST.uvw.Xyz       │
 ├────────────────┼────────────────────┼──────────────────────┤
 │ A-B-C          │ A_B_C              │ Aa_Bb_Cc_Dd          │
 │  /             │ a-b-c              │ aa-bb-cc-dd          │
 │ aa.Bb.cc.DD    │ A.B.c              │ Aa.Bb.cc.DD          │
 └────────────────┴────────────────────┴──────────────────────┘
@+

 In the special case when the found string consists of a single token
but the replace string has several tokens, the first replace token
inherits the style of the found token. The common style for the rest
of the replace tokens and the separator type are deduced from the
context of the found string. If this is not possible, the common style
is the style of the (single) found token and the separator is empty.
Again, the transformed replace tokens are joined and used as the replace
string. More examples:

@-
 ┌────────────────┬────────────────────┬──────────────────────┐
 │ Find / Replace │ Before             │ After                │
 ├────────────────┼────────────────────┼──────────────────────┤
 │ ijk            │ ijk.Zzz            │ mno.Pqr.Stu.Zzz      │
 │  /             │ AAA-ijk            │ AAA-mno-pqr-stu      │
 │ MnoPqrStu      │ aaa-ijk_ZZZ        │ aaa-mno_PQR_STU_ZZZ  │
 │                │ AaaIjk             │ AaaMnoPqrStu         │
 │                │ 0_ijk_9            │ 0_mno_Pqr_Stu_9      │
 │                │ >ijk<              │ >mnopqrstu<          │
 └────────────────┴────────────────────┴──────────────────────┘
@+

 If the search pattern is not found according to the rules above but
found as an ordinary string, and both the found string and the replace
string start with letters, the case of the first letter of the replace
string is changed to that of the found string. For example:

@-
 ┌────────────────┬────────────────────┬──────────────────────┐
 │ Find / Replace │ Before             │ After                │
 ├────────────────┼────────────────────┼──────────────────────┤
 │ ab.cd / wx-yz  │ #A#b.cD              │ #W#x-yz                │
 └────────────────┴────────────────────┴──────────────────────┘
@+


@FindAllMenu
$ #Editor: All matching entries menu#
 The following key combinations are available in this menu:

 #F5#
 Toggle menu size.

 #Ctrl+Up#, #Ctrl+Down#
 Scroll the text in the editor.

 #Ctrl+Enter#, #Ctrl+Left mouse click#
 Go to the position of the found text.

 #Ctrl+Numpad5#
 Vertically align all found entries.

 #Gray +#
 Add session bookmark with the current position.

 #RightCtrl+0…9#, #Ctrl+Shift+0…9#
 Set bookmark 0…9 at the current position.

 #LeftCtrl+0…9#
 Go to the bookmark 0…9.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@FileOpenCreate
$ #Editor: Open/Create file#
 The #Shift+F4# key combination opens an existing file or creates
a new file.

 If the specified file does not exist, a new file will be created.
The code page for the new file is specified in the #Code page# list.
If #default# is selected in the list, the code page specified in the
~Editor settings~@EditorSettings@ dialog is used.

 The code page for an existing file is defined according to the
#Code page# list selection.

 #Default#
 If the file has already been opened and its
code page was saved (depends on the #Save file position# option of the
~Editor settings~@EditorSettings@ dialog), the saved code page is used.
Otherwise, if the file has the Byte Order Mark, the corresponding
Unicode code page -- UTF-8, UTF-16 (Little endian), or UTF-16 (Big
endian) -- is used. Otherwise, the code page is ~autodetected~@CodePageAuto@.

 #Automatic detection#
 An attempt is made to ~autodetect~@CodePageAuto@ code page based on the file contents.

 #Specific code page#
 The selected code page is used.


@FileSaveAs
$ #Зберегти файл як…#
 Файл, що редагується, можна зберегти під іншим ім'ям - натиснути #Shift+F2#
і вказати інше ім'я, code page and End of Line characters format.

 If file has been edited in one of the following code pages: UTF-8,
UTF-16 (Little endian) or UTF-16 (Big endian), then if the option #Add signature (BOM)# is on,
the appropriate marker is inserted into the beginning of the file, which
helps applications to identify the code page of this file.

 Ви можете також вказати формат подання символу переведення рядка:

 #Вихідний формат#
 Не змінювати символи переведення рядка.

 #У форматі Dos/Windows (CR LF)#
 У якості послідовності переведення рядка будуть використовуватися
два символи - повернення каретки і переведення рядка (CR LF), прийняті у Dos/Windows.

 #У форматі Unix (LF)#
 У якості послідовності переведення рядка буде використовуватися
символ переведення рядка (LF), прийнятий у Unix.

 #У форматі Mac (CR)#
 У якості послідовності переведення рядка буде використовуватися
символ повернення каретки (CR), прийнятий у Mac.


@EditorGotoPos
$ #Перейти до вказаної позиції#
 У цьому діалозі можна вказати #рядок# і #стовпчик# для переходу.

 You can enter an absolute or relative value or percentage, in decimal or hexadecimal.
 For relative add #+# or #-# before the value.
 For percentage add #%# after the value.
 For decimal either add #m# after the value or uncheck the #Hex value#.
 For hexadecimal either add #0x# or #$# before the value, #h# after the value, or check the #Hex value#.

 The first value will be interpreted as a row number, the second as a character number.
Values must be delimited by space or one of the following characters: #,.;:#.
If a value is omitted the corresponding parameter will not be changed.


@EditorReload
$ #Повторне відкриття файла у редакторі#
 Far Manager відслідковує всі спроби повторного відкриття у редакторі
файлів, що вже редагуються. Правила повторного відкриття такі:

 1. ^<wrap>Якщо файл не був змінений, то при відключеній опції "Повторне
відкриття файла у редакторі" у діалозі ~підтверджень~@ConfirmDlg@
відбувається перехід до редагування поточного файла без додаткових запитів.

 2. ^<wrap>Якщо файл був змінений або включена опція "Повторне відкриття файла
у редакторі", то існує три варіанти дій:

 #Поточний#
 Продовжити редагування того ж файла.

 #Нова копія#
 Файл буде відкритий для редагування у новій копії
редактора. У цьому випадку будьте уважні: уміст
файла на диску буде відповідати тому, у якій з
копій редактора останній раз зберігали цей файл.

 #Перевантажити#
 Поточні зміни не зберігаються й у редактор
завантажується колишній уміст файла (із моменту останнього збереження).


@WarnEditorPath
$ #Попередження: Шлях до файла, що редагувався не існує#
 При відкритті нового файла у ~редакторі~@Editor@ ви вказали ім'я
неіснуючої папки. Перед збереженням файла Far створить таку папку за
умови, що вами вказаний коректний шлях (некоректним буде, наприклад,
шлях, що починається з неіснуючої літери диска) і що ви маєте досить
повноважень на створення папки.


@WarnEditorPluginName
$ #Warning: The name of the file to edit cannot be empty#
 To create a new file on a plugin's panel you must specify a
file name.


@WarnEditorSavedEx
$ #Попередження: Файл був змінений зовнішньою програмою#
 Дата/час модифікації або розмір файла, що редагується, на диску
не збігаються з тими, котрі Far запам'ятав при останньому звертанні
до цього файла. Це означає, що інша програма, інший користувач (або
навіть ви самі в іншому вікні редактора) змінили уміст файла на диску.

 Якщо ви натиснете "Зберегти", файл буде перезаписаний, і всі зміни,
внесені зовнішньою програмою, будуть загублені.


@CodePagesMenu
$ #Code pages menu#
 This menu allows to select code page in the editor and viewer.

 The menu is divided into several sections:

 #Automatic detection#
 Far will try to ~autodetect~@CodePageAuto@ the code page of the text.

 #System#
 Main single-byte system code pages - ANSI and OEM.

 #Unicode#
 Unicode code pages.

 #Favorites#
 Code pages selected by the user.

 #Other#
 The rest of code pages installed in the system.

 The following key combinations are available in this menu:

 #Ctrl+H#
 Shows or hides the #Other# menu section.

 #Ins#
 Moves the code page from the #Other# section to the #Favorites# section.

 #Del#
 Moves the code page from the #Favorites# section back to the #Other# section.

 #F4#
 Opens the ~Rename the code page~@EditCodePageNameDlg@ dialog. Only #Favorites# and
#Other# code pages can be renamed. The renamed code pages are indicated
with the #*# character.

 See also common ~menu keyboard commands~@MenuCmd@.


@EditCodePageNameDlg
$ #Rename code page#
 This dialog allows to rename the #Favorites# and #Other# code pages.
Far will display new code page names in the ~Code pages~@CodePagesMenu@ menu.

 The #Reset# button sets the code page name to the default system
name. Another way to reset the name is to leave it empty and press #OK#.


@DriveDlg
$ #Меню вибору диска#
 Це меню дозволяє змінити поточний диск панелі або відкрити нову панель ~плагіна~@Plugins@.

 Оберіть пункт меню з відповідною літерою диска для зміни
поточного диска або пункт з назвою плагіна, щоб створити нову
панель плагіна. Якщо панель не є ~панеллю файлів~@FilePanel@,
її тип буде змінений на панель файлів.

 #Ctrl+A#, #F4# hotkeys invoke the ~file attributes~@FileAttrDlg@ for drives.

 #Ctrl+A#, #F4# hotkeys can be used to assign a hotkey to plugin item.

 #F3# key shows plugin technical information.

 Клавіша #Del# може використовуватися для:
 - ^<wrap>~від'єднання~@DisconnectDrive@ від мережного диска;
 - видалення SUBST диска;
 - to detach a virtual disk;
 - витягання дисків з CD-ROM і змінних приводів.

 Для операції витягання диска з ZIP-приводів потрібні права адміністратора.

 Закрити CD-ROM можна клавішею #Ins#.

 The #Shift+Del# hotkey is used to prepare a USB storage device for safe
removal. If the disk, for which the removal function is used, is a flash-card
inserted into a card-reader that supports several flash-cards then the
card-reader itself will be stopped.

 #Ctrl+1# - #Ctrl+9# перемикають відображення різної інформації:

 #Ctrl+1# - тип диска;
 #Ctrl+2# - мережне ім'я / шлях, асоційований з SUBST диском
/ path to virtual disk container;
 #Ctrl+3# - мітка диска;
 #Ctrl+4# - файлова система;
 #Ctrl+5# - загальне й вільне місце на диску (this option has two
display modes, press twice to see);
 #Ctrl+6# - показ параметрів змінних дискiв;
 #Ctrl+7# - показ імен модулів, що підключаються;
 #Ctrl+8# - показ параметрів компакт-дисків.
 #Ctrl+9# - ^<wrap>network parameters.

 Конфігурація меню #вибору диска# зберігається у конфігурації Far.

 #F9# shows the ~dialog~@ChangeDriveMode@ to control displaying
of this information.

 При включеній опції "~Використовувати Ctrl+PgUp для вибору диска~@InterfSettings@",
комбінація клавіш #Ctrl+PgUp# аналогічна клавіші #Esc# - відмовитися
від вибору диска і закрити меню.

 #Shift+Enter# викликає Провідника з показом кореня зазначеного диска
(працює тільки для дисків).

 #Ctrl+H# shows unmapped volumes.

 #Ctrl+R# дозволяє обновити меню вибору диска.

 If "#CD drive type#" mode is enabled (#Ctrl+8#), Far will attempt to
determine the type of each of the CD drives available in the system. Known
types are as follows: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW and DVD-RAM.
This function is available only for users either with administrative privileges
or all local users, when it's stated explicitly in the Local Policy Editor
(to do this, run #secpol.msc# from the command prompt, and set the '#Local#
#Policies/Security Options/Devices: Restrict CD-ROM access to locally logged-on#
#user only#' setting to '#Enabled#').

 #Alt+Shift+F9# allows you to ~configure plugins~@PluginsConfig@ (it works only if
display of plugin items is enabled).

 #Shift+F9# in the plugins list opens the configuration dialog of the
currently selected plugin.

 #Shift+F1# in the plugins list displays the context-sensitive help of the
currently selected plugin, if the plugin has a help file.

 The #A# character in the leftmost menu column means that the corresponding plugin is
written for Far 1.7x and it does not support all possibilities available in
Far 3 (these are, in particular, Unicode characters in filenames and in editor).

 See also:

 The list of ~macro keys~@KeyMacroDisksList@, available in the disk menu.
 Common ~menu~@MenuCmd@ keyboard commands.


@ChangeDriveMode
$ #Change Drive Menu Options#
 The dialog allows to control the information shown in the
~Change drive~@DriveDlg@ menu.

 #Show disk type#
 Show disk type: “fixed”, “network”, etc.
 Key combination in #Change drive# menu: #Ctrl+1#.

 #Show disk label#
 Show disk label (if available).
 Key combination in #Change drive# menu: #Ctrl+3#.

 #Use shell name#
 Request the disk name from Windows Shell.
 Key combination in #Change drive# menu: #Ctrl+3# (press twice).

 #Show file system type#
 Show file system type: “NTFS”, “FAT”, etc.
 Key combination in #Change drive# menu: #Ctrl+4#.

 #Show size#
 Show disk size and free space.
 Key combination in #Change drive# menu: #Ctrl+5#.

 #Show size as a decimal fraction#
 Show disk size and free space as a decimal fraction with no more
than three digits before decimal point. If this option is on, 1 GiB (2
to the power of 30) will be shown as #1.00 G#, otherwise as #1024 M#.
 Key combination in #Change drive# menu: #Ctrl+5# (press twice).

 #Show network name / SUBST path / VHD name#
 Show network name / path associated with a SUBST disk / path
to virtual disk container.
 Key combination in #Change drive# menu: #Ctrl+2#.

 #Show plugins#
 Show plugins.
 Key combination in #Change drive# menu: #Ctrl+7#.

 #Sort plugins by hotkey#
 If this option is turned #off#, plugin list is sorted by name;
otherwise by hotkey.

 #Show removable drive parameters#
 Show removable drive parameters.
 Key combination in #Change drive# menu: #Ctrl+6#.

 #Show CD drive parameters#
 If this option is turned on, Far will attempt to detect CD drive
type: CD-ROM, CD-RW, CD-RW/DVD, DVD-ROM, DVD-RW, DVD-RAM, HD DVD-ROM,
HD DVD-RW, Blue-ray Disk-ROM, Blue-ray Disk-RW.
 Key combination in #Change drive# menu: #Ctrl+8#.

 #Show network drive parameters#
 Show network drive size and free space. Display format depends
on the #Show size# option.
 Key combination in #Change drive# menu: #Ctrl+9#.

 #Detect virtual disks#
 Detect virtual disks (VHD, VHDX). This could wake up sleeping hard drives.


@DisconnectDrive
$ #Відключення мережного пристрою#
 Відключити мережний пристрій можна клавішею #Del#
з ~Меню вибору диска~@DriveDlg@.

 Опція #[x] Відновлювати при вході в систему# доступна для змін
тільки для мережних пристроїв, підключених постійно.

 Видачу підтвердження можна відключити в діалозі ~"Підтвердження"~@ConfirmDlg@


@Highlight
$ #Розфарбування файлів#
 Для більш зручного і наочного представлення файлів і папок на панелях
у Far Manager передбачена можливість кольорового виділення файлових об'єктів.
Файлові об'єкти можна поєднувати за різними критеріями (~маски файлів~@FileMasks@,
файлові атрибути) у групи і призначати власні кольори.

 Розфарбування файлів можна включити або відключити у діалозі
~Конфігурація панелей~@PanelSettings@.

 ~Змінити~@HighlightEdit@ параметри будь-якої групи розфарбування можна
з ~Меню параметрів~@OptMenu@" (пункт "Розфарбування файлів").


@HighlightList
$ #Список груп розфарбування файлів#
 Меню груп ~розфарбування файлів~@Highlight@ дозволяє маніпулювати списком.
Доступні такі сполучення клавіш:

 #Ins#          - ^<wrap>Додати нову групу розфарбування

 #F5#           - ^<wrap>Дублювати поточну групу

 #Del#          - ^<wrap>Видалити поточну групу

 #Enter# або #F4# - ^<wrap>~Змінити параметри~@HighlightEdit@ поточної групи розфарбування

 #Ctrl+R#       - ^<wrap>Відновити передвизначені групи розфарбування файлів

 #Ctrl+Up#      - ^<wrap>Пересунути групу нагору

 #Ctrl+Down#    - ^<wrap>Пересунути групу вниз

 Групи розфарбування аналізуються від початку до кінця. Якщо виявлено,
що файл належить до якої-небудь групи, то приналежність його до інших груп не перевіряється,
unless #[x] Continue processing# is set in the group.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@HighlightEdit
$ #Редагування розфарбування файлів#
 Діалог #Редагування розфарбування файлів# в ~Меню параметрів~@OptMenu@ дозволяє змінити параметри
групи розфарбування файлів. Кожне визначення групи ~включає~@Filter@:

 - одну або декілька ~масок файлів~@FileMasks@;

 - атрибути включення або виключення:
   #[x]# - ^<wrap>inclusion attribute - file must have this attribute.
   #[ ]# - ^<wrap>exclusion attribute - file must not have this attribute.
   #[?]# - ^<wrap>ignore this attribute;

 - ^<wrap>кольори звичайного імені, відзначеного імені, імені під
курсором і відзначеного імені під курсором. Якщо ви хочете
використати колір за замовчуванням, встановіть колір у "Чорний на чорному";

 - ^<wrap>маркування для позначення файлiв, що належать до групи.
Воно може бути використане як разом з кольоровим виділенням, так і замість нього.

 Файл належить до групи розфарбування, якщо:
 - ^<wrap>включений аналіз масок і його ім'я відповідає хоча б одній
масці (якщо аналіз масок відключений, то ім'я файла не має значення);
 - він має всі атрибути включення;
 - він не має атрибутів виключення.

 Атрибути "Стиснутий", "Зашифрований" Not indexed, Sparse, Temporary and Reparse point
використовуються тільки на дисках з файловою системою NTFS. The #Integrity stream# and
#No scrub data# attributes are supported only on ReFS volumes starting from
Windows Server 2012.


@ViewerSettings
$ #Конфігурація програми перегляду#
 У цьому діалозі можна змінити параметри зовнішньої і вбудованої ~програми перегляду~@Viewer@.

@=
^#Програма перегляду#
@=
 #Запускати по F3 замість Alt+F3#
 Запускати зовнішню програму перегляду по #F3# і внутрішню по #Alt+F3#.

 #Команда перегляду#
 Команда для запуску зовнішньої програми перегляду.
Для вказівки імені файла, що переглядається використовуйте ~спеціальні символи~@MetaSymbols@.

@=
^#Вбудована програма перегляду#
@=
 #Persistent selection#
 Do not remove block selection after moving the cursor.

 #Розмір табуляції#
 Кількість пробілів при показі символа табуляції.

 #Показувати стрілки зсуву#
 Якщо текст зсувається вліво або текст залишається праворуч, то у вікні перегляду збоку будуть показуватися стрілки, що вказують на це.

 #Visible '\0'#
 Show a printable character instead of space for the character '\0'.
The character to display can be set in ~far:config~@FarConfig@ #Viewer.ZeroChar#.

 #Показувати смугу прокручування#
 Показувати смугу прокручування у внутрішній програмі перегляду. Також ця опція може переключатися натисканням Ctrl+S у вікні перегляду.

@=
 #Зберігати позицію файла#
 Зберігати й відновлювати позицію у недавно переглянутих файлах. Ця опція також викликає збереження кодової сторінки, що використовувалася
при перегляді файла, у випадку якщо ця таблиця була встановлена користувачем вручну, а також ~режиму перегляду~@ViewerMode@ файла.

 #Save file code page#
 Save and restore the code page selected for a file. This is automatically enabled if #Save file position#
is enabled, as file position depends on the encoding.

 #Зберігати закладки#
 Зберігати і відновлювати закладки на поточні позиції у недавно переглянутих файлах,
збережених з використанням ПравийCtrl+0…9 або Ctrl+Shift+0…9

 #Maximum line width#
 Maximum number of columns for text mode viewer. Min=100, Max=100,000, Default=10,000.

 #Save view mode#
 Save and restore ~view modes~@ViewerMode@ of recently viewed files.

 #Save wrap mode#
 Save and restore #wrap# and #word wrap# ~modes~@ViewerMode@ of recently viewed files.

 #Detect dump view mode#
 If this option is on and Far considers the file binary, the #dump# ~mode~@ViewerMode@ is selected automatically
at the first view. Otherwise, the #text# mode is selected.

 #Авторозпізнавання кодової сторінки#
 ~Авторозпізнавання кодової сторінки~@CodePageAuto@ файла, що редагується.

 #Default code page#
 Allows to select the default code page.

@=
 Якщо зовнішня програма перегляду призначена на клавішу #F3#, вона буде запускатися тільки у тому випадку,
коли ~асоцiйована~@FileAssoc@ програма перегляду для даного типу файлів відсутня.

 Зміни конфігурації не впливають на раніше відкриті вікна вбудованої програми перегляду.

 Діалог конфігурації можна також викликати з ~програми перегляду~@Viewer@,
натиснувши #Alt+Shift+F9#. Зміни наберуть сили негайно, але діяти будуть
тільки на поточний сеанс роботи.


@EditorSettings
$ #Конфігурація редактора#
 У цьому діалозі можна змінити параметри зовнішнього та ~вбудованого редактора~@Editor@, що використовуються за замовчуванням.

@=
^#Зовнішній редактор#
@=
 #Запускати по F4#
 Запускати зовнішній редактор по #F4# замість #Alt+F4#.

 #Команда редагування#
 Команда для запуску зовнішнього редактора.
Для вказівки імені файла, що редагується використовуйте ~спеціальні символи~@MetaSymbols@.

@=
^#Вбудований редактор#
@=
 #Do not expand tabs#
 Do not convert tabs to spaces while editing the document.

 #Expand newly entered tabs to spaces#
 While editing the document, замінювати newly entered #Tab# на відповідну кількість пробілів.
Other tabs won't be converted.

 #Expand all tabs to spaces#
 Upon opening the document, all tabs in the document will be automatically converted to spaces.

 #Постійні блоки#
 Не знімати позначення блоку при переміщенні курсору.

 #Del видаляє блоки#
 Якщо є позначений блок, Del буде видаляти цей блок, а не символ під курсором.

 #Автовідступ#
 Включає режим автовідступу при введенні тексту.

 #Розмір табуляції#
 Кількість пробілів при показі символа табуляції.

 #Show white space#
 Make while space characters (spaces, tabulations, line breaks) visible.

 #Курсор за межами рядка#
 Дозволити переміщення курсору за межі рядка.

 #Select found#
 Found text is selected.

 #Cursor at the end#
 Place the cursor at the end of the found block.

 #Show a scrollbar#
 Show a scrollbar.

@=
 #Зберігати позицію файла#
 Зберігати й відновлювати позицію у недавно відредагованих файлах. Ця опція також викликає збереження кодової сторінки,
що використовувалася при редагуванні файла, у випадку якщо вона була встановлена користувачем вручну.

 #Зберігати закладки#
 Зберігати і відновлювати закладки на поточні позиції у недавно відредагованих файлах,
збережених з використанням #ПравийCtrl+0…9# або #Ctrl+Shift+0…9#

 #Allow editing files opened for writing#
 Allows to edit files that are opened by other programs for writing. This mode is handy to edit
a file opened for a long time, but it could be dangerous, if a file is being modified at the same time as editing.

 #Блокувати редагуванння файлів з атрибутом R/O#
 При відкриванні для редагування файла, який має атрибут "тільки для читання",
редактор переходить у режим заборони модифікації умісту файла так, як коли б ви натиснули Ctrl+L.

 #Попереджати при відкриванні файла з атрибутом R/O#
 Перед відкриванням для редагування файла, який має атрибут "тільки для читання", буде видаватися попереджуюче повідомлення.

 #Авторозпізнавання кодової сторінки#
 ~Авторозпізнавання кодової сторінки~@CodePageAuto@ файла, що редагується.

 #Default code page#
 Select the default code page.

 Якщо зовнішній редактор призначений на клавішу #F4#, він буде запускатися тільки у тому випадку,
коли ~асоцiйований~@FileAssoc@ редактор для даного типу файлів відсутній.

 Зміни конфігурації не впливають на раніше відкриті вікна редактора.

 Діалог конфігурації можна також викликати з ~редактора~@Editor@,
натиснувши #Alt+Shift+F9#. Зміни наберуть сили негайно, але діяти будуть
тільки на поточний сеанс роботи.


@CodePageAuto
$ #Autodetect code pages#
 Far will try to choose the correct code page for viewing/editing a file.
Note that correct detection is not guaranteed, especially for small or
non-typical text files.

 See also the ~Code pages~@CodePagesMenu@ menu and
~far:config Codepages.NoAutoDetectCP~@Codepages.NoAutoDetectCP@


@FileAttrDlg
$ #Зміна файлових атрибутів#
 Ця команда дозволяє змінити атрибути та час як у окремих
файлів, так і у груп файлів та папок.

 #Файлові атрибути#

 Для виділених об'єктів (файлів і папок) контрольні перемикачі мають три стани:

 #[x]# - атрибут установлений для всіх об'єктів
       (установити в усіх)

 #[ ]# - атрибут скинутий для всіх об'єктів
       (скинути в усіх)

 #[?]# - атрибут мають не всі об'єкти
       (не змінювати цей атрибут)

 Якщо виділені об'єкти мають однакові атрибути, то контрольні
перемикачі будуть 2-х позиційними - встановити/скинути. Виняток
складає випадок, коли серед виділених об'єктів зустрічаються папки -
у цьому випадку всі контрольні перемикачі будуть 3-х позиційними.

 Якщо стан контрольних перемикачів на момент виконання команди
встановлення атрибутів не змінився (у порівнянні з початковим
станом), то зазначений атрибут змінюватися не буде.

 Атрибути #Стиснутий#, #Зашифрований#, #Not indexed#, #Sparse#, #Temporary#,
#Offline#, #Reparse point# можуть бути змінені тільки на дисках із файловою системою NTFS.
Aтрибути #Стиснутий#" та #Зашифрований# взаємовиключні, тобто можна виставити тільки один із них.
You cannot clear the #Sparse# attribute in Windows 2000/XP/2003. The
#Integrity stream# and #No scrub data# attributes are supported only on ReFS volumes starting from
Windows Server 2012.

 Для ~символічних зв'язків~@HardSymLink@ у діалозі відображається інформація про оригінальну шлях.
If this information is not available, then the "#(data not available)#" message will be shown.

 #Дата й час#

 Підтримуються чотири різних часи файла:
 - час останньої модифікації;
 - час створення;
 - час останнього доступу;
 - change time.

 Для дисків із файловою системою FAT години, хвилини й секунди
часу останнього доступу завжди дорівнюють нулю.

 Якщо ви не хочете змінювати час файла, залиште відповідне поле
порожнім. Ви можете натиснути кнопку #Чисто#, щоб очистити всі поля
з датами й часом, після чого поміняти окрему складову дати чи часу,
наприклад, тільки місяць або тільки хвилини. Iнші значення полів
залишаються незмінними.

 Кнопка #Поточний# дозволяє заповнити поля часу файла поточним часом.
 Кнопка #Вихідний# заповнює поля часу файла оригінальними значеннями.
Доступна для одиночного файлового об'єкта.

 The #System properties# button invoke the system properties dialog for
selected objects.


@FolderShortcuts
$ #Посилання на папки#
 Посилання на папки дозволяють забезпечити швидкий доступ до
папок, що часто використовуються. Для створення посилання на поточну
папку треба натиснути #Ctrl+Shift+0…9#. Після цього, щоб перейти до
папки, записаної у посиланні, досить натиснути ПравийCtrl+0…9. Якщо
#ПравийCtrl+0…9# натиснути у рядку редагування, то шлях посилання
буде вставлений у цей рядок.

 Пункт #Посилання на папки# у ~Меню команд~@CmdMenu@ дозволяє
переглядати, встановлювати, редагувати та видаляти посилання на папки.

 У режимі редагувания (#F4#) ви не можете створити посилання на
плагінову панель.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@FiltersMenu
$ #Фільтр файлової панелі#
 За допомогою фільтра ви можете визначити набір типів файлів with user
defined rules according to which files will be processed in the area of
operation this menu was called from.

 Меню фільтра складається з двох частин. У верхній частині
розташовані фільтри користувача, у нижній частині меню фільтра
знаходяться маски всіх файлів, що містяться у даний момент
в активній панелі (including file masks that are selected in the
current area of operation the menu was called from even if there are no files
that match those mask in the current panel).

 For the #User filters# the following commands are available:

 #Ins#        Create a new filter, an empty ~filter~@Filter@ settings
            dialog will open for you to set.

 #F4#         Edit an existing ~filter~@Filter@.

 #F5#         Duplicate an existing ~filter~@Filter@.

 #Del#        Remove a filter.

 #Ctrl+Up#    Move a filter one position up.

 #Ctrl+Down#  Move a filter one position down.

 To control the #User filters# and also the auto-generated filters (file
masks) the following commands are available:

 #Space#,              Items selected using #Space# or ‘#+#’ are
 #Plus#                marked by ‘+’. If such items are present
                     then only files that match them will be
                     processed.

 #Minus#               Items selected using ‘#-#’ are marked by ‘-’,
                     and files that match then will not be
                     processed.

 #I# and #X#             Similar to #Plus# and #Minus# respectively,
                     but have higher priority when matching.

 #Backspace#           Clear selection from the current item.

 #Shift+Backspace#     Clear selection from all items.

 Filters selection is stored in the Far configuration.

 When a filter is used in a panel, it is indicated by ‘*’ after the sort
mode letter in the upper left corner of the panel.

 Filters menu is used in the following areas:
 - ~File panel~@FilePanel@;
 - ~Copying, moving, renaming and creating links~@CopyFiles@;
 - ~Find file~@FindFile@.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@FolderDiz
$ #Folder descriptions#
 Specify names (~wildcards~@FileMasks@ are allowed) of files displayed
in the ~Info panel~@InfoPanel@ as folder descriptions.


@FileDiz
$ #Описи файлів#
 Описи можуть бути використані для того, щоб позв'язати з файлом
текстову інформацію. Описи файлів поточної папки зберігаються в цій
папці у спеціальному файлі - списку описів. У ньому на початку
кожного рядка міститься ім'я файла, що описується, і відділений від
нього пробілами текст опису.

 Описи можна проглянути у відповідних ~режимах перегляду~@PanelViewModes@
панелі файлів. За замовчуванням цими режимами є #Описи# та #Довгі описи#.

 Команда #Опис файлів# (#Ctrl+Z#) з ~Меню файлів~@FilesMenu@
призначена для додавання описів до вибраних файлів.

 Імена списків описів можуть бути змінені у діалозі #Описи файлів# з
~Меню параметрів~@OptMenu@. В цьому діалозі також можна встановити режим
оновлення локальних описів. Оновлення може бути заборонене зовсім,
дозволене, тільки якщо поточний режим перегляду файлової панелі
показує описи, або дозволене завжди. За замовчуванням Far встановлює
атрибут "Прихований" на створені списки описів, але ви можете це
заборонити, вимкнувши опцію "Встановлювати атрибут "Прихований" на
нові списки описів" у цьому ж діалозі. Також тут ви можете вказати
позицію для вирівнювання нових описів у списку описів.

 Якщо файл з описами має атрибут "Тільки для читання", то Far не
оновлює описи і після операцій перейменування/видалення файлових
об'єктів, буде виведене повідомлення про помилку. При увімкееній опції
#Оновлювати файл описів з атрибутом "Тільки для читання"# Far спробує
коректно оновити описи.

 Якщо це дозволено в конфігурації, Far оновлює описи файлів при
копіюванні, перенесенні та видаленні файлів. Але якщо команда обробляє
й частину файлів у вкладених папках, то для цих файлів описи не
оновлюються.

 #Use ANSI code page by default#
 By default Far uses the OEM codepage for file descriptions, both for reading and writing.
This option changes it to ANSI.

 #Save in UTF-8#
 If set, the description file will be read as OEM or ANSI, depending on the option above,
but saved in UTF-8 after you add, remove or update the descriptions.

 #Note#: these options are irrelevant when the file has the UTF-8 signature. In this case it is always read and written in UTF-8.


@PanelViewModes
$ #Конфігурація режимів перегляду панелі файлів#
 ~Панель файлів~@FilePanel@ може виводити інформацію, використовуючи
10 заданих зазделегідь режимів: короткий, середній, повний, широкий,
детальний, описи, довгі описи, власники файлів, зв'язки файлів,
альтернативний повний. Зазвичай цього досить, але, проте, при бажанні
можна змінити параметри цих режимів або навіть повністю замінит їх на нові.

 Команда #Режими панелей файлів# з меню ~Меню параметрів~@OptMenu@
дозволяє змінити параметри режимів перегляду. Спочатку вона пропонує
вибрати необхідний режим зі списку. У цьому списку режим 0 відповідає
режиму перегляду, що викликається по #ЛівийCtrl+0# (альтернативний повний),
режим 1 - короткому режиму (#ЛівийCtrl+1#), режим 2 - середньому режиму
(#ЛівийCtrl+2#) і так далі. Після вибору режиму з'являється діалог,
у якому можна змінити такі параметри:

 #Типи стовпчиків# - одна або кілька літер, відокремлених комами. Each column type starts with
a file property character, such as name, size, etc. Some file properties
may be followed by modifiers. Supported column types (properties and
their modifiers) are listed below.

 If the list of column types consists of two or more repeated groups,
the files on the panel will be listed in “stripes”. Properties of each
file will be displayed in the columns of a stripe, and the list of files
will wrap from one stripe to the next like text of a newspaper article.
If column type list cannot be properly split into the equal groups, the
files will be listed on a single stripe.

 Допускаються такі типи стовпчиків:

 N[M[D],O,R[F],N] - ім'я файла, де:
                    M - ^<wrap>показувати символи позначення, де:
                        D - dynamic selection marks;
                    O - ^<wrap>показувати імена без шляхів (призначено
                        в основному для ~модулів, що підключаються~@Plugins@);
                    R - ^<wrap>вирівнювати задовгі імена по правому краю, where:
                        F - right align all names;
                    N - ^<wrap>do not show extensions in name column;

 Цi символи можна комбінувати, наприклад NMR.

 X[R]       - file extension, where:
              R - ^<wrap>right align file extension;

 S[C,T,F,E] - розмір файла
 P[C,T,F,E] - упакований розмір файла
 G[C,T,F,E] - size of file streams, where:
              C - ^<wrap>group digits using the character from Windows settings;
              T - ^<wrap>use decimal units instead of binary,
i.e., to calculate kilobytes, the size will be divided by 1000 instead
of by 1024; in this mode unit character is shown in lower case, e.g. #k#,
#m#, #g# instead of #K#, #M#, #G#;
              F - ^<wrap>show size as a decimal fraction with
no more than three digits before decimal point, e.g. 999 bytes will
be shown as #999#, while 1024 bytes as #1.00 K#; note that the behavior
depends on whether the #T# modifier is used;
              E - ^<wrap>economic mode, no space between the
size and the unit character, e.g. #1.00k#;

 D          - дата модифікації файла;
 T          - час модифікації файла;

 DM[B,M]    - дата й час модифікації файла;
 DC[B,M]    - дата й час створення файла;
 DA[B,M]    - дата й час останнього доступу до файла;
 DE[B,M]    - file change date and time, where:
              B - короткий (в стилі Unix) формат часу файла;
              M - використання текстових імен місяців;

 A          - атрибути файла;
 Z          - опис файла;

 O[L]       - власник файла, where:
              L - show domain name;

 LN         - кількість жорстких зв'язків;

 F          - number of streams.

 Якщо опис типів стовпчиків містить більше за один стовпчик імені
файла, панель файлів буде відображатися в багатоколоночній формі.

 Атрибути файла мають такі позначення:

 #N# - Attributes not set
 #R# - Тільки для читання
 #H# - Прихований
 #S# - Системний
 #D# - Directory
 #A# - Архівний
 #T# - Temporary
 #$# - Sparse
 #L# - Reparse point
 #C# - Стиснутий
 #O# - Offline
 #I# - Not content indexed
 #E# - Зашифрований
 #V# - Integrity stream
 #?# - Virtual
 #X# - No scrub data
 #P# - Pinned
 #U# - Unpinned

 By default the size of the attributes column is 6 characters. To display
the additional attributes it is necessary to manually increase the size of the column.

 #Ширина стовпчиків# - дозволяє змінити ширину стовпчиків панелі.
Якщо ширина дорівнює 0, то використовується значення за замовчуванням.
Якщо ширина стовпчика з ім'ям, описом або власником дорівнює 0,
вона буде обчислена автоматично, у залежності від ширини панелі.
Для правильної роботи з різною шириною екрана настійно
рекомендується, щоб у кожному режимі перегляду був хоч б один
стовпчик з шириною, яка обчислюється автоматично.

 Для використання 12-годинного формату часу треба збільшити
на одиницю стандартну ширину стовпчика часу файла або стовпчика
часу й дати файла. Після подальшого збільшення у цих стовпчиках
також будуть показані секунди й мілісекунди.

 Для показу року у 4-х символьному форматі слід збільшити ширину
стовпчика дати на 2.

 Enabling links, streams and owner columns (G, LN, F and O) can significantly
slow down the directory reading.

 #Типи стовпчиків рядка статусу# і #Ширина стовпчиків рядка статусу# -
аналогічно "Типам стовпчиків" і "Ширині стовпчиків", але для рядка статусу
панелі.

 #Повноекранний режим# - показувати панель на весь екран замість
половини екрана.

 #Вирівнювати розширення файлів# - показувати розширення файлів
вирівненими.

 #Вирівнювати розширення папок# - показувати розширення папок
вирівненими.

 #Показувати папки великими літерами# - показувати всі імена папок
у верхньому регістрі, незалежно від реального регістру.

 #Показувати файли малими літерами# - показувати всі імена файлів
у нижньому регістрі, незалежно від реального регістру.

 #Показувати імена файлів із великих літер малими# - показувати всі
імена файлів, які містять тільки великі літери, малими літерами. За
замовчуванням ця опція увімкнена, але якщо ви хочете завжди бачити
справжній регістр імені файла, вимкніть її, а також
#Показувати папки великими літерами# і #Показувати файли малими літерами#.
Усі ці параметри впливають тільки на спосіб показу файлів, для їх обробки
Far завжди використовує справжній регістр.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@ColorGroups
$ #Color groups#
 Це меню дозволяє змінити кольори різних елементів інтерфейсу чи всієї палітри кольорів на ту, що пропонується за замовчуванням.

 #Set default colors#
 Set the colors to default values, expressed as indices in the console palette.

 #Set default colors (RGB)#
 Set the colors to default values, expressed as colors in RGB space, normally used for the corresponding console palette indices.
 Unlike the indices in the console palette, the RGB values are device-independent and will look the same in any terminal.
 For example, the default #index# value of panels background is #1#, which is usually, but not necessarily, mapped to some unspecified shade of blue.
 The default #RGB# value of panels background, on the contrary, is always exactly #000080#.

 #Note#: RGB colors require Virtual Terminal-based rendering, which can be enabled in ~Interface settings~@InterfSettings@.
If it is not enabled or if your terminal does not support RGB colors, they will be approximated to the closest console palette indices.

 This is the current palette:

 \00  \10  \20  \30  \40  \50  \60  \70  \-
 \80  \90  \A0  \B0  \C0  \D0  \E0  \F0  \-

 This is the default RGB representation:

 \(T0:T000000)  \(T0:T000080)  \(T0:T008000)  \(T0:T008080)  \(T0:T800000)  \(T0:T800080)  \(T0:T808000)  \(T0:TC0C0C0)  \-
 \(T0:T808080)  \(T0:T0000FF)  \(T0:T00FF00)  \(T0:T00FFFF)  \(T0:TFF0000)  \(T0:TFF00FF)  \(T0:TFFFF00)  \(T0:TFFFFFF)  \-


@ColorPicker
$ #Color Picker#
 This dialog allows to define a foreground color, a background color and a text style.

 The foreground and the background colors can be either:
 - one of the 16 colors from the standard Windows Console pallete,
 - one of the 256 colors from the ANSI pallette, or
 - one of the 16 million colors from the RGB color space.

 The standard 16-color palette is available in the dialog.
 To access the ~256-color palette~@ColorPicker256@ and the ~RGB color space~@ColorPickerRGB@ use the corresponding buttons.

 #Default# is the color used by your terminal when no colors are specified explicitly, e.g. \(800000:800000) C:\> \-.
 Usually it is one of the palette colors, e.g. \(7:0)silver on black\-, but not necessarily: some terminals could handle it differently, e.g. render as translucent.

 The color value is also represented in the hexadecimal form for convenience, where:
 - #AA______# - the alpha channel, representing the degree of transparency from fully transparent (00) to fully opaque (FF).
 - #______##### - the palette index from 00 to FF.
 - #__RRGGBB# - the red, green and blue channels in the RGB color space, from 00 to FF each.

 Palette indices 00-0F are arranged in Windows/DOS/CGA/IBM PC order, not ANSI (e.g. color ##1 is blue, not red).

 When the color is not fully opaque, the previous color in the logical Z-order is taken into account.

 The foreground text style can include ANSI/VT100-like attributes listed in the right section.
 When #Inherit# is checked, the previous foreground text style in the logical Z-order is taken into account.

 Default:   \(7:0) Example \-
 Bold:      \(7:0:bold) Example \-
 Italic:    \(7:0:italic) Example \-
 Overline:  \(7:0:overline) Example \-
 Strikeout: \(7:0:strikeout) Example \-
 Faint:     \(7:0:faint) Example \-
 Blink:     \(7:0:blink) Example \-
 Inverse:   \(7:0:inverse) Example \-
 Invisible: \(7:0:invisible) Example \-
 Underline:
   Single:  \(7:0:underline) Example \-
   Double:  \(7:0:underline_double) Example \-
   Curly:   \(7:0:underline_curly) Example \-
   Dotted:  \(7:0:underline_dot) Example \-
   Dashed:  \(7:0:underline_dash) Example \-

 The preview section below displays the final result.

 #Attention#
 Only the standard 16-color palette is guaranteed to work everywhere.
 Support for everything else is conditional and defined by your terminal.

 Extended colors and styles require Virtual Terminal-based rendering, which can be enabled in ~Interface settings~@InterfSettings@.
You can find more about it ~here~@https://docs.microsoft.com/en-us/windows/console/classic-vs-vt@.


@ColorPicker256
$ #256 Color Picker#
 This dialog allows to pick a color from the 256-color ANSI pallette.

 The first 16 colors are the same as the standard palette and are available in the ~main dialog~@ColorPicker@.

 \00  \10  \20  \30  \40  \50  \60  \70  \-
 \80  \90  \A0  \B0  \C0  \D0  \E0  \F0  \-

 The next 216 colors are represented as a 6x6x6 cube. The palette usually has 6 levels for every primary color and forms a homogeneous RGB cube.
 Use the buttons on the right to rotate the cube, access its inner levels or mix the primary colors directly.

 \(:10)  \(:11)  \(:12)  \(:13)  \(:14)  \(:15)  \-  \(:34)  \(:35)  \(:36)  \(:37)  \(:38)  \(:39)  \-  \(:58)  \(:59)  \(:5A)  \(:5B)  \(:5C)  \(:5D)  \-
 \(:16)  \(:17)  \(:18)  \(:19)  \(:1A)  \(:1B)  \-  \(:3A)  \(:3B)  \(:3C)  \(:3D)  \(:3E)  \(:3F)  \-  \(:5E)  \(:5F)  \(:60)  \(:61)  \(:62)  \(:63)  \-
 \(:1C)  \(:1D)  \(:1E)  \(:1F)  \(:20)  \(:21)  \-  \(:40)  \(:41)  \(:42)  \(:43)  \(:44)  \(:45)  \-  \(:64)  \(:65)  \(:66)  \(:67)  \(:68)  \(:69)  \-
 \(:22)  \(:23)  \(:24)  \(:25)  \(:26)  \(:27)  \-  \(:46)  \(:47)  \(:48)  \(:49)  \(:4A)  \(:4B)  \-  \(:6A)  \(:6B)  \(:6C)  \(:6D)  \(:6E)  \(:6F)  \-
 \(:28)  \(:29)  \(:2A)  \(:2B)  \(:2C)  \(:2D)  \-  \(:4C)  \(:4D)  \(:4E)  \(:4F)  \(:50)  \(:51)  \-  \(:70)  \(:71)  \(:72)  \(:73)  \(:74)  \(:75)  \-
 \(:2E)  \(:2F)  \(:30)  \(:31)  \(:32)  \(:33)  \-  \(:52)  \(:53)  \(:54)  \(:55)  \(:56)  \(:57)  \-  \(:76)  \(:77)  \(:78)  \(:79)  \(:7A)  \(:7B)  \-

 \(:7C)  \(:7D)  \(:7E)  \(:7F)  \(:80)  \(:81)  \-  \(:A0)  \(:A1)  \(:A2)  \(:A3)  \(:A4)  \(:A5)  \-  \(:C4)  \(:C5)  \(:C6)  \(:C7)  \(:C8)  \(:C9)  \-
 \(:82)  \(:83)  \(:84)  \(:85)  \(:86)  \(:87)  \-  \(:A6)  \(:A7)  \(:A8)  \(:A9)  \(:AA)  \(:AB)  \-  \(:CA)  \(:CB)  \(:CC)  \(:CD)  \(:CE)  \(:CF)  \-
 \(:88)  \(:89)  \(:8A)  \(:8B)  \(:8C)  \(:8D)  \-  \(:AC)  \(:AD)  \(:AE)  \(:AF)  \(:B0)  \(:B1)  \-  \(:D0)  \(:D1)  \(:D2)  \(:D3)  \(:D4)  \(:D5)  \-
 \(:8E)  \(:8F)  \(:90)  \(:91)  \(:92)  \(:93)  \-  \(:B2)  \(:B3)  \(:B4)  \(:B5)  \(:B6)  \(:B7)  \-  \(:D6)  \(:D7)  \(:D8)  \(:D9)  \(:DA)  \(:DB)  \-
 \(:94)  \(:95)  \(:96)  \(:97)  \(:98)  \(:99)  \-  \(:B8)  \(:B9)  \(:BA)  \(:BB)  \(:BC)  \(:BD)  \-  \(:DC)  \(:DD)  \(:DE)  \(:DF)  \(:E0)  \(:E1)  \-
 \(:9A)  \(:9B)  \(:9C)  \(:9D)  \(:9E)  \(:9F)  \-  \(:BE)  \(:BF)  \(:C0)  \(:C1)  \(:C2)  \(:C3)  \-  \(:E2)  \(:E3)  \(:E4)  \(:E5)  \(:E6)  \(:E7)  \-

 The last 24 colors are usually defined as a grayscale ramp.

 \(:E8)  \(:E9)  \(:EA)  \(:EB)  \(:EC)  \(:ED)  \(:EE)  \(:EF)  \(:F0)  \(:F1)  \(:F2)  \(:F3)  \(:F4)  \(:F5)  \(:F6)  \(:F7)  \(:F8)  \(:F9)  \(:FA)  \(:FB)  \(:FC)  \(:FD)  \(:FE)  \(:FF)  \-


@ColorPickerRGB
$ #RGB Color Picker#
 This dialog allows to pick a color from the RGB color space.

 The 16 777 216 RGB colors are represented as a 16x16x16 hypercube.

 Use the buttons on the right to rotate the cube, access its inner levels or mix the primary colors directly.

 Each of the 4096 cells in the hypercube represents a 16x16x16 cube with RGB colors. To switch between the cubes use the #↔# button.

 The #«# button allows to save the selected color to the custom palette for quick access.

 The #System# button opens the system RGB color picker.


@SortGroups
$ #Групи сортування#
 Групи сортування можуть застосовуватися у ~панелі файлів~@FilePanel@
спільно з сортуванням #за ім'ям# або #за розширенням#.
Вони активізуються при натисненні #Shift+F11# і дозволяють задати правила
сортування файлів, доповнюючи вже діючі.

 Кожна група сортування складається з однієї або кількох відокремлених
комами ~масок файлів~@FileMasks@. Якщо позиція однієї групи сортування
у загальному списку груп вище, ніж у іншої групи, то при сортуванні
за зростанням усі файли, що належать до цієї групи, будуть вище,
ніж ті що належать до іншої групи.

 Команда #Групи сортування# з ~Меню команд~@CmdMenu@ дозволяє
видаляти, створювати й редагувати групи сортування, використовуючи
клавіші Del, Ins та F4. Групи, що знаходяться вище за роздільник меню,
відносяться на початок файлової панелі, й усі файли, що попали у ці групи,
будуть розташовані вище за файли, що не попали в них. Групи, що знаходяться
нижче роздільника меню, відносяться до кінця файлової панелі, й усі файли,
що попали у ці групи, будуть розташовані нижче за файли, що не попали в них.


@FileMasks
$ #Маски файлів#
 Маски файлів часто використовуються у командах Far для вибору окремих
файлів і папок або їх груп. Маски можуть включати звичайні допустимі
у іменах файлів символи, ‘*’ і ‘?’, а також спеціальні вирази:

 #*#           будь-яка кількість символів;

 #?#           будь-який символ;

 #[cx-z]#      будь-який символ з тих, що знаходяться у квадратних
             дужках. Допускаються як окремі символи, так і їх
             діапазони.

 Наприклад, файли ftp.exe, fc.exe та f.ext можуть бути вибрані за
допомогою маски f*.ex?, маска *co* вибере і color.ini, і edit.com,
маска [c-ft]*.txt може вибрати config.txt, demo.txt, faq.txt та tips.txt.

 У багатьох командах Far можна задати кілька відокремлених комами
або крапками з комами масок. Наприклад, щоб вибрати всі документи, ви можете
ввести #*.doc,*.txt,*.wri# у командi "Помiтити групу".

 Допускається брати кожну з масок (але не весь список) у лапки.
Наприклад, це потрібно робити, якщо маска містить один із символів-роздільників
(кому або крапку з комою), щоб така маска не була поплутана зі списком.

 File mask surrounded with slashes #/# is treated as ~Perl regular expression~@RegExp@.

 Example:
 #/(eng|rus)/i# - any files with filenames containing string “eng” or “rus”,
the character case is not taken into account.

 #Маска винятку# це одна або кілька масок файлів, якій не повинні
відповідати імена необхідних файлів, вона відокремлюється від основної
маски символом ‘#|#’.

 Приклади використання масок винятку:

 1. *.cpp
    Усі файли з розширенням cpp.
 2. *.*|*.bak,*.tmp
    Усі файли, крім файлів з розширенням bak і tmp.
 3. *.*|
    Помилка - уведений спецсимвол |, але сама маска винятку не
    зазначена.
 4. *.*|*.bak|*.tmp
    Помилка - спецсимвол | не може зустрічатися більш одного разу.
 5. |*.bak
    Обробляється як *|*.bak
 6. *.*|/^pict\d{1,3}\.gif$/i
    All files except for pict0.gif — pict999.gif, disregard the character case.

 Через кому (або крапку з комою) перелічуються маски файлів, а за
допомогою '|' маски включення відокремлюються від масок винятку.

 File masks can be joined into ~groups~@MaskGroupsSettings@.


@SelectFiles
$ #Помiтка файлiв#
 Для обробки файлів і папок ~панелі файлів~@FilePanel@
вони можуть бути вибрані. Якщо жоден файл не вибраний,
то буде оброблений тільки файл під курсором.

 #Keyboard Selection#

 #Ins# позначає файл під курсором і переміщує курсор униз.

 #Shift+Клавіша курсору# дозволяють переміщувати курсор у різних
напрямках. The action (selection or deselection) depends
on the state of the item under cursor before pressing the key
combination.

 #Gray +# і #Gray -# вибирають або знімають позначення з групи
з використанням однієї або кількох відокремлених комами
~масок файлів~@FileMasks@. #†#

 #Gray *# інвертує поточне позначення. #†#

 #Ctrl+<Gray +># і #Ctrl+<Gray -># вибирають або знімають позначення
з усіх файлів з тим же розширенням, що й у файла під курсором. #†#

 #Alt+<Gray +># і #Alt+<Gray -># вибирають або знімають позначення
з усіх файлів з тим же ім'ям, що й у файла під курсором. #†#

 #Shift+<Gray +># i #Shift+<Gray -># вибирають або знімають
позначення з усіх файлiв. #†#

 #Ctrl+<Gray *># інвертує поточне позначення, включаючи папки.

 #Alt+<Gray *># inverts the current selection on files only,
folders are deselected.

 #Ctrl+M# відновлює обрану до цього групу.

 #Mouse Selection#

 #Right click# toggles selection on the clicked item and moves the
cursor to it. See also #Right click selects files# option of the
~Panel settings~@PanelSettings@ dialog.

 #Right click and hold# on the #status line# or #column titles# moves
the cursor forward or backward respectively, while selecting
or deselecting items along the way. The action (selection
or deselection) depends on the state of the item under cursor before the
click.

 ────────────────
 #†# If the #Select folders# option of the
~Panel settings~@PanelSettings@ dialog is off, only files are selected
or deselected. Otherwise, the selection on the folders is changed as well.


@CopyFiles
$ #Копіювання, перенесення, перейменування та створення зв'язків#
 Для копіювання, перенесення та перейменування файлів і папок
можуть бути використанi такі команди:

 Копіювати ~вибрані~@SelectFiles@ файли                                       #F5#

 Копіювати файл під курсором незалежно                   #Shift+F5#
 від позначення

 Перейменувати або перенести вибрані файли                     #F6#

 Перейменувати або перенести файл під курсором           #Shift+F6#
 незалежно від позначення

 Створення ~зв'язків~@HardSymLink@ файлів і папок                         #Alt+F6#

 For a folder: if the folder at the specified target path (relative
or absolute) exists, the source folder will be copied / moved inside the
target folder. Otherwise, a new folder will be created at the target
path and the contents of the source folder will be copied / moved into
the newly created folder.

 For example, when moving #c:\folder1\# to #d:\folder2\#:

 - ^<wrap>if #d:\folder2\# exists, the contents of #c:\folder1\# will be moved into
#d:\folder2\folder1\#. Otherwise, the contents of #c:\folder1\# will be moved into the newly
created #d:\folder2\#.

 Якщо увімкнена опція "#Обробляти кілька імен файлів#", то в рядку
введення може вказуватися як одна ціль для копіювання або переміщення,
так і декілька. В останньому випадку цілі повинні бути розділені
символом-роздільником "#;#" або "#,#". Якщо ціль містить у своєму імені
символ ";" (або ","), то ця ціль повинна бути узята в лапки.

 Якщо ви хочете створити папку призначення перед копіюванням,
додайте до її імені зворотну риску.

 If ~Panel.Tree.TurnOffCompletely~@Panel.Tree.TurnOffCompletely@
parameter in ~far:config~@FarConfig@ is set to “false,” you can use
~Find folder~@FindFolder@ dialog to select the target path.
 The following shortcuts open the dialog with different pre-selected folders:
 - ^<wrap>#F10# для вибору папки з дерева активної файлової панелі.
 - ^<wrap>#Alt+F10# для вибору з дерева пасивної файлової панелі.
 - ^<wrap>#Shift+F10# дозволяє відкрити дерево з урахуванням шляху, що міститься
у рядку введення (якщо там перераховано кілька шляхів, то враховується
тільки перший з них).

Якщо увімкнено опцію "#Обробляти кілька імен файлів#",
то обрана папка додається до вмісту рядка введення через крапку з комою.

 Можливість копіювання, перенесення й перейменування файлів
для модулів, що підключаються залежить від функціональності конкретного
модуля.

 Параметр  "Копіювати права доступу" може використовуватися
тільки для файлової системи NTFS і дозволяє копіювати інформацію
про права доступу до файла.
The #Default# option leaves access rights processing to the operating system.
The #Copy# option applies the access rights of the original objects. The
#Inherit# option applies the inheritable access rights of the
destination’s parent folder.

 The “#Already existing files#” parameter controls Far behavior
if the target file with the same name already exists.

 Possible values:
 - ^<wrap>#Ask# - a ~confirmation dialog~@CopyAskOverwrite@ will be shown;
 - #Overwrite# - all target files will be replaced;
 - #Skip# - target files will not be replaced;
 - #Rename# - existing target files will stay unchanged, copied files will be renamed;
 - #Append# - target file will be appended with the file being copied;
 - #Only newer file(s)# - тільки файли з новішими датою та часом модифікації
will be copied;
 - #Also ask on R/O files# - controls whether an additional confirmation
dialog should be displayed for the read-only files.

 Параметр “#Використати системну функцію копіювання#” з діалогу ~Системні параметри~@SystemSettings@
вмикає використання функції Windows CopyFileEx замість внутрішньої реалізації копіювання файлів.
Це може бути корисне на NTFS, оскільки CopyFileEx копіює розширені атрибути файлів. If this option is off, the internal
implementation of the file copy routine is used. The internal
function is also used if the source file is encrypted and is being
copied to a different volume.

 The “#Copy contents of symbolic links#” parameter controls the
~logic~@CopyRule@ of ~symbolic links~@HardSymLink@ processing.

 При перенесенні файлів для визначення того, чи має операція
здійснюватися як копіювання з наступним видаленням чи як пряме
перенесення (у межах одного фізичного диска), Far враховує
~символічні зв'язки~@HardSymLink@.

 Far обробляє спробу копіювання до #con# так само, як і копіювання у
#nul# або у #\\\\.\\nul# - тобто, файл читається з диска, але нікуди не
записується.

 В операції переміщення в #nul#, #\\\\.\\nul# або #con# видалення файлів
не провадиться.

 Стан опцій "Копіювати права доступу" і "Тільки нові/оновлені файли"
діє тільки на поточний сеанс копіювання.

 To copy only the files that match the user defined criteria, check
the #Use filter# checkbox, then press the #Filter# button to open the
~filters menu~@FiltersMenu@. Remember that if you copy a folder and none
of the files in it match the criteria, the empty folder will #not# be
created at the destination.


@CopyAskOverwrite
$ #Copying: confirmation dialog#
 If a file of the same name exists in the target folder the user will be
prompted to select on of the following actions:

 #Overwrite# - target file will be replaced;

 #Skip# - target file will not be replaced;

 #Rename# - existing file will not be changed, a new name will be given to
the file being copied;

 #Append# - target file will be appended with the file being copied;

 If #Remember choice# is checked, the selected action will be applied to
all existing files and the confirmation dialog will not be displayed again for
the current copying session.

 If sizes and last modification dates are not enough for you to make a decision,
you can try to inspect the content of the files with internal viewer by moving the cursor
to any of them and pressing the F3 key.


@CopyRule
$ #Copying: rules#
 When ~copying/moving~@CopyFiles@ folders and/or
~symbolic links~@HardSymLink@ the following rules apply:

 #Copying of symbolic links#

 If the "Copy contents of symbolic links" option is on or the source or the
destination are remote disks, then a folder will be created at the destination
and the contents of the source symbolic link will be copied to it (recursively
for enclosed links).

 If the "Copy contents of symbolic links" option is off and the source and
the destination are local disks, then a symbolic link pointing to the source
symbolic link will be created at the destination.

 #Moving of symbolic links#

 If the "Copy contents of symbolic links" option is on or the source or the
destination are remote disks, then a folder will be created at the destination
and the contents of the source symbolic links will be copied to it (recursively
for enclosed links). The source symbolic link is then deleted.

 If the "Copy contents of symbolic links" option is off and the source and
the destination are local disks, then the source symbolic link will be moved to
the destination. Recursive descent of the tree will not be made.

 #Moving of a folder, than contains symbolic links#

 If the source and the destination are local disk, then the folder will be
moved as a normal folder.

 If the source or the destination are remote disks, then with no regard to
the "Copy contents of symbolic links" option a folder will be created in the
destination and the contents of the source symbolic link will be copied to it
(recursively for enclosed links). The source symbolic link is then deleted.


@HardSymLink
$ #Жорсткі й символічні зв'язки#
 На розділах NTFS також можна створювати #жорсткі# (HardLink) зв'язки
для файлів та #символічні# (SymLink) для папок за допомогою команди #Alt+F6#.

 #Жорсткі зв'язки#

 Жорсткий зв'язок (HardLink) - це просто ще один запис у папці для
даного файла. Якщо створюється жорсткий зв'язок, сам файл не копіюється фізично,
а тільки з'являється під ще одним ім'ям або в ще одному місці, а його
старі ім'я і місцезнаходження залишаються недоторканими. З цього
моменту жорсткий зв'язок #невідрізняється# від початкового запису
в папці. Єдина відмінність - те, що для жорсткого зв'язку не
створюється коротке ім'я файла, тому з програм DOS його не видно.

 Якщо змінюється розмір або дата файла, усі відповідні записи у
папках обновлюються автоматично. При видаленні файла він не видаляється
фізично доти, поки усі жорсткі зв'язки, що вказують на нього, не будуть
видалені. Порядок їхнього видалення значення не має. При видаленні
жорсткого зв'язку до кошика кількість зв'язків у файла зберігається.

 Far уміє створювати жорсткі зв'язки, відображати кількість жорстких
зв'язків для кожного файла у окремому стовпчику (за замовчуванням це
останній стовпчик у 9-му режимі панелей), а також сортувати файли за
кількістю жорстких зв'язків.

 Створювати жорсткі зв'я-зки можна тільки на тому ж диску, на
якому розташований вихідний файл.

 #Зв'язки директорій#

 Зв'язки директорій дозволяють відображати будь-які
локальні папки на будь-які інші локальні папки. Наприклад, якщо папка
D:\\JUNCTION указує на C:\\WINNT\\SYSTEM32 як свою ціль, то програма,
що звертається до D:\\JUNCTION\\DRIVERS, буде насправді звертатися до
C:\\WINNT\\SYSTEM32\\DRIVERS.

 Directory junctions can not point to network folders.

 У Windows 2000 прямо створювати символічні зв'язки на папки CD-ROM не можна, але
можна це обмеження обійти, змонтувавши CD-ROM диск на папку
NTFS-розділу.

 #Symbolic links#

 NTFS supports symbolic links starting from Windows Vista (NT 6.0). It's an
improved version of directory junctions - symbolic links can also point to files
and non-local folders, relative paths also supported.

 By default, only members of "Administrators" group can create symbolic links,
this can be changed in the local security settings.


@ErrCopyItSelf
$ #Помилка: копіювання/перенесення "у самого себе"#
 Ви не можете копіювати/переносити файл або папку "у самого себе".

 Дана помилка також виникає якщо є дві папки,
одна з яких є ~символічним зв'язком~@HardSymLink@ на іншу.


@WarnCopyEncrypt
$ #Warning: Losing file encryption#
 The source file is encrypted. Copying or moving it outside of the current
disk is possible if in the destination the file will be decrypted.

 The "Ignore" (or "Ignore all") buttons ignore the given warning and copy
the file unencrypted to the destination.

 The internal copying mechanism will be used for copying encrypted files
outside of the current disk with no regard to the "Use system copy routine"
option.


@WarnCopyStream
$ #Попередження: Вихідний файл містить більш одного потоку даних#
 Вихідний файл містить більш одного потоку даних або файлова система
призначення не підтримує багато потоковість файлових об'єктів.

 Потоки - це можливість файлової системи NTFS, що дозволяє
асоціювати з файлом додаткову інформацію (наприклад, відомості про
його автора, назву, ключові слова і т.д., а також будь-які інші
дані). Ця інформація зберігається разом з файлом і ніяк не видна при
використанні програм, що не підтримують потоки. Зокрема, потоки
використовує Windows Explorer для збереження
додаткових властивостей файла. Файлові системи FAT/FAT32 не
підтримують потоки.

 Для того, щоб скопіювати файловий об'єкт цілком (із усіма потоками),
увімкніть опцію #"Використовувати системну функцію копіювання"# у діалозі
~Системні параметри~@SystemSettings@.

 Якщо ви копіюєте багатопоточний файловий об'єкт на том, відмінний
від NTFS, то й у цьому випадку втратите дані - буде скопійований
тільки основний потік.


@ErrLoadPlugin
$ #Помилка: плагін не завантажений#
 Ця помилка з'являється у випадках, коли:

 1. ^<wrap>Для нормальної роботи DLL-модуля потрібна динамічна бібліотека, що відсутня у вашій системі.
 2. ^<wrap>Модуль з якоїсь причини повернув системі інформацію про неприпустимість подальшого завантаження.
 3. ^<wrap>DLL-модуль плагина зіпсований.


@ScrSwitch
$ #Перемикання між екранами#
 Far дозволяє відкрити декілька копій вбудованої програми перегляду
та редактора. Використовуйте #Ctrl+Tab#, #Ctrl+Shift+Tab# або #F12# для
перемикання між панелями та екранами з цими копіями. #Ctrl+Tab#
перемикає на наступний екран, #Ctrl+Shift+Tab# на попередній,
#F12# виводить список усіх доступних екранів.

 Кількість фонових екранів редагування та перегляду відображається
у верхньому лівому кутку лівої панелі. Ви можете заборонити показ кількості
екранів, використовуючи діалог ~Конфігурація панелей~@PanelSettings@.

 See also: common ~menu~@MenuCmd@ keyboard commands.


@ApplyCmd
$ #Застосувати команду#
 Використовуючи пункт #Застосувати команду# із ~Меню файлів~@FilesMenu@,
можна застосувати команду до кожного позначеного файла. Для позначення
імені файла слід використовувати ті ж ~символи~@MetaSymbols@, що
і в ~Асоціаціях файлів~@FileAssoc@.

 Наприклад, 'type !.!' буде виводити на екран усі позначені файли
по черзі, а команда 'rar32 m !.!.rar !.!' перенесе всі позначені файли
до одноіменних RAR-архівів. Команда 'explorer /select,!.!' запустить
Провідника й встановить курсор на поточний файл чи папку.

 Див. також ~"Команди операційної системи"~@OSCommands@


@OSCommands
$ #Команди операційної системи#
 Far Manager самостійно обробляє наступні команди операційної системи
internally, without invoking operating system command processor:

 #CLS#
 Очищення екрана.

 #disk:#
 Змінити поточний диск панелі на зазначений “disk”.

 #CD [disk:]path# або #CHDIR [disk:]path#
 Змінити поточний шлях панелі на зазначений "path". Якщо зазначено ім'я
диска, змінюється так само і диск. Якщо активна панель відображає файлову
систему, підтримувану ~зовнішнім модулем~@Plugins@, те команда "CD" у
командному рядку може бути використана для зміни поточної папки цієї
файлової системи. На відміну від "CD" команда "CHDIR" завжди сприймає
зазначений параметр як ім'я реальної папки, поза залежністю від типу файлової панелі.
 The #CD ~~# command changes to the home directory (if there is no
real “~~” file or directory in the current directory). The home
directory is specified in the #Use home dir# option of the
~Command line settings~@CmdlineSettings@ dialog. By default, it is the
string “%FARHOME%” denoting the Far Manager home directory.

 #CHCP [nnn]#
 Вивід або зміна поточного номера кодової сторінки. “nnn” - номер кодової
сторінки. “CHCP” без параметра покаже поточний номер кодової сторінки.

 #SET variable=[string]#
 Установити змінну середовища “variable” у значення “string”. Якщо
“string” не зазначено, то змінна середовища “variable” буде видалена. Деякі
~змінні середовища~@FAREnv@ Far Manager установлює при старті самостійно.

 #IF [NOT] EXIST filename command#
 Виконати команду “command” якщо існує “filename”, або не існує
(якщо вказано префікс “NOT”).

 #IF [NOT] DEFINED variable command#
 Виконати команду “command” якщо існує змінна середовища “variable”, або не існує
(якщо вказано префікс “NOT”).
 Команди “IF” можуть бути вкладеними. У наступному прикладі команда “command”
буде виконана тільки в тому випадку, якщо існує файл “file1” і
не існує файл “file2” і визначена змінна середовища “variable”:
 #if exist file1 if not exist file2 if defined variable command#

 #PUSHD [path]#
 Stores the current path for use by the “POPD” command.
If “path” is specified, changes the current path on the active panel to it.

 #POPD#
 Changes the current path on the active panel to that stored by the “PUSHD” command.

 #CLRD#
 Clears the stack of paths stored by the “PUSHD” command.

 #TITLE [string]#
 Sets the “string” as the permanent title of the Far Manager console
window. The title will not change with switching between panels, nor
with the commands being executed, nor with the #Far window title# option
of the ~Interface settings~@InterfSettings@ dialog. The “string” preset
will be used until the end of the current session or until the default
behavior is restored by the “TITLE” command with no parameters.

 #EXIT#
 Exits Far Manager.

 Примітки:

 1. ^<wrap>Якщо синтаксис команд відрізняється від зазначених, то
Far Manager передає керування командному процесорові операційної системи.
 2. ^<wrap>Перераховані команди працюють у:
 - ~Командному рядку~@CmdLineCmd@
 - ~Застосувати команду~@ApplyCmd@
 - ~Меню користувача~@UserMenu@
 - ~Асоціаціях файлів~@FileAssoc@


@FAREnv
$ #Змінні середовища#
 Після запуску Far Manager виставляє такі змінні середовища, які
доступні дочірнім процесам:

 #FARHOME#            ^<wrap>path to the folder containing main Far executable module.

 #FARPROFILE#         ^<wrap>path to the folder containing roaming user data (Far & plugins settings, additional plugins etc.)

 #FARLOCALPROFILE#    ^<wrap>path to the folder containing local user data (histories, plugin cache etc.)

 #FARLANG#            ^<wrap>назва поточної мови інтерфейсу.

 #FARUSER#            ^<wrap>ім'я користувача, зазначене у параметрі /u ~командного рядка~@CmdLine@.

 #FARDIRSTACK#        ^<wrap>the contents of directories stack top (the stack is managed with #pushd# and #popd# commands)

 #FARADMINMODE#       ^<wrap>equals "1" if Far Manager is running under an administrator account.


@RegExp
$ #Regular expressions#
 Синтакс регулярних виразів майже відповідає стандарту PCRE (perl compatible regular expressions).

 Загальна форма: #regexp# or /#regexp#/#options#.

 #Опції#:
 #i# - ігнорувати регістр символів;
 #s# - ^<wrap>розглядати весь текст як одну рядок, ‘#.#’ буде позначати будь-який символ;
 #m# - ^<wrap>розглядати весь текст як декілька рядків. ‘#^#’ та ‘#$#’ відповідають
початку та кінцю кожного "внутрішнього" рядку;
 #x# - ^<wrap>ignore space characters (unescaped ones, i.e. without backslash before).
This is useful to outline the complex expressions.

 #regexp# - the sequence of characters and metacharacters. The characters are
letters and digits, any other character is used verbatim when escaped, i.e.
prepended by the backslash ‘#\#’.

 Pay attention that all slashes and backslashes in a regular expression must
be escaped (prepended by the ‘#\#’ character) to be treated literally
rather than escape other characters themselves or mark
the end of expression. An example: the string "big\white/scary" looks in the
form of regular expression like "big\\\\white\/scary".

 #Метасимволи#

 #\#  - ^<wrap>the next character is treated verbatim, not a metacharacter;
 #^#  - ^<wrap>the beginning of string;
 #$#  - ^<wrap>the end of string;
 #|#  - ^<wrap>the alternative. Either expression before or after ‘#|#’ has to match.
      Example: "\d+\w+|Hello\d+" means "(\d+\w+)|(Hello\d+)", not "\d+(\w+|H)ello\d+".
 #()# - ^<wrap>grouping - it is used for references or when replacing matched text.
 #[]# - ^<wrap>character class - the metacharacter which matches any character
or range of characters enumerated in #[]#. Ranges are defined as [a-z].
Metacharacters are not taken into account in character classes. If the first
character inside the brackets is ‘#^#’ then this is a negative class. If the ‘#^#’ character itself
needs to be added to a class, then it must be either not the first one or escaped by a ‘#\#’.

 Except grouping, the parentheses are used for the following operations:
 #(?:pattern)#  - ^<wrap>usual grouping, but it does not get a number.
 #(?=pattern)#  - ^<wrap>the forward lookup. The matching continues from
the same place, but only if the pattern in these parentheses has matched. For
example, #\w+(?=\s)# matches the word followed by space character, and the space
is not included into the search result.
 #(?!pattern)#  - ^<wrap>the negation of forward lookup. The matching
continues from the same place if the pattern does not match. For example,
#foo(?!bar)# matches any "foo" without following "bar". Remember that this
expression has zero size, which means that #a(?!b)d# matches #ad# because #a#
is followed by the character which is not #b# (but #d#), and #d# follows the
zero-size expression.
 #(?<=pattern)# - ^<wrap>the backward lookup. Unfortunately, the pattern must have fixed length.
 #(?<!pattern)# - ^<wrap>the negation of backward lookup. The same restriction.

 #(?{name}pattern)# - group with a name. The name must contain only word characters (#\w#) and spaces (#\s#).

 #Quantifiers#

 Any character, group or class can be followed by a quantifier:

 #?#      - ^<wrap>Match 0 or 1 time, greedily.
 #??#     - ^<wrap>Match 0 or 1 time, not greedily.
 #*#      - ^<wrap>Match 0 or more times, greedily.
 #*?#     - ^<wrap>Match 0 or more times, not greedily.
 #+#      - ^<wrap>Match 1 or more times, greedily.
 #+?#     - ^<wrap>Match 1 or more times, not greedily
 #{n}#    - ^<wrap>Match exactly n times.
 #{n,}#   - ^<wrap>Match at least n times, greedily.
 #{n,}?#  - ^<wrap>Match at least n times, not greedily.
 #{n,m}#  - ^<wrap>Match at least n but not more than m times, greedily.
 #{n,m}?# - ^<wrap>Match at least n but not more than m times, not greedily.
 #{,m}#   - ^<wrap>equals to {0,m}
 #{,m}?#  - ^<wrap>equals to {0,m}?

 #"Жадібні" та "не жадібні" квантифікатори#

 Жадібний квантифікатор (Greedy) захоплює якомога більше символів, і лише якщо
подальший збіг не вдається, він "повертає" захоплені символи по одному,
перевіряючи збіг регулярного виразу (такий відкат досить дорогий за ресурсами).
 Наприклад, під час перевірки, що вираз "A.*Z" відповідає наступному рядку
"AZXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", вираз #.*# захоплює весь рядок, а потім
відкочує символ за символом справа наліво, поки не знайде Z, таким чином
рядок буде перевірено стільки разів, скільки потрібно буде пройти назад на кожну
літеру X, доки черга не дійде до Z. На противагу, якщо наш вираз буде "A.*?Z", то
Z буде знайдено відразу, наступним кроком. Не жадібний квантифікатор також відомий як #lazy#,
захоплює якомога менше символів, і лише якщо подальший збіг не вдається, він йде зліва
направо, захоплючи наступний символ, та перевіряючи рядок на збігання.

 #Special characters#

 Non-letter and non-digit character can be prepended by ‘#\#’ in most cases,
but in case of letters and digits this must be done with care because this is
the way the special characters are written:

 #.#    - ^<wrap>any character except carriage return. If there is “#s#” among
the options then dot matches any character.
 #\t#   - tab (0x09)
 #\n#   - new line (LF, 0x0a)
 #\r#   - carriage return (CR, 0x0d)
 #\f#   - form feed (0x0c)
 #\a#   - bell (0x07)
 #\e#   - escape (0x1b)
 #\xNNNN# - hex character, where N - [0-9A-Fa-f].
 #\Q#   - ^<wrap>the beginning of metacharacters quoting - the whole quoted
text is treated as text itself, not the regular expression
 #\E#   - the end of metacharacters quoting
 #\w#   - letter, digit or underscore (‘_’).
 #\W#   - not \w
 #\s#   - space character (tab/space/LF/CR).
 #\S#   - not \s
 #\d#   - digit
 #\D#   - not digit
 #\i#   - letter
 #\I#   - not letter
 #\l#   - lower case character
 #\L#   - not lower case character
 #\u#   - upper case character
 #\U#   - not upper case character
 #\b#   - ^<wrap>the word boundary - means that there is a word character to either left or right
 from the current position, and to the right or left, accordingly, there is a non-word character.
 #\B#   - not \b
 #\A#   - the beginning of the text, disregard the option “m”
 #\Z#   - the end of the text, disregard the option “m”
 #\O#   - ^<wrap>the no-return point. If the matching has passed by this character,
it won't roll back and and will return "no match". It can be used in complex expressions
after mandatory fragment with quantifier. This special character can be used when
big amounts of data are processed.
        Example:
        /.*?name\O=(['"])(.*?)\1\O.*?value\O=(['"])(.*?)\3/
        ^<wrap>Strings containing "name=", but not containing "value=", are processed (in fact, skipped) faster.

 #\NN#  - ^<wrap>reference to earlier matched parentheses. NN is a positive integer.
Each parentheses except (?:pattern), (?=pattern), (?!pattern), (?<=pattern) and (?<!pattern)
have a number (in the order of appearance).
        Example:
        "(['"])hello\1" matches to "hello" or 'hello'.

 #\p{name}# - ^<wrap>inner regexp reference to it's parsed bracket with specified #name#.

 #Examples:#

 #/foobar/# matches to "foobar", but not to "FOOBAR"
 #/ FOO bar /ix# matches to "foobar" and "FOOBAR"
 #/(foo)?bar/# matches to "foobar" and "bar"
 #/^foobar$/# matches to "foobar" only, but not to "foofoofoobarfoobar"
 #/[\d\.]+/# matches to any number with decimal point
 #/(foo|bar)+/# matches to "foofoofoobarfoobar" and "bar"
 #/\Q.)))$\E/# equals to "\.\)\)\)\$"


@RegExpRepl
$ #Regular expressions in replace#
 In "Replace with" line one can use special replace string regular
expressions:

 #$0#…#$N#

 The found group numbers, they are replaced with appropriate groups.
The numbers are assigned to the groups in order of opening parentheses
sequence in regular expression. #$0# means the whole found sequence.

 $#{#name#}#     Found pattern with specified #name#.


@ElevationDlg
$ #Request administrative rights#
 The current user may not have enough rights for certain file system
operations. In this case Far asks permission to retry the operation with
the elevated (administrative) rights.

 Available options:

 #Do this for all current objects#
 Do not ask for elevated rights during the current file system
operation.

 #Do not ask again in the current session#
 During the current session Far will elevate rights without asking
the user.

 See also #Request administrator rights# option in the
~System settings~@SystemSettings@ dialog.


@KeyMacro
$ #Macro commands#
 By default macros are loaded from files with #.lua# and #.moon# extensions residing in folder
#%FARPROFILE%\\Macros\\scripts#. See more details in #%FARHOME%\\Encyclopedia\\macroapi_manual.en.chm#.

 Keyboard macro commands or macro commands - are recorded sequences of key
presses that can be used to perform repetitive task unlimited number of times
by pressing a single hotkey.

 Each macro command has the following parameters:
 - ^<wrap>a hotkey, that will execute the recorded sequence when pressed;
 - additional ~settings~@KeyMacroSetting@, that influence the method and
   the area of execution of the recorded sequence.

 Macro commands are mostly used for:
 - ^<wrap>Performing repetitive task unlimited number of times by
pressing a single hotkey.
 - Execution of special functions, which are represented by
special commands in the text of the macro command.
 - Redefine standard hotkeys, which are used by Far for
execution of internal commands.

 The main usage of macro commands is assignment of hotkeys for calling
external plugins and for overloading Far actions.

 See also:

 ~Macro command areas of execution~@KeyMacroArea@
 ~Hotkeys~@KeyMacroAssign@
 ~Recording and playing-back macro commands~@KeyMacroRecPlay@
 ~Deleting a macro command~@KeyMacroDelete@
 ~Macro command settings~@KeyMacroSetting@
 ~The list of installed macros~@KeyMacroList@


@KeyMacroArea
$ #Macro command: areas of execution#
 Far allows the creation of independent ~macro commands~@KeyMacro@ (commands with
identical hotkeys) for different areas of execution.

 #Attention#: The area of execution, to which the macro command will
belong, is determined by the location in which the
recording of the macro command has been #started#.

 Currently those are the available independent areas:
 - file panels;
 - internal viewer;
 - internal editor;
 - dialogs;
 - quick file search;
 - select drive menu;
 - main menu;
 - other menus;
 - help window;
 - info panel;
 - quick view panel;
 - tree panel;
 - user menu;
 - screen grabber, vertical menus.

 It is impossible to assign a macro command to an already used hotkey. When
such an attempt is made, a warning message will appear telling that the macro
command that is assigned to this hotkey will be deleted.

 This way you can have identical hotkeys for different macro commands only
in different areas of execution.


@KeyMacroAssign
$ #Клавіатурні макрокоманди: гарячі клавіши#
 ~Клавіатурні макрокоманди~@KeyMacro@ можуть бути використані для перепризначення
стандартних клавіш чи комбінацій клавіш Far або для створення нових
клавіатурних команд.
 Додатково до стандартних комбінацій клавіш Far можна призначати
макрокоманди на #Ctrl+Shift+<літера>#, #Ctrl+Alt+<літера># і #Alt+Shift+<літера>#.

 A macro command #can't# be assigned to the following key combinations:
#Alt+Ins#, #Ctrl+<.>#, #Ctrl+Shift+<.>#, #Ctrl+Alt#, #Ctrl+Shift#, #Shift+Alt#,
#Shift+<character>#.

 Деякі комбінації клавіш (зокрема, #Enter#, #Esc#, #F1#, #Ctrl+F5#) неможливо
увести прямо, оскільки вони мають спеціальні функції. Для того,
щоб призначити макрос на одну з таких комбінацій клавіш,
виберіть її зі списку, що випадає.


@KeyMacroRecPlay
$ #Macro command: recording and playing-back#
 A ~macro command~@KeyMacro@ can be played-back in one of the two following modes:

 1. ^<wrap>General mode: keys pressed during the recording or the
playing-back #will be# sent to plugins.
 2. ^<wrap>Special mode: keys pressed during the recording or the
playing-back #will not be# sent to plugins that intercept editor events.

 For example, if some plugin processes the key combination - #Ctrl+A#, then
in the special mode this plugin will not receive focus and will not do what it
usually does as a reaction to this combination.

 Creation of a macro command is achieved by the following actions:

 #Start recording a macro command#
 Натисніть #Ctrl+<.># (Ctrl і клавішу з крапкою) to record
a macro in the general mode or #Ctrl+Shift+<.># (#Ctrl#, #Shift# and
a period pressed together) to record a macro in the special mode.
 Під час запису макрокоманди у верхньому лівому кутку екрана
виводиться символ '\CFR\-'.

 #Enter Contents of the macro command#
 All keys pressed during the recording will be saved with the following exceptions:
 - ^<wrap>only keys processed by Far will be saved. Meaning that if
during the macro recording process an external program is
run inside the current console then only the keys pressed
before the execution and after completion of that program
will be saved.

 #Note#: During macro recording, all other macros are disabled. Thus,
it is impossible to create a “multilevel” macro which would call
previously recorded macros.

 #Finish recording the macro command#
 To finish a macro recording there are special key
combinations. Because a macro command can be additionally
configured there are two such combinations: #Ctrl+<.># (#Ctrl#
and a period pressed together) and #Ctrl+Shift+<.># (#Ctrl#,
#Shift# and a period pressed together). Pressing the first
combination will end the recording of the macro command
and will use the default settings for its playback. Pressing
the second combination will end the recording of the macro
command and a dialog showing macro command ~options~@KeyMacroSetting@
will appear.

 #Assign a hotkey to the macro command#
 When the macro recording is finished and all the options are set the
~hotkey assignment~@KeyMacroSetting@ dialog will appear, where the hotkey that
will be used to execute the recorded sequence can be set.

 Playing back a macro is indicated by showing the '\2FP\-' character in the upper-left screen corner.
See also "~Macros.ShowPlayIndicator~@Macros.ShowPlayIndicator@" for turning that indication on/off.


@KeyMacroDelete
$ #Macro command: deleting a macro command#
 To delete a ~macro command~@KeyMacro@ an empty (containing no commands)
macro should be recorded and assigned the hotkey of the macro command that
needs to be deleted.

 This can be achieved by the following steps:
 1. ^<wrap>Start recording a macro command (#Ctrl+<.>#)
 2. Stop recording a macro command (#Ctrl+<.>#)
 3. Enter or select in the hotkey assignment
dialog the hotkey of the macro command that
needs to be deleted.

 #Attention#: after deleting a macro command, the key combination
(hotkey) that was used for its execution will begin
to function as it was meant to, originally. That is
if that key combination was somehow processed by Far
or some plugin then after deleting the macro command
the key combination would be processed by them as in
the past.


@KeyMacroSetting
$ #Параметри макрокоманди#
 Для задання додаткових параметрів ~макрокоманди~@KeyMacro@ почніть або
завершіть її запис за допомогою #Ctrl+Shift+<.># замість #Ctrl+<.># і виберіть
бажані опції у діалозі, що з'явиться:

 #Sequence:#
 Allows to edit the recorded key sequence.

 #Description:#
 Allows to edit the description of key sequence.

 #Дозволити під час виконання виведення на екран#
 Якщо відключити цей параметр, то під час виконання макрокоманди
Far Manager відключає перемальовування екрана. Усі зміни будуть
відображені після завершення макрокоманди.

 #Виконувати після запуску Far#
 Дозволяє виконувати макрокоманду відразу після запуску Far Manager.

 Умови виконання макрокоманди:

 #На панелі плагіна#
 [x] - виконувати, тільки якщо поточна панель плагінова
 [ ] - виконувати тільки для файлової панелі
 [?] - ігнорувати тип панелі

 #Виконувати для папок#
 [x] - виконувати, тільки якщо на панелі під курсором папка
 [ ] - виконувати, тільки якщо на панелі під курсором файл
 [?] - виконувати для папок і файлів

 #Позначено файли#
 [x] - виконувати, тільки якщо на панелі є позначені файли/папки
 [ ] - виконувати, якщо немає позначених файлів/папок
 [?] - ігнорувати стан позначення файлів

 Other execution conditions:

 #Порожній командний рядок#
 [x] - виконувати, тільки якщо командний рядок порожній
 [ ] - виконувати, тільки якщо командний рядок не порожній
 [?] - ігнорувати стан командного рядка

 #Позначено блок#
 [x] - виконувати, тільки якщо виділено блок у редакторі, viewer, command line or dialog input line
 [ ] - виконувати, якщо немає виділеного блоку
 [?] - ігнорувати стан виділення

 Notes:

 1. ^<wrap>Before executing a macro command, all of the above conditions are checked.

 2. ^<wrap>Some key combinations (including #Enter#, #Esc#, #F1# and #Ctrl+F5#,
#MsWheelUp#, #MsWheelDown# and other mouse keys combined with #Ctrl#, #Shift#, #Alt#) cannot be entered
directly because they have special functions in the dialog. To ~assign a macro~@KeyMacroAssign@
to one of those key combinations, select it from the drop-down list.


@KeyMacroList
$ #Macros: The list of installed macros#
 The following is a list of topics where you can find out which ~macros~@KeyMacro@
are available in the current Far Manager session.

 ~Common macros#~@KeyMacroCommonList@

 ~File panels~@KeyMacroShellList@
 ~Quick View panel~@KeyMacroQViewList@
 ~Tree panel~@KeyMacroTreeList@
 ~Info panel~@KeyMacroInfoList@
 ~Autocompletion in panels~@KeyMacroShellAutoCompletionList@

 ~Fast Find in panels~@KeyMacroSearchList@
 ~Find Folder~@KeyMacroFindFolderList@

 ~Dialogs~@KeyMacroDialogList@
 ~Autocompletion in dialogs~@KeyMacroDialogAutoCompletionList@

 ~Main menu~@KeyMacroMainMenuList@
 ~Change drive menu~@KeyMacroDisksList@
 ~User menu~@KeyMacroUserMenuList@
 ~Other menus~@KeyMacroMenuList@

 ~Viewer~@KeyMacroViewerList@
 ~Editor~@KeyMacroEditList@

 ~Help window#~@KeyMacroHelpList@

 ~Other areas~@KeyMacroOtherList@


@KeyMacroCommonList
$ #Macros: Common macros#
 The following macro keys are available in all areas.

<!Macro:Common!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroQViewList
$ #Macros: Quick View panel#
 The following macro keys are available in Quick View panel.

<!Macro:Common!>

<!Macro:Qview!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroMainMenuList
$ #Macros: Main Menu#
 The following macro keys are available in Main Menu.

<!Macro:Common!>

<!Macro:MainMenu!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroTreeList
$ #Macros: Tree Panel#
 The following macro keys are available in Tree Panel.

<!Macro:Common!>

<!Macro:Tree!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroDialogList
$ #Macros: Dialogs#
 The following macro keys are available in dialogs.

<!Macro:Common!>

<!Macro:Dialog!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroInfoList
$ #Macros: Info Panel#
 The following macro keys are available in Info Panel.

<!Macro:Common!>

<!Macro:Info!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroDisksList
$ #Macros: Change Drive menu#
 The following macro keys are available in Change Drive menu.

<!Macro:Common!>

<!Macro:Disks!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroUserMenuList
$ #Macros: User Menu#
 The following macro keys are available in User Menu.

<!Macro:Common!>

<!Macro:UserMenu!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroShellList
$ #Macros: File panels#
 The following macro keys are available in file panels.

<!Macro:Common!>

<!Macro:Shell!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroSearchList
$ #Macros: Fast Find in panels#
 The following macro keys are available in Fast Find dialog.

<!Macro:Common!>

<!Macro:Search!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroFindFolderList
$ #Macros: Find Folder#
 The following macro keys are available in Find Folder window.

<!Macro:Common!>

<!Macro:FindFolder!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroEditList
$ #Macros: Editor#
 Macro-commands available in the editor are listed below.

<!Macro:Common!>

<!Macro:Editor!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroViewerList
$ #Macros: Viewer#
 Macro-commands available in the viewer are listed below.

<!Macro:Common!>

<!Macro:Viewer!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroMenuList
$ #Macros: Other menus#
 The following macro keys are available in other menus.

<!Macro:Common!>

<!Macro:Menu!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroHelpList
$ #Macros: Help window#
 The following macro keys are available in Help window.

<!Macro:Common!>

<!Macro:Help!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroOtherList
$ #Macros: Other areas#
 The following macro keys are available in other areas: screen grabber, vertical menus.

<!Macro:Common!>

<!Macro:Other!>

 See also ~"The list of installed macros"~@KeyMacroList@


@KeyMacroShellAutoCompletionList
$ #Macros: Autocompletion in panels#
 The following macro keys are available in Autocompletion in panels.

<!Macro:Common!>

<!Macro:ShellAutoCompletion!>

 See also ~«The list of installed macros»~@KeyMacroList@


@KeyMacroDialogAutoCompletionList
$ #Macros: Autocompletion in dialogs#
 The following macro keys are available in Autocompletion in dialogs.

<!Macro:Common!>

<!Macro:DialogAutoCompletion!>

 See also ~«The list of installed macros»~@KeyMacroList@


@FarAbout
$ #Version information#
 Starts with the command #far:about#

 Displays:
 - Far Manager version and bitness
 - versions of the third-party libraries used in the project
 - names and versions of the active plugins


@CustomizingUI
$ #Customizing UI elements#
 All Far user interface elements are defined in #.lng# files (e.g., #FarEng.lng#).
You can customize these elements to your needs. For example, you can
change hotkeys or labels on a certain Far dialog. To override
UI elements, create a file with the name #Far<Lng>.lng.custom#
in #%FARHOME%# or #%FARPROFILE%# directory and provide new values for
the UI IDs you want to customize.

 For example, to make file system link types on Far panels look like
in the listing of DIR DOS command, you can create file #FarEng.lng.custom#
in the #%FARPROFILE%# directory with the following content:

@-
 \0A┌────────────────────────────┐\-
 \0A│\30│  │UTF-8│Ln 1/7│Col│8:34 PM\0A│\-
 \0A│\1b//[MListUp]                 \0A│\-
 \0A│\1b"..↑"                       \0A│\-
 \0A│\1b                            \0A│\-
 \0A│\1bMListFolder   = "<DIR>"     \0A│\-
 \0A│\1bMListSymlink  = "<SYMLINK>" \0A│\-
 \0A│\1bMListJunction = "<JUNCTION>"\0A│\-
 \0A│\071\30Help  \07 2\30Save  \07 3\30      \07 \30    \0A│\-
 \0A└────────────────────────────┘\-
@+

 You can specify replacement UI elements in two ways, on two separate
lines or on a single line. The new value should always be enclosed
in double quotation marks. You can find UI IDs you want to redefine
in the original #Far<Lng>.lng# file.

 If custom UI language files exist in both directories, the file
in #%FARPROFILE%# has precedence over the file in #%FARHOME%#.


@FarConfig
$ #Configuration editor#
 Starts with the command #far:config#

 Allows to view and edit all Far Manager’s options.
 Most options can be changed from the ~Options menu~@OptMenu@, however some options are available only here or using configuration import.
The options are displayed in a list with three fields per item: the name in the SectionName.ParamName format (for example, Editor.TabSize),
the type (boolean, 3-state, integer, string), and the value (for the integer type, hexadecimal and symbolic representations additionally displayed).
If current value of an option is other than the default, the option is marked with the ‘*’ character to the left of the name.

 Besides the list navigation keys, the following key combinations are supported:

 #Enter# or #F4#
 Toggle or edit the value.

 #Shift+F4#
 Edit the integer value as a hexadecimal number. For other types works as #F4#.

 #Alt+F4#
 Edit the integer value as a binary number. For other types works as #F4#.

 #Del#
 Reset the option to its default value.

 #Ctrl+H#
 Toggle display of unchanged options.

 #Shift+F1#
 Show the help for the current option, if available.

 #Ctrl+Alt+F#
 Toggle quick filtering mode.


@Codepages.NoAutoDetectCP
$ #far:config Codepages.NoAutoDetectCP#
 This parameter allows to exclude specific code pages from the heuristic code page detection results.
Such detection is unreliable by definition: it depends on statistical data and could guess wrong, especially when the amount of input data is small.

 By default the parameter is empty and there are no restrictions which code pages could be detected heuristically.

 If this parameter is set to #-1#, only the code pages, currenltly visible in the ~Code pages~@CodePagesMenu@ menu, will be accepted.
You can control which code pages are visible there with the #Ctrl+H# key combination and the #Favorites# section.

 If this parameter contains a comma-separated list of code page numbers, all the specified code pages will be excluded from the heuristic detection.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Help.ActivateURL
$ #far:config Help.ActivateURL#
 This numeric parameter controls whether Far will open (activate) URL
links in help files:

 0 - ^<wrap>URL links are not opened;
 1 - URL links are opened;
 2 - URL links are opened after user’s confirmation.

 Default value: 1 (links are opened).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Confirmations.EscTwiceToInterrupt
$ #far:config Confirmations.EscTwiceToInterrupt#
 This Boolean parameter controls the behavior of #Esc# key in the
confirmation dialog for canceling an operation.

 False - ^<wrap>#Esc# key closes the dialog and continues the operation;
 True  - #Esc# key closes the dialog and cancels the operation.

 Default value: False (close the dialog and continue operation).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.AllCtrlAltShiftRule
$ #far:config System.AllCtrlAltShiftRule#
 This numeric parameter controls which user interface objects can be
temporarily hidden with #Ctrl+Alt+Shift# key combination. Each bit
corresponds to a certain object type.

 Bit numbers:
 0 - Panels;
 1 - Editor;
 2 - Viewer;
 3 - Help window;
 4 - Dialogs and menus.

 If a bit is set, objects of the corresponding type can be hidden.

 By default, all objects can be hidden.

 See also ~System.CASRule~@System.CASRule@.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.CASRule
$ #far:config System.CASRule#
 This numeric parameter allows to disable #Ctrl+Alt+Shift# key
combination for temporary hiding user interface objects. Individual
bits control the behavior of left and right key combinations.

 Bit numbers:
 0 - Left #Ctrl+Alt+Shift# key combination;
 1 - Right #Ctrl+Alt+Shift# key combination.

 If a bit is set, corresponding key combination hides interface objects.

 By default, both key combinations are enabled.

 See also ~System.AllCtrlAltShiftRule~@System.AllCtrlAltShiftRule@.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Panel.ShellRightLeftArrowsRule
$ #far:config Panel.ShellRightLeftArrowsRule#
 This Boolean parameter controls the behavior of left and right arrow
keys, both on main keyboard and numeric keypad.

 False - ^<wrap>As in Far 1.70. If command line is not empty, the
behavior of #Left#, #Right#, #Numpad4#, and #Numpad6# keys depends
on the ~panel view mode~@PanelViewModes@.
         - ^<wrap>If file names are displayed in multiple stripes (panel
modes 2 and 3 by default), then the keys move panel cursor, just like
with empty command line.
         - ^<wrap>If file names are displayed in a single stripe (all
other panel modes by default), the keys control the command line caret.
 True  - ^<wrap>When the panel is on, the #Left#, #Right#, #Numpad4#,
and #Numpad6# keys always move panel cursor, even if the command line
is not empty. The behavior does not depend on the current panel mode.

 Note: The #Ctrl+D# and #Ctrl+S# keys always move command line caret.

 Default value: False (traditional behavior).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Panel.Layout.ScrollbarMenu
$ #far:config Panel.Layout.ScrollbarMenu#
 This Boolean parameter enables menu scrollbar when there are more menu
items than can fit vertically.

 False - ^<wrap>Never show menu scrollbar;
 True  - Show menu scrollbar if needed.

 Default value: True (show menu scrollbar if needed).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Panel.CtrlFRule
$ #far:config Panel.CtrlFRule#
 This Boolean parameter controls the behavior of #Ctrl+F# key
combination in the ~command line~@CmdLineCmd@.

 False - ^<wrap>The file name is inserted into the command line as it is
recorded in the file system;
 True  - The file name is inserted as it appears on the file panel,
possibly in lowercase or using the short name.

 Default value: False (insert as is).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Panel.CtrlAltShiftRule
$ #far:config Panel.CtrlAltShiftRule#
 This numeric parameter controls the behavior of #Ctrl+Alt+Shift# key
combination for temporary hiding file panels.

 0 - ^<wrap>Hide panels only (like #Ctrl+O# key combination);
 1 - Hide panels and command line;
 2 - Hide panels, command line, and functional key bar at the bottom
line.

 Default value: 0 (hide panels only).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Panel.RightClickRule
$ #far:config Panel.RightClickRule#
 This numeric parameter controls the behavior of #right mouse click#
on an empty stripe of file panel.

 0 - ^<wrap>Move panel cursor to the last file in the previous stripe
and select the file;
 1 - Move panel cursor to the last file in the previous stripe without
selecting the file (like the #left mouse click#);
 2 - Do not move panel cursor or select any file.

 Note: If the stripe is not empty the last file is always selected.

 Default value: 2 (do nothing).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.ExcludeCmdHistory
$ #far:config System.ExcludeCmdHistory#
 This numeric parameter suppresses saving commands of certain categories
to the history. If a bit in the parameter’s value is set, commands
of the corresponding category will not be saved.

 Bit numbers and corresponding command categories:
 0 - ^<wrap>Windows file type associations;
 1 - Far ~file associations~@FileAssoc@;
 2 - Executable files under cursor on ~file panel~@FuncCmd@;
 3 - Commands entered on ~command line~@CmdLineCmd@.

 Default value: 0 (save commands of all categories).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.Executor.RestoreCP
$ #far:config System.Executor.RestoreCP#
 This Boolean parameter controls whether Far will restore console code
page after the execution of an external program has completed. Some
programs change console code page during execution and do not restore
it before exiting. Use this parameter to compensate for this behavior.

 False - ^<wrap>Leave it as is; do not restore console code page;
 True  - Restore console code page after an external program exited.

 Default value: True (restore console code page).

 See also #CHCP# ~Operating system~@OSCommands@ command.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.Executor.ExcludeCmds
$ #far:config System.Executor.ExcludeCmds#
 This string parameter defines commands which will be directly passed
for execution to the operating system command processor (specified
by the #ComSpec# environment variable), without searching the current
directory, directories listed on the #PATH# environment variable,
or any other predefined places.

 The commands are separated by semicolon (#;#). Environment variables
surrounded by the percent sign (#%#) will be substituted.

 For example, if the value of this parameter is “DATE;ECHO” and “date”
is entered on the command line, the internal command processor’s #DATE#
command will be executed. To execute an external program “date.exe”,
type the file name verbatim, including extension. However, if “DATE”
is not listed in this parameter and the program “date.exe” exists
in one of the #PATH# directories, the internal command processor’s
command can never be executed.

 Ready-made settings for CMD.EXE and other well-known
command processors can be found in the
#Addons\SetUp\Executor.*.farconfig# files.

 Note: Far executes some ~operating system~@OSCommands@ commands
internally, without invoking operating system command processor. These
commands are not included in #Executor.*.farconfig# files. Some other
OS commands Far executes with the limited functionality. If the syntax
does not match exactly that specified in the
~Operating system commands~@OSCommands@ help topic, the command will
be passed for execution to the command processor.

 Default value: empty string #""#.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.Executor.ComspecArguments
$ #far:config System.Executor.ComspecArguments#
 This string parameter defines the arguments which Far will use to
invoke the operating system command processor (specified by the
#ComSpec# environment variable).

 The #{0}# placeholder will be replaced with the text of the command.
This parameter is handy with non-standard command processors requiring
unusual command line options or quoting.

 Default value: #/S /C "{0}"# (compatible with CMD.EXE).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Interface.FormatNumberSeparators
$ #far:config Interface.FormatNumberSeparators#
 This string parameter allows to override digit grouping symbol and
decimal symbol in OS regional settings.

 First symbol  - ^<wrap>digit grouping symbol;
 Second symbol - decimal separator symbol.

 Default value: empty string #""# (use OS regional settings).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.CmdHistoryRule
$ #far:config System.CmdHistoryRule#
 This Boolean parameter defines whether the current position
in ~commands history~@History@ will change if #Esc# is pressed after
#Ctrl+E# or #Ctrl+X# key combinations.

 False - ^<wrap>The current command in the history will remain the one
recalled with #Ctrl+E# / #Ctrl+X#.
 True  - The current command in the history will be reset to the latest
(newest) command.

 Note: The order of the commands in the history does not change in any
case.

 Default value: False (change the current position in the commands
history).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.ConsoleDetachKey
$ #far:config System.ConsoleDetachKey#
 This string parameter specifies key combination to detach Far console
from a non-interactive process running in it.

 If a long-running process is using Far console, press this key
combination to create a new Far console where Far will continue running
as if the process has already ended, while leaving the old console
to the process.

 This feature can come handy if, for example, an archiver process
started from the Far command line is taking more time than you
expected, and you want to continue editing a file opened in background
Editor, or simply do not want to launch a new Far instance.

 Default value: #"CtrlShiftTab"# (the #Ctrl+Shift+Tab# key combination
detaches Far console).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.QuotedSymbols
$ #far:config System.QuotedSymbols#
 This string parameter defines special characters that require quoting
of file and folder names. If a name contains one of these characters,
Far will surround it with double quotes when inserting into the command
line or editor, or copying to the clipboard.

 Default value: #" &()[]{}^=;!'+,` "#. The first symbol is
~Space (U+0020)~@https://en.wikipedia.org/wiki/Space_(punctuation)@;
the last symbol is ~Non-breaking space (U+00A0)~@https://en.wikipedia.org/wiki/Non-breaking_space@.

 See also ~System.QuotedName~@System.QuotedName@.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.QuotedName
$ #far:config System.QuotedName#
 This numeric parameter controls whether Far will surround with double
quotes file and folder names containing special characters (see
~System.QuotedSymbols~@System.QuotedSymbols@ parameter). Individual
bits control the behavior in different contexts.

 Bit numbers:
 0 - ^<wrap>Quote names when inserting into the command line or editor;
 1 - Quote names when copying to the clipboard.

 Default value: 1 (quote when inserting into the command line or editor).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Interface.AltF9
$ #far:config Interface.AltF9#
 This Boolean parameter controls the behavior of the #Alt+F9# key
combination (toggle the size of the Far console window).

 False - ^<wrap>Toggle Far window height between 25 and 50 lines; set
window width to 80 columns;
 True  - Maximize Far window or restore it to normal size.

 Default value: True (maximize / restore).

 Note: This parameter affects the behavior only in windowed mode.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Dialog.CBoxMaxHeight
$ #far:config Dialog.CBoxMaxHeight#
 This numeric parameter specifies the maximum height of history list
in dialogs.

 Default value: 8.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.UndoDataSize
$ #far:config Editor.UndoDataSize#
 This numeric parameter limits the size of undo memory buffer in Editor.

 Default value: 104857600 (100MB).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.CharCodeBase
$ #far:config Editor.CharCodeBase#
 This numeric parameter defines how the code of the character under the
cursor is represented on Editor’s status line.

 0 - Octal value (6 digits with the leading zero);
 1 - Decimal value (up to 5 digits);
 2 - Hexadecimal value (4 digits followed by the character ‘h’).

 Default value: 1 (decimal).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.BSLikeDel
$ #far:config Editor.BSLikeDel#
 This Boolean parameter defines the behavior of the #BackSpace# key when
a vertical block is selected in Editor.

 False - ^<wrap>Deletes the character to the left of the cursor; keeps
the (vertical) selection;
 True  - Deletes the selected vertical block, like the #Del# key does.

 Default value: True (deletes the selection).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.AllowEmptySpaceAfterEof
$ #far:config Editor.AllowEmptySpaceAfterEof#
 This Boolean parameter defines whether scrolling down in Editor (e.g.,
with the #Ctrl+Down# key combination) can leave empty space at the
bottom of the window.

 False - ^<wrap>Stop scrolling when the last line of the file appears
at the bottom of the window;
 True  - Continue scrolling until the last line of the file reaches the
cursor leaving empty space under the cursor.

 Default value: False (stop scrolling).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Interface.RedrawTimeout
$ #far:config Interface.RedrawTimeout#
 This numeric parameter specifies the refresh time (in milliseconds)
of the progress dialog displayed during various long-running
operations, such as copying, moving, deleting and searching files and
folders, applying access rights after moving files and folders,
scanning the file system.

 The larger the value, the less frequently the information about the
operation is displayed, the faster the operation itself is performed.

 Default value: 200 ms.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@TitleFormat
$ #far:config Interface.ViewerTitleFormat, Interface.EditorTitleFormat#
 These string parameters define console window title for
~Editor~@Editor@ and ~Viewer~@Viewer@.

 Macro #%File# is expanded to the name of the file being edited
or viewed.

 Macro #%Lng# is replaced with the word “edit” or “view” in the current
language, see ~Options menu~@OptMenu@.

 The #Far window title addons# string of the
~Interface settings~@InterfSettings@ will be automatically appended
to the console window title.

 Default value: #"%Lng %File"#.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.WipeSymbol
$ #far:config System.WipeSymbol#
 This numeric parameter defines the filler byte for the
~wipe file~@DeleteFile@ operation (#Alt+Del# key combination).

 Each byte of the file is overwritten with the least significant byte
of the parameter. If the parameter is set to #-1#, random values will
be used.

 Default value: 0.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.ShowCheckingFile
$ #far:config System.ShowCheckingFile#
 This Boolean parameter controls whether plugin’s name is displayed
in the console window title while the plugin is checking a file.

 When the user presses #Enter# or #Ctrl+PgDn#, Far invokes registered
plugins one by one to check if they can “open” or otherwise render the
file. If this parameter is True, Far will show plugin’s name in the
console window title while the plugin is checking the file.

 Default value: False (do not show plugins’ names).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.PluginMaxReadData
$ #far:config System.PluginMaxReadData#
 This numeric parameter defines the maximum amount of file data used
to find the plugin which supports the file.

 When the user presses #Enter# or #Ctrl+PgDn#, Far reads the number
of bytes specified by this parameter from the beginning of the file and
passes the data to registered plugins to check if they can “open”
or otherwise render the file.

 Minimum value is 131072 (128 KiB). The maximum is limited only by the
size of the logical address space (2^32 - 1 or 2^64 – 1).

 Setting the value of this parameter above 5 MiB is not recommended.

 Default value: 131072 (0x20000).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.SetAttrFolderRules
$ #far:config System.SetAttrFolderRules#
 This Boolean parameter defines the default value of the
#Process subfolders# option of the file ~Attributes~@FileAttrDlg@ dialog
when changing attributes of a single directory.

 False - ^<wrap>The #Process subfolders# option is on; date and time
fields are cleared.
 True  - The #Process subfolders# option is off; date and time fields
are set to the actual values.

 Default value: True (do not process subfolders).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.CopyBufferSize
$ #far:config System.CopyBufferSize#
 This numeric parameter defines the size of the buffer used by the
internal file copy routine (see #Use system copy routine# option of the
~System settings~@SystemSettings@ dialog).

 If the value of this parameter is zero, the default buffer size
of 32768 bytes is used.

 Default value: 0 (buffer size is 32768 bytes).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.SubstNameRule
$ #far:config System.SubstNameRule#
 This numeric parameter specifies the types of physical drives which
will be queried when Far detects drives assigned using #SUBST# command.

 Far attempts to detect if a drive was substituted to display
appropriate information on the ~Change drive~@DriveDlg@ menu and
~Info panel~@InfoPanel@, as well as in some other cases.

 Bit numbers:
 0 - Query removable drives;
 1 - Query drives of all other types.

 Default value: 2 (query all non-removable drives). For example,
if a drive is associated with a CD-ROM path, it will not be detected
as substituted.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.SubstPluginPrefix
$ #far:config System.SubstPluginPrefix#
 This Boolean parameter controls whether Far prepends plugin prefix
to the path to plugin panel’s object when inserting the path into the
command line (#Ctrl+F#, #Ctrl+[#, etc.) or copying it to the clipboard
(#Alt+Shift+Ins#, #Ctrl+Alt+Ins#).

 False - ^<wrap>Do not prepend plugin prefix to the path to an object
on plugin panel.
 True  - Prepend plugin prefix except when the plugin manages real
files, like #Temporary panel# does.

 Default value: False (do not prepend plugin prefix).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.CopySecurityOptions
$ #far:config System.CopySecurityOptions#
 This numeric parameter controls the initial state of the
#Access rights# option in the ~Copy / Move~@CopyFiles@ dialog.

 The #Access rights# option specifies the access rights assigned
to newly created files and folders and can be one of:

 #Default# - ^<wrap>Access rights are controlled by the operating system;
 #Copy#    - Copy access rights of the source objects;
 #Inherit# - Inherit access rights of the parent folder.

 The initial state of the #Access rights# option when the dialog
is opened is controlled by three bits of the
#System.CopySecurityOptions# parameter. Bits 0, 1, and 2 control the
state of the option in the Move dialog; bits 3, 4, and 5 -- in the Copy
dialog.

@=
 Copy     Move     ^<wrap>Initial state of the #Access rights#
 Dialog   Dialog   option when the dialog is opened
@=
 Bit 0    Bit 3    0 - ^<wrap>#Default# (bits 1 / 4 are ignored)
                   1 - controlled by bits 1 / 4

 Bit 1    Bit 4    0 - ^<wrap>#Copy# (if bit 0 / 3 is set to 1)
                   1 - #Inherit# (if bit 0 / 3 is set to 1)

 Bit 2    Bit 5    0 - ^<wrap>Defined by bits 0 and 1 / 3 and 4 of this parameter
                   1 - The last user’s choice (within the current Far session)

 Default value: 0 (when the dialog is opened, the #Access rights# option
is always set to #Default#; user’s choices are not remembered).

 Examples:

 #0x21# (binary 100'001)

 - ^<wrap>In the Move dialog, the #Access rights# option is always set
to #Copy#.
 - In the Copy dialog, the option is initially set to #Default#; then
the previous user’s choice is remembered (within the current Far
session).

 #0x1C# (binary 011'100)

 - ^<wrap>In the Move dialog, the #Access rights# option is initially
set to #Default#; then the previous user’s choice is remembered (within
the current Far session).
 - In the Copy dialog, the option is always set to #Inherit#.

 Note: The #System.CopySecurityOptions# parameter does not affect
creation of links (#Alt+F6#). In this case access rights are always
copied.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Interface.CursorSize
$ #far:config Interface.CursorSizeX#
 These numeric parameters control cursor size in Far console window.
Cursor size can be set separately for insert and override mode, as well
as for windowed and fullscreen mode.

@-
 ┌──────────╥───────────────────────┬───────────────────────┐
 │ Mode     ║ Windowed              │ Fullscreen            │
 ╞══════════╬═══════════════════════╪═══════════════════════╡
 │ Insert   ║ Interface.CursorSize1 │ Interface.CursorSize2 │
 ├──────────╫───────────────────────┼───────────────────────┤
 │ Override ║ Interface.CursorSize3 │ Interface.CursorSize4 │
 └──────────╨───────────────────────┴───────────────────────┘
@+

 The parameters specify the fraction of the character cell in percents
filled by the cursor. Parameters’ values may vary from 1 to 100
corresponding to the cursor changing from the single horizontal line
at the bottom of the cell to the solid block filling the entire cell.
If parameter’s value is zero, the system console setting is used.

 Default values:
 Interface.CursorSize1: 15
 Interface.CursorSize2: 10
 Interface.CursorSize3: 99
 Interface.CursorSize4: 99

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.WordDiv
$ #far:config System.WordDiv#
 This string parameter defines additional word delimiters besides
#Space# and #Tab#.

 Default value: #~~!%^&*()+|{}:"<>?`-=\\[];',./#

 This parameter can be changed via ~far:config~@FarConfig@ only.


@XLat.WordDivForXlat
$ #far:config XLat.WordDivForXlat#
 This string parameter defines word delimiters for transliteration
(#XLat# function) of the current word without selecting it.

 Default value: #Space#, #Tab# and characters #!##$%^&*()+|=\\/@?#.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.ReadOnlyLock
$ #far:config Editor.ReadOnlyLock#
 This numeric parameter controls the behavior of the Editor when opening
files with #Read-only#, #Hidden# or #System# attributes.

 Bit numbers:
 0 - ^<wrap>Lock down editing of read-only files;
 1 - Warn when opening read-only files;
 2 - Unused;
 3 - Unused;
 4 - Unused;
 5 - Also, apply the behavior defined by bits 0 and 1 to hidden files;
 6 - Also, apply the behavior defined by bits 0 and 1 to system files.

 Default value: 0 (allow editing of any files without warnings).

 For example, if this parameter is set to #0x43# (binary 0100'0011),
warning will be shown when opening read-only and system files; editing
of such files will be disabled.

 This parameter can be changed via ~far:config~@FarConfig@. Bits 0 and
1 are also controlled by the options #Lock editing of read-only files#
and #Warn when opening read-only files# of the ~Editor~@EditorSettings@
settings dialog.


@Editor.FileSizeLimit
$ #far:config Editor.FileSizeLimit#
 This numeric parameter defines file size limit; when exceeded,
a warning message will be shown before opening the file in Editor.

 If the value of this parameter is zero, the warning is disabled. The
limit is defined in bytes.

 Default value: 0 (file size is not checked, and the warning is never
displayed).

 Note: When a file is opened in Editor, its entire content is loaded
into memory. Thus, opening very large files could be undesirable. The
warning enabled by this parameter helps to avoid opening of large files
inadvertently.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.MsWheelDelta
$ #far:config System.MsWheelDelta* & System.MsHWheelDelta*#
 These numeric parameters define scroll speed when mouse wheel is rolled
or tilted. Scroll speed can be specified separately for different
directions and different areas.

 Roll the wheel one notch to scroll the specified number of lines at
a time vertically:

 System.MsWheelDeltaView  - ^<wrap>in the internal Viewer
 System.MsWheelDeltaEdit  - in the internal Editor
 System.MsWheelDeltaHelp  - on help pages
 System.MsWheelDelta      - in other areas

 Tilt the wheel to scroll the specified number of characters at a time
horizontally (Windows Vista and above):

 System.MsHWheelDeltaView - ^<wrap>in the internal Viewer
 System.MsHWheelDeltaEdit - in the internal Editor
 System.MsHWheelDelta     - in other areas

 Default value for all parameters: 0 (use system settings).

 Note: Rolling or tilting mouse wheel while holding #Alt# key always
scrolls one line or character at a time.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@System.CopyTimeRule
$ #far:config System.CopyTimeRule#
 This numeric parameter specifies whether the progress (speed, time, and
estimated remaining time) is displayed during file copy operations.

 Bit numbers:
 0 - ^<wrap>If set, show progress while copying to NUL;
 1 - If set, show progress during regular file copy operations.

 Default value: 3 (always display progress of file copy operations).

 Note: Since this feature requires some time to gather statistics, it is
likely that no progress is displayed for small files if the option
#Show total copy progress indicator# is turned off in the
~Interface settings~@InterfSettings@ dialog.

 This parameter can be changed via ~far:config~@FarConfig@ or by the
#Show copying time information# option of the
~Interface settings~@InterfSettings@ dialog. However, only values 0 or
3 can be set using this option.


@Policies.ShowHiddenDrives
$ #far:config Policies.ShowHiddenDrives#
 This Boolean parameter specifies whether Far honors the
#Hide these specified drives in My Computer# Windows Group Policy.

 False - ^<wrap>Far shows only drives visible (not hidden) in Windows
Explorer;
 True  - Far shows all drives (ignores the Group Policy).

 Default value: True (show all drives).

 Note: The state of this Group Policy is stored in the #NoDrives# value
of the
#\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer# key in
both #HKLM# and #HKCU# hives of Windows Registry. If the NoDrives value
in HKLM hive is zero (no hidden files on Local Machine), the value
in HKCU hive is ignored.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.KeepEditorEOL
$ #far:config Editor.KeepEditorEOL#
 This Boolean parameter controls how line breaks within the text on the
clipboard are pasted into the edited file.

 False - ^<wrap>Line breaks in the pasted text are preserved. After the
paste operation, line breaks in the edited file may have different styles.
 True  - If the file is not empty, line breaks in the pasted text are
changed to match the line break style of the edited file. If the file
is empty, line breaks are not changed; this parameter has no effect.

 Default value: True (match line break style of the edited file).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.AddUnicodeBOM
$ #far:config Editor.AddUnicodeBOM#
 This Boolean parameter specifies whether Byte Order Mark (BOM) is added
at the beginning of the files created by the Editor and saved in
a UNICODE encoding (UTF-8, UTF-16LE, UTF-16BE).

 False - ^<wrap>BOM is not added.
 True  - BOM is added.

 Default value: True (BOM is added).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.NewFileUnixEOL
$ #far:config Editor.NewFileUnixEOL#
 This Boolean parameter specifies line break style in the files created
by the Editor.

 False - ^<wrap>Files are created with Windows line break style (CR LF).
 True  - Files are created with Unix line break style (LF).

 Default value: False (Windows line break style).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Panel.ShortcutAlwaysChdir
$ #far:config Panel.ShortcutAlwaysChdir#
 This Boolean parameter controls the behavior of
~folder shortcuts~@FolderShortcuts@ (#RightCtrl+0…9# key combinations)
when the panels are hidden.

 False - ^<wrap>Folder shortcuts insert the associated path into the
command line.
 True  - Folder shortcuts change the current folder even if the panels
are hidden.

 Default value: False (inset the shortcut path).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Macros.ShowPlayIndicator
$ #far:config Macros.ShowPlayIndicator#
 This Boolean parameter turns macro playback indicator (symbol ‘\2FP\-’
at the top left-hand corner of the screen) on or off.

 False - ^<wrap>The indicator is turned off.
 True  - The indicator is turned on.

 Default value: True (the indicator is on).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Viewer.SearchWrapStop
$ #far:config Viewer.SearchWrapStop#
 This tri-state parameter controls the behavior of the “continue search”
key combinations in the Viewer (#Shift+F7#, #Space#, #Alt+F7#) when
search wraps around the beginning or end of the file or passes the
search starting point.

 False - ^<wrap>Silently wrap around the beginning or end of the file
or the search starting point.
 True  - Show message when wrapping around the beginning or end of the file.
 Other - Show message when passing the search starting point.

 Default value: True (silently wrap around).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@XLat.Layouts
$ #far:config XLat.Layouts#
 This string parameter defines the input locales (keyboard layouts)
which Far will cycle through. If this parameter is specified, system
input locales will be ignored.

 This parameter contains semicolon (#;#) separated list of hexadecimal
input locale identifiers. For example, value #0409;0419# (or
#04090409;04190419#) can be used to switch between input locales
“en-US” and “ru-RU”.

 If less than two input locale identifiers are specified, Far will use
input locales installed in the system.

 Only first 10 locales are used, the rest of the list is ignored.

 Default value: empty string (use system input locales).

 See also Addons\XLat\Russian\Qwerty.farconfig.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@XLat.Flags
$ #far:config XLat.Flags#
 This numeric parameter controls the behavior of Far API function XLat
(string transcoding based on keyboard layout).

 Bit numbers:
 0  - ^<wrap>Automatically switch keyboard layout after transcoding
operation. Far cycles through all system keyboard layouts or layouts
defined in ~XLat.Layouts~@XLat.Layouts@ config parameter.
 1  - Sound beep after switching keyboard layout.
 2  - When a character could not be transcoded using
~XLat.Tables~@XLat.Tables@, Far will attempt to apply special
~XLat.Rules~@XLat.Rules@. If this bit is set and there is a named rule
corresponding to the current keyboard layout, this rule will be used;
otherwise, one of the three numbered rules will be used.
 16 - Transcode the entire command line if nothing is selected.

 Default value: 0x00010001 (switch keyboard layout and transcode the
entire command line if no selection).

 See also Addons\XLat\Russian\Qwerty.farconfig.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@XLat.Tables
$ #far:config XLat.Tables#
 These string parameters define two-way transcoding table which is used
by Far API function XLat (string transcoding based on keyboard layout).

 #XLat.Table1# ^<wrap>is the list of characters from the national
alphabet which will be replaced with their Latin counterparts defined
in #XLat.Table2#.
 #XLat.Table2# is the list of Latin characters which will be replaced
with their national counterparts defined in #XLat.Table1#.

 Default value: empty string (transcoding table is not defined).

 If a character cannot be transcoded using the table, Far will attempt
to apply special ~XLat.Rules~@XLat.Rules@.

 See also Addons\XLat\Russian\Qwerty.farconfig.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@XLat.Rules
$ #far:config XLat.Rules#
 These string parameters define special transcoding rules used by Far
API function XLat (string transcoding based on keyboard layout).

 Far will attempt to apply special rules if a character could not be
transcoded using the ~XLat.Tables~@XLat.Tables@.

 Each rule contains the sequence of character pairs. If a character
in the transcoded string matches the first character in the pair,
it will be replaced with the second character in the pair.

 One of the three numbered rules is used if the bit 2 (0x04)
in ~XLat.Flags~@XLat.Flags@ is zero or there is no named rule
corresponding to the current keyboard layout.

 #XLat.Rules1# ^<wrap>is applied if the previous character in the
transcoded string is from the national alphabet.
 #XLat.Rules2# is applied if the previous character in the transcoded
string is a Latin character.
 #XLat.Rules3# is applied if the previous character in the transcoded
string is neither from the national alphabet, nor a Latin character.

 A named special rule is applied if the bit 2 (0x04)
in ~XLat.Flags~@XLat.Flags@ is set to one. Far uses hexadecimal value
of the current input locale identifier (keyboard layout) to find the
corresponding rule. For example, if current keyboard layout is “en-US”,
Far will look up the rule named #XLat.00000409# and use it if it
exists. Otherwise, Far will fall back to the numbered rules.

 Default value: empty string for all rules (special rules are not
defined).

 See also Addons\XLat\Russian\Qwerty.farconfig.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Interface.DelHighlightSelected
$ #far:config Interface.DelHighlightSelected#
 This Boolean parameter controls how the items which will be deleted are
displayed in the file / folder #Delete# confirmation dialog.

 False - ^<wrap>The items to be deleted are always displayed in plain
text, without highlighting.
 True  - If more than one item is to be deleted or the deleted item
is not the item under cursor, the deleted item(s) will be highlighted
in the dialog.

 Default value: True (highlight the list if it does not match the item
under cursor).

 Note: This parameter does not affect which items will be deleted;
it only controls how the deleted items are shown in the dialog.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Interface.DelShowSelected
$ #far:config Interface.DelShowSelected#
 This numeric parameter controls the number of items which are displayed
in the file / folder #Delete# confirmation dialog.

 The maximum number of displayed items is either this parameter’s value
or half of Far window height, whichever is less. The minimum number
of items is one.

 Default value: 10.

 This parameter can be changed via ~far:config~@FarConfig@ only.


@History.Config
$ #far:config History.*#
 These parameters limit the number and the lifetime of the items of the
following histories:

 - History of command line ~commands~@History@:
   #History.CommandHistory.Count#
   #History.CommandHistory.Lifetime#

 - History of entries in dialog edit controls:
   #History.DialogHistory.Count#
   #History.DialogHistory.Lifetime#

 - History of recently ~visited folders~@HistoryFolders@:
   #History.FolderHistory.Count#
   #History.FolderHistory.Lifetime#

 - History of recently ~viewed and edited files~@HistoryViews@:
   #History.ViewEditHistory.Count#
   #History.ViewEditHistory.Lifetime#

 Default values:
 - Maximum history size (*.Count): 1000 items
 - Lifetime of an item (*.Lifetime): 90 days

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Editor.F8CPs
$ #far:config Editor.F8CPs#
$ #far:config Viewer.F8CPs#
 Ці параметри визначають кодові сторінки, що будуть використані при циклічному переборі, коли
натиснено #F8# у ~Редакторі~@Editor@ чи ~Переглядачі~@Viewer@.

  Значенням кожного параметру є список номерів кодових сторінок або символичні
назви, наведені нижче. Символічні назви нечутливі до регістру. Дублювання, а
також непідтримувані кодові сторінки ігноруються.

 - #ANSI#    ^<wrap>variants #ACP#, #WIN#
 - #OEM#     variants #OEMCP#, #DOS#
 - #UTF8#    variant #UTF-8#
 - #DEFAULT# означає кодову сторінку за замовчуванням, визначену в налаштуваннях діалогу
~Редактора~@EditorSettings@ чи ~Переглядача~@ViewerSettings@.

  Якщо рядок порожній або не містить підтримуваних кодових сторінок,
використовуються кодові сторінки ANSI та OEM.

 Special parameter value of #-1# stands for #ANSI;OEM;Default#.

 Example: #ANSI,OEM,65001#.

 Default value: empty string (ANSI and OEM code pages).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Panel.Tree.TurnOffCompletely
$ #far:config Panel.Tree.TurnOffCompletely#
 This Boolean parameter enables or disables all folder tree operations:

 - ^<wrap>~Tree panel~@TreePanel@ mode in
~left and right menus~@LeftRightMenu@;
 - The toggle tree panel shortcut key (#Ctrl+T#);
 - ~Find folder~@FindFolder@ panel command (#Alt+F10#);
 - Folder tree operations in ~copy, move and rename~@CopyFiles@
dialog (#F10#, #Alt+F10#, and #Shift+F10#).

 False - ^<wrap>Folder tree operations are #enabled#.
 True  - All folder tree operations are #disabled#.

 Note: If folder tree operations are disabled, folder tree cache files,
even if already exist, are not updated when folders are created,
deleted, or renamed.

 Default value: True (all folder tree operations are disabled).

 This parameter can be changed via ~far:config~@FarConfig@ only.


@Index
$ #Index help file#
<%INDEX%>
